{"type":"data","nodes":[null,{"type":"data","data":[{"posts":1,"topic":554,"representativeWords":557},[2,9,15,20,24,28,32,36,40,44,48,52,56,61,64,68,73,76,80,83,87,91,95,98,102,106,109,113,117,121,125,129,132,136,139,142,145,150,154,158,161,164,167,170,174,177,181,184,187,191,195,200,203,207,210,213,217,220,223,227,230,234,237,240,243,247,251,254,257,260,263,266,270,273,277,280,283,287,291,295,298,302,305,308,311,314,317,320,324,328,331,335,338,341,344,348,351,354,357,360,364,367,371,374,377,380,384,388,391,394,397,400,403,406,409,413,417,421,424,427,430,433,436,439,442,445,448,451,454,457,460,463,466,469,472,475,478,481,484,487,490,493,496,499,502,506,509,512,515,518,521,524,527,530,533,536,539,542,545,548,551],{"text":3,"timestamp":4,"topicId":5,"sentiment":6,"topicConfidence":7,"sentimentConfidence":8},"Hello expats! I need your attention for awhile. My dear cat Pasha has been missing since yesterday early morning. He is 1,5 years old-male- red cat. Super human friendly creature that has a potential for him to go together with whoever calls. If you see my boy around the Kalamaja region (especially Salme) please remember this post and kindly let me know.  P.s. He has a chip.",["Date","2022-12-30T11:00:17.000Z"],4,"Positive",0.94,0.5,{"text":10,"timestamp":11,"topicId":5,"sentiment":12,"topicConfidence":13,"sentimentConfidence":14},"Hello, the black and white cat \"Bort\" is missing. Have you seen him? I live in Heina street in tallinn. If you have some group to suggest me 🙏 I'm gonna check shelters too. Thanks",["Date","2022-12-30T09:58:07.000Z"],"Neutral",1,0.73,{"text":16,"timestamp":17,"topicId":5,"sentiment":12,"topicConfidence":18,"sentimentConfidence":19},"Does anyone have fish as pets here? I need to re home some endler guppies. let me know if you have some room in your tank for some friends",["Date","2022-12-27T19:11:35.000Z"],0.34,0.84,{"text":21,"timestamp":22,"topicId":5,"sentiment":12,"topicConfidence":23,"sentimentConfidence":8},"A pollllllll!!! Curiosity killed the cat, but I was wondering what *popular* (key word) messenger you use. Especially curious about how popular Telegram is in Europe among others (based on the previous post)🎄🎁🎄🎁☃️ Take your gift and Christmas tree👆🏼😀",["Date","2022-12-26T16:39:28.000Z"],0.61,{"text":25,"timestamp":26,"topicId":5,"sentiment":12,"topicConfidence":13,"sentimentConfidence":27},"Hello! Are you planning your vacation but you don't have a person to feed your cat or walk your dog? I can be that person, only for 10 euro per visit\u002Fwalk. Customer reviews can be viewed via DM.",["Date","2022-12-25T06:51:10.000Z"],0.68,{"text":29,"timestamp":30,"topicId":5,"sentiment":6,"topicConfidence":13,"sentimentConfidence":31},"Hello everyone, I was wondering if there are more than EESTI METSLOOMAÜHING and Loomapäästegrupp MTÜ rescuers which could help me with a injured bird I found this morning. It's pidgeon. I know the popular opinion about pidgeons, but I couldn't let him to die outside my house. I would appreciate all the contacts you share. Thank you in advance",["Date","2022-12-22T12:12:17.000Z"],0.57,{"text":33,"timestamp":34,"topicId":5,"sentiment":12,"topicConfidence":13,"sentimentConfidence":35},"CAT OWNERS PLEASE  My cat is sick & their regular vet, Cat Clinic OÜ is full. I have booked with them, & by their posts, l see the seem to specialize in dogs! What was your experience with them?",["Date","2022-12-20T17:04:20.000Z"],0.54,{"text":37,"timestamp":38,"topicId":5,"sentiment":12,"topicConfidence":13,"sentimentConfidence":39},"CAT OWNERS PLEASE.. Does anyone have experience with them? My cat is sick & regular vet, Cat Clinic OÜ is full until Thurs.  I have booked with them, but see by their posts that they're more of a dog clinic.",["Date","2022-12-20T17:01:23.000Z"],0.49,{"text":41,"timestamp":42,"topicId":5,"sentiment":6,"topicConfidence":13,"sentimentConfidence":43},"Hello dog lovers! The most requested group course is here again! And in a warm cozy training room in the city center. Basic obedience for all ages. It's a course of 10 lessons, during which we'll learn:  *Basics of positive reinforcement: markers, different types of rewards * How to communicate correctly: body language, emotion expression *How to play correctly: toys, hunting behavior, safe play *Capturing of the behavior: eye contact, walking on a loose leash *Everyday situations: how to stop jumping on people, stealing, how to teach \"stop\" before crossing the road. *Preventing resource guarding *Cooperative care basics. Willing participation in grooming or veterinary procedures. * Recall,… More",["Date","2022-12-12T14:20:51.000Z"],0.67,{"text":45,"timestamp":46,"topicId":5,"sentiment":6,"topicConfidence":13,"sentimentConfidence":47},"Hi Friends! I am finally arranging my doggo's arrival to Tallinn! 😍 He is more than 8kg so he needs to travel in cargo and due to work, I will not accompany him (he's traveled like this many times before without any issues). Any leads to a company who can help me arranging it? Within EU, pet passport, chip, vaccines all in order.  Thank you so much 💓",["Date","2022-12-02T16:48:33.000Z"],0.9,{"text":49,"timestamp":50,"topicId":5,"sentiment":6,"topicConfidence":13,"sentimentConfidence":51},"Hey mighty dog owners! I noticed there’s no ENG speaking dog owners community in Tallinn, so I decided to start one. Feel free to join, it’s a cozy winter we’ll be having together https:\u002F\u002Fwww.facebook.com\u002Fgroups\u002F934804634158607",["Date","2022-11-29T07:19:18.000Z"],0.83,{"text":53,"timestamp":54,"topicId":5,"sentiment":6,"topicConfidence":13,"sentimentConfidence":55},"Dwarf hamsters (2 month old) are looking for a VERY good home. Not agressive, used to hands, in Tallinn.",["Date","2022-11-29T06:41:09.000Z"],0.78,{"text":57,"timestamp":58,"topicId":5,"sentiment":6,"topicConfidence":59,"sentimentConfidence":60},"EDIT: Thank you every one and each of you for advices, offers to meet\u002Fdogsit and even those who just understood our situation and left words to comfort us ❤️. Im trying since yesterday to answer everybody separately every spare second I have, but wasn't successful so far 😅. Hopefully in the evening I will manage to finally answer everybody 😊. DOG SITTING \u002F DOG SEPARATION ANXIETY Hello, does any other family had a problem with dog after moving? Our dog was left alone only 3 times in 3 months (4 h, 45 min, 2,5 h) and immediately neighbours complained. I do even have to take him and leave him in a car, when Im taking my older child to kindergarten. This situation puts me and my younger child… More",["Date","2022-11-28T12:53:01.000Z"],0.51,0.41,{"text":62,"timestamp":63,"topicId":5,"sentiment":6,"topicConfidence":13,"sentimentConfidence":27},"Hi everyone. I’m looking for a pet sitter, any suggestions? Thank you in advance",["Date","2022-11-26T12:04:54.000Z"],{"text":65,"timestamp":66,"topicId":5,"sentiment":12,"topicConfidence":67,"sentimentConfidence":27},"The dog is missing and was hit by a car 🥺 If anyone sees him please contact the number or try to keep him. Family is looking for himUPD! 27.11 в 15.30 собачку поймали!  Друзья! 25.11.22, в Таллинне, около 20.00 в районе Тяхесаю Призма потерялся русский спаниель рыжего окраса в рыжей накидке. Зовут Элс- девочка. Позже, там же напротив Призмы, около остановки 67 автобуса ее сбила машина, она убежала в сторону Bauhaus. Оттуда (видно по камерам), по Арбу, между домов 8 и 12 и дальше в сторону белой церкви и Пирита-Козе. Пожалуйста, если вы ее где-то заметили, дайте сразу знать 🙏 58260469  Собака знает адреса: Мустакиви тее 17, Пунане 35 и Викерласе 15, возможно побежит туда. На ошейнике есть брелок с номером телефона хозяйки.  Девочка домашняя, подходит к людям и собакам, но сейчас в шоке..  Смотрите по сторонам🙏UP! 27.11 at 15.30 a dog was caught! Friends! 25.11.22, in Tallinn, around 20.00 near Tyhesayu Prism, a Russian red-colored spaniel in a red cape was lost. Their name is Els - a girl. Later, just across from Prisma, near bus stop 67, she was hit by a car and fled toward Bauhaus. From there (visible on cameras), along Arb, between houses 8 and 12 and further towards the white church and Pirita-Koza. Please, if you have seen her anywhere, let us know immediately 🙏 58260469 Dog knows the addresses 17 Mustakivi tee, Punane 35 and Vickerlase 15 possibly running there. The collar has a keychain with the hostess' phone number. A domestic girl, approaches people and dogs, but is now in shock.. Keep an eye out 🙏",["Date","2022-11-25T20:40:32.000Z"],0.8,{"text":69,"timestamp":70,"topicId":5,"sentiment":12,"topicConfidence":71,"sentimentConfidence":72},"Hello, maybe someone can help. I'm looking for a person that can fix some skirting boards in my apartment. I leave you a picture of a reference, my dog bit some of this, and I need to fix it 🙏🏼",["Date","2022-11-24T22:47:53.000Z"],0.62,0.52,{"text":74,"timestamp":75,"topicId":5,"sentiment":6,"topicConfidence":13,"sentimentConfidence":31},"Hey, can someone recommend dog sitter pls? I need someone to come and stay, but also be able to feed , and take for a walk or play in the yard. 🙂",["Date","2022-11-23T14:14:27.000Z"],{"text":77,"timestamp":78,"topicId":5,"sentiment":6,"topicConfidence":13,"sentimentConfidence":79},"Hi everyone! I was wondering if anybody has recommendations of dog trainers (ideally that speak English) in Nõmme area? 🐶  Thanks in advance 🙂",["Date","2022-11-19T10:10:45.000Z"],0.71,{"text":81,"timestamp":82,"topicId":5,"sentiment":6,"topicConfidence":13,"sentimentConfidence":35},"Hello everybody, I am new in Tallinn. Being a pet lover, I am looking for a puppy dog in Tallinn. Kindly assist me where to buy or if anyone selling plz DM me. Thanks",["Date","2022-11-19T00:23:16.000Z"],{"text":84,"timestamp":85,"topicId":5,"sentiment":6,"topicConfidence":18,"sentimentConfidence":86},"Dear friends, My wonderful house is back on market and available for long rent. Perfect location in Viimsi with sea views, fully equipped and ready to move in. Lots of privacy, kids and pets welcomed Contact for more:",["Date","2022-11-16T16:42:06.000Z"],0.98,{"text":88,"timestamp":89,"topicId":5,"sentiment":12,"topicConfidence":13,"sentimentConfidence":90},"Hi everyone! Could fellow pet owners advise me please - is it allowed to visit shopping mall with a small dog? Clothing, shoe stores, not the grocery part.",["Date","2022-11-10T15:46:51.000Z"],0.69,{"text":92,"timestamp":93,"topicId":5,"sentiment":6,"topicConfidence":39,"sentimentConfidence":94},"Hello everyone. Me and my partner are moving to Tallinn from Yerevan, and, well, looking for an apartment to rent. Long term, 1-2 bedroom, no specific location requirements. P.S. we have 2 adorable dogs (small and mid size) and the cutest cat. You'll fall in love with them once you meet them❤",["Date","2022-11-03T08:14:32.000Z"],0.99,{"text":96,"timestamp":97,"topicId":5,"sentiment":12,"topicConfidence":13,"sentimentConfidence":39},"I’m looking for a reliable Cat sitter when I’m out of the country (19th of December until 31st). Preferably someone who’s experienced with feral cats.  He’s a 3-year old (indoor) rescue from Greece with a lame paw, fully vaccinated and dewormed.  Preferably someone who could take him into their house. He’s scared of children and isn’t used to being around other pets. I’ve seen people recommending Laura (Lemmikuhoidja) unfortunately, I can’t reach her.  I live in Kesklinn. Recommendations welcome. Thank you.",["Date","2022-11-02T12:53:00.000Z"],{"text":99,"timestamp":100,"topicId":5,"sentiment":101,"topicConfidence":13,"sentimentConfidence":23},"Hey, can someone help me out with something odd. I've been told that when driving from point A to point B I should place my dog in a cage. I've looked in different government sites and I haven't found anything. Is this something I should consider true or do I have to think these people are just trying to sell me a travel cage for my dog? 😝",["Date","2022-11-01T20:21:37.000Z"],"Negative",{"text":103,"timestamp":104,"topicId":5,"sentiment":12,"topicConfidence":13,"sentimentConfidence":105},"Hello, looking for the flat for 1 month for family with cat. Me, my husband and our son( 6 years old). Tallinn.",["Date","2022-10-28T19:15:59.000Z"],0.85,{"text":107,"timestamp":108,"topicId":5,"sentiment":6,"topicConfidence":13,"sentimentConfidence":51},"Hi there.  Has anyone got advice on where to get a kitten in Tallinn? I'm located in the old city and would love a new furry family edition. Thanks!",["Date","2022-10-25T16:19:56.000Z"],{"text":110,"timestamp":111,"topicId":5,"sentiment":101,"topicConfidence":13,"sentimentConfidence":112},"With winter coming, my (almost) hairless dog is going to freeze herself to death. Even the floor is too cold for my liking. Do you know where to buy a heated pad\u002Fheated mat in Estonia ? Similar as the one in the picture. P.S:  Actual photo is not my dog.  P.S2: I've looked at Amazon and AliExpress, in case I can't find it locally or the price difference is too much I will go there.",["Date","2022-10-17T09:32:35.000Z"],0.63,{"text":114,"timestamp":115,"topicId":5,"sentiment":6,"topicConfidence":13,"sentimentConfidence":116},"Hi Everyone!  This is my girl, Roxy. 🐈‍⬛ We are looking for a catsitter to take care of her when we are away. Roxy will stay at home, doesn't need to be relocated but seeks human contact otherwise becomes moody. Can you recommend anyone whom you trust? * We live near the Kalevi Stadium which is very close to Keskturg. Thanx in advance, have a wonderful week!",["Date","2022-10-14T13:20:10.000Z"],0.93,{"text":118,"timestamp":119,"topicId":5,"sentiment":6,"topicConfidence":79,"sentimentConfidence":120},"🐶 🐩 🐕  Hello 👋🏻 my name is Laura, I am an Italian student currently studying at TLU. I’m looking for a part time job as a dog sitter, I grew up surrounded by dogs and I really miss my lovely labrador Lea back in Italy, so I would love to look after a dog here in Tallinn if anyone needs it. Optionally, I’d also love to tutor in english.",["Date","2022-10-11T11:28:41.000Z"],0.89,{"text":122,"timestamp":123,"topicId":5,"sentiment":6,"topicConfidence":13,"sentimentConfidence":124},"Hi all, We bought a new closed litter box for our cat but I don’t want to throw the old one away. I can give it away if anyone wants it or i‘d appreciate if you suggest any shelter or something I can donate it to. It’s large enough for adult cats and I cleaned it properly. Thanks!",["Date","2022-10-08T12:02:16.000Z"],0.75,{"text":126,"timestamp":127,"topicId":5,"sentiment":6,"topicConfidence":13,"sentimentConfidence":128},"Hello Dog owners of the group! I was wondering if you have coats for your dogs during cold time, or for example, if you need to put something in their paws so they don't freeze 🥶🐕 Thank you!",["Date","2022-10-07T09:23:56.000Z"],0.86,{"text":130,"timestamp":131,"topicId":5,"sentiment":6,"topicConfidence":13,"sentimentConfidence":43},"Hi! Looking for someone \u002F recommendations of a dog sitter for 2 miniature poodles for the 12th of November during day time and evening (around 8 hours or so). Preferably someone to come hangout with the doggos at our apartment in the old town 🤗",["Date","2022-10-06T14:02:35.000Z"],{"text":133,"timestamp":134,"topicId":5,"sentiment":12,"topicConfidence":13,"sentimentConfidence":135},"Good evening! Does anyone knows the people who is dealing with incoming pet cargo in Tallinn? Need to send my dogs by cargo and looking for the certified provider to sort out formalities.",["Date","2022-10-05T18:06:33.000Z"],0.87,{"text":137,"timestamp":138,"topicId":5,"sentiment":12,"topicConfidence":13,"sentimentConfidence":8},"Hi I am hoping to get a recommendation for a veterinarian that is preferably centrally located. I just moved to Tallinn (like a day ago so I don't know much about the veterinarians in the area) and my cat is having a lot of difficulty breathing. I am hoping to find someone that will see my cat ASAP.  I used the group search already and so far Tatari is NOT the place to go but I am also dealing with a pet emergency so time is crucial and I would like to find someone that will see him tomorrow. Thank you.",["Date","2022-10-02T22:16:35.000Z"],{"text":140,"timestamp":141,"topicId":5,"sentiment":6,"topicConfidence":13,"sentimentConfidence":7},"Even tho our Smoot (cat) had lots of fun with this chair as you can see... it is a very comfortable chair and adjustable, so if you have a pet you won't need to worry about they ruining it :D P.S. we are not selling the cat",["Date","2022-09-27T22:21:59.000Z"],{"text":143,"timestamp":144,"topicId":5,"sentiment":6,"topicConfidence":13,"sentimentConfidence":79},"Hello fellow expats.  I am looking for a photographer to do a family photoshoot.  Our family consists of myself, my wife who is pregnant with our first child, and our 5 dogs.  Clearly, the photographer should be comfortable with animals.  Any recommendations are appreciated.  Any photographers in the group who are interested, please PM to discuss in more detail.",["Date","2022-09-26T19:58:40.000Z"],{"text":146,"timestamp":147,"topicId":5,"sentiment":6,"topicConfidence":148,"sentimentConfidence":149},"While browsing apartments on city24.ee I came across one that looks quite nice and seems to come with a free pet 😳 Yes this is one of the advert official pictures!",["Date","2022-09-23T08:21:56.000Z"],0.42,0.97,{"text":151,"timestamp":152,"topicId":5,"sentiment":101,"topicConfidence":13,"sentimentConfidence":153},"Update: We had this issue with Turkish Airlines and Turkish Cargo. Unfortunately, there's no solution; for now, we will try to get him in the cabin. He's 9 kg and Pekingese. Hey everyone! I have an urgent case about my dog. Has anyone recently traveled to Tallinn with their dog by flight? The agency said that there is an embargo on animal admissions in Tallinn. I found this weird and I asked for written information. Just in case, I would be appreciated it if someone traveling with their dog could contact me 🙏",["Date","2022-09-22T12:06:31.000Z"],0.58,{"text":155,"timestamp":156,"topicId":5,"sentiment":6,"topicConfidence":157,"sentimentConfidence":47},"Dear people! My comfortable house 400m from the sea is available for good tenants in Viimsi. 3 bedrooms, private garden, pets allowed.  Please contact me for details BR, Anu 🤗",["Date","2022-09-18T12:07:42.000Z"],0.4,{"text":159,"timestamp":160,"topicId":5,"sentiment":6,"topicConfidence":13,"sentimentConfidence":43},"Anyone can advise dog friendly cafe in Tallinn? Please . preferably in the old town 🙂",["Date","2022-09-17T06:27:20.000Z"],{"text":162,"timestamp":163,"topicId":5,"sentiment":6,"topicConfidence":13,"sentimentConfidence":149},"🐕Tere! I'm searching a dog-trainer in Tallinn who speaks english and is good in his \u002F her job. Happy to read some recommendations :-) Cheers!",["Date","2022-09-14T19:45:58.000Z"],{"text":165,"timestamp":166,"topicId":5,"sentiment":12,"topicConfidence":13,"sentimentConfidence":55},"Need advice where to by animal-pijama in Tallinn (Urgent, so need the shop, not online)",["Date","2022-09-14T14:33:38.000Z"],{"text":168,"timestamp":169,"topicId":5,"sentiment":12,"topicConfidence":13,"sentimentConfidence":47},"Hi, does anyone know or have experience about animal hotels? Looking for a place for our guinea pigs during our vacation.",["Date","2022-09-13T08:30:16.000Z"],{"text":171,"timestamp":172,"topicId":5,"sentiment":12,"topicConfidence":173,"sentimentConfidence":72},"Hello everyone, I live in Tartu but my work place is in Tallinn and until now, unfortunately, I couldn't find a suitable apartment. so I'm looking to share an apartment with somebody for this month. my budget for rent is 250 euro for this month. if anybody has an offer please feel free to contact me. I'm quiet and don't have pet or any weird behaviors :D  hope to hear back from you",["Date","2022-09-13T05:55:19.000Z"],0.29,{"text":175,"timestamp":176,"topicId":5,"sentiment":12,"topicConfidence":13,"sentimentConfidence":23},"https:\u002F\u002Fwww.facebook.com\u002Fgroups\u002F1469368146810259?hoisted_section_header_type=recently_seen&multi_permalinks=1469424696804604 Just sharing a group for people who live in Tihemetsa (Pärnu County) (or the towns and villages nearby). It's a cat group to help the stray cats in that location with food, neutering, shelter, vet, rescues and etc. If anyone who lives there in this group, please share.",["Date","2022-09-12T07:59:14.000Z"],{"text":178,"timestamp":179,"topicId":5,"sentiment":6,"topicConfidence":72,"sentimentConfidence":180},"Hello, dear people There is this little buddy on the left side of a photo. A recently born kitten from Paljassaare, 3 months old. He is quite healthy, especially compared to other cats we took from there, and what he needs now is a new home. Just you know, to be a happy kitty and to make his owners happy :) What I'm looking for now is a temporary shelter home for him until we find owners for him. Any volunteers? It's a nice and easy job that will certainly improve this little guy's life and you can count on help from my side. If you are interested in helping him out or want to know more, reach me out in PM.  Peace pickles,  Nikita.",["Date","2022-09-11T15:22:52.000Z"],0.95,{"text":182,"timestamp":183,"topicId":5,"sentiment":6,"topicConfidence":13,"sentimentConfidence":90},"Hi all,  I hope dog people can help out. Does anyone feed their dogs raw meat diet? If yes, where do you get good quality food? Any chance to order some from hunters\u002Ffarmers directly for humane price ? 🙂",["Date","2022-09-10T14:45:10.000Z"],{"text":185,"timestamp":186,"topicId":5,"sentiment":6,"topicConfidence":13,"sentimentConfidence":116},"Hello lovely people. In case you have a dog and occasionally need to drop it for a day or long walk, please, save my contact🙂. I am total dog lover, as I travel a lot cannot afford currently to have one myself. Will not need any money and would be extremely delighted to spend some time with your dog, feed, walk and take care if the timing when you need support works for me too. Thanks 🙏",["Date","2022-09-09T09:48:15.000Z"],{"text":188,"timestamp":189,"topicId":5,"sentiment":6,"topicConfidence":13,"sentimentConfidence":190},"Hi everyone! We're moving to Estonia soon, and need to find pet-friendly furnished 6-12 month housing that will welcome 2 dogs under 6kg each, is located within walking distance of public transit, well-heated, fast internet service, and location that's generally quiet. Any suggestions on where to find this?",["Date","2022-09-08T14:43:32.000Z"],0.79,{"text":192,"timestamp":193,"topicId":5,"sentiment":6,"topicConfidence":194,"sentimentConfidence":135},"ENG:  Hi everybody! :) We are a working couple coming to Tallinn for one month in October starting from 29.09. We are looking for a furnished apartment with ideally 1-2 rooms. We are both working from home and are very quiet and clean people. We also consider a shorter period of time or house\u002Fpet sitting. Looking forward for any offers and advice!  Thank you! RUS: Всем привет! :)  Работающая пара снимет квартиру в Таллине на один месяц в начале октября с 29.09. Необходима квартира с мебелью, 1-2 комнаты. Мы оба работаем из дома, чистоплотные и не шумные. Будем рады рассмотреть ваши предложения. Спасибо.",["Date","2022-09-04T13:53:16.000Z"],0.31,{"text":196,"timestamp":197,"topicId":5,"sentiment":6,"topicConfidence":198,"sentimentConfidence":199},"Hey! Just a quick reminder that we have a trick &canine freestyle training for you and your doggo! Every Sunday 15.00, starting today! The most fun training program for dogs, where you have solid obedience exercises, combined with a fitness\u002Fcanine conditioning and on top of that you have a crazy creative process -choreography, costume making, etc.  If you want, you could even compete in canine freestyle dance competitions! https:\u002F\u002Fm.youtube.com\u002Fwatch?v=YygaUiqbyT4 About me www.bow-wow.tilda.ws\u002Fen",["Date","2022-09-04T08:39:58.000Z"],0.7,0.96,{"text":201,"timestamp":202,"topicId":5,"sentiment":6,"topicConfidence":13,"sentimentConfidence":71},"Update : Finally we got her today 🥰 Pls help me to find my cat! Around Mustamäe tee 96 area. Today it was the first time I get her outside with harness but she escaped & I couldn’t find her!!! Any type of help, suggestion will be appreciated!😞",["Date","2022-09-03T19:34:22.000Z"],{"text":204,"timestamp":205,"topicId":5,"sentiment":12,"topicConfidence":13,"sentimentConfidence":206},"Hi everyone. We are in Greece, flying back to Tallinn tomorrow and last minute the airline changed the plane type and we cannot bring our dog back with us… (we brought her to Greece with us when we came for holiday a few weeks ago). Luckily, she can stay with my family in Greece, but she is very old and I really don’t want her to die away from me (sorry, it sounds melodramatic, but those of you who have a dog might understand). Is there a cargo service that you have used and recommend that can take her from Greece and transport her unaccompanied to Tallinn?",["Date","2022-09-02T18:02:43.000Z"],0.47,{"text":208,"timestamp":209,"topicId":5,"sentiment":6,"topicConfidence":153,"sentimentConfidence":120},"Hello group! I have 2 questions 😁 1) Do you know where can I buy a personalized mouse pad? I've seen some places but they usually just have tshirts and bags. 2) Can you recommend a grooming service where (hopefully) they pickup your dogs from home? *Photo of my 3 dinosaurs so the post don't get lost 🦖 Thank you!!! 💖",["Date","2022-09-02T08:58:26.000Z"],{"text":211,"timestamp":212,"topicId":5,"sentiment":12,"topicConfidence":13,"sentimentConfidence":23},"Hello everyone, I saw a cat, someone might have lost it, here are the photos and approximately location where I saw it",["Date","2022-08-30T14:18:57.000Z"],{"text":214,"timestamp":215,"topicId":5,"sentiment":12,"topicConfidence":13,"sentimentConfidence":216},"Hey everyone, any recommendations of an experienced cat sitter in Tallinn? I have 4 cats that will need some attention around 19-29 September. Pretty please? 😺",["Date","2022-08-29T09:59:20.000Z"],0.74,{"text":218,"timestamp":219,"topicId":5,"sentiment":12,"topicConfidence":13,"sentimentConfidence":35},"Hello everyone, a dear friend has a young cat who swallowed a plastic toy left around by her kid. The veterinary says it needs an operation that cost 1500€ or the cat risks to die. She also is unemployed. Does anyone knows if there is some kind of help to ask, like a charity veterinary clinic or some other who has lower rates for unemployed or something along those line? If someone knows anything that can help please say so, this young cat's life might depend on it! Thank you all.",["Date","2022-08-28T09:39:46.000Z"],{"text":221,"timestamp":222,"topicId":5,"sentiment":12,"topicConfidence":13,"sentimentConfidence":59},"Looking for a vet recommendation.  Someone good with larger dogs and older dogs.  I have 4 huskies.   Does anyone here have some good vet experiences to share?",["Date","2022-08-26T06:19:09.000Z"],{"text":224,"timestamp":225,"topicId":5,"sentiment":6,"topicConfidence":13,"sentimentConfidence":226},"Hello, do you like dogs? Would you like to know more about the history of mankind's relationship with dog, and the evolution and domestication of dogs? Are you looking for a fun activity for the whole family for Saturday?  If so, you're welcome to join the English guided tour on Saturday!   The event is meant for people coming to Estonia from outside the European Union and is free of charge.",["Date","2022-08-25T17:21:29.000Z"],0.91,{"text":228,"timestamp":229,"topicId":5,"sentiment":6,"topicConfidence":13,"sentimentConfidence":47},"Hello, do you like dogs? Would you like to know more about the history of mankind's relationship with dog, and the evolution and domestication of dogs? Are you looking for a fun activity for the whole family for Saturday? If so, you're welcome to join the English guided tour on Saturday! The event is meant for people coming to Estonia from outside the European Union and is free of charge.",["Date","2022-08-25T17:20:09.000Z"],{"text":231,"timestamp":232,"topicId":5,"sentiment":6,"topicConfidence":72,"sentimentConfidence":233},"Edit: Thanks to Signe I now know that there already is a group for this dog park (Toompargi Koerte Jalutusväljak | Toompark Dog Park | Tallinn, Estonia), so I will delete my 'new' group. Nevertheless, I'm still interested in finding a playmate for my dog! :) - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -  Hi! There is a dog park near to Toompea castle. I’ve talked with many dog owners who had no idea this kind of park even existed, and they loved the idea of taking their pup there. So now there is a group for those people who would like to find their dog a playmate or let others now when they are there so their dog could socialise. I have a 4 month old German Shepherd who’d love to find friendly dogs to play with. So let me know if you’re interested via messages, dog park group or just comment this post. Thank you for your attention.",["Date","2022-08-21T15:05:47.000Z"],0.92,{"text":235,"timestamp":236,"topicId":5,"sentiment":12,"topicConfidence":13,"sentimentConfidence":8},"Hey guys, I am preparing to relocate my cat from Germany to Tallinn, does anyone have any experience with cargo services for pet relocation?  Any tips\u002Frecommendations will be highly recommended.. 🙏 FYI: I am unable to travel and bring the cat at the moment due to busy schedule so am considering plan B",["Date","2022-08-21T11:58:03.000Z"],{"text":238,"timestamp":239,"topicId":5,"sentiment":12,"topicConfidence":120,"sentimentConfidence":8},"Lost dog on nomme tee , near antalya restoran.",["Date","2022-08-16T14:53:32.000Z"],{"text":241,"timestamp":242,"topicId":5,"sentiment":101,"topicConfidence":13,"sentimentConfidence":216},"Is there anyone who would like to adopt this poor kitty?🥺 He's very friendly & had a collar on but today I notice that he doesn't have the collar anymore. I assume that the owner doesn’t want to take his responsibility anymore. He roams around lonely, I think the owner doesn’t care about him. I feed him often & he seems to be very hungry always.",["Date","2022-08-12T20:16:29.000Z"],{"text":244,"timestamp":245,"topicId":5,"sentiment":6,"topicConfidence":246,"sentimentConfidence":128},"We found this cat in kalamaja in the Ilmarin area. She is very friendly and we heard her asking for help so we brought her in. If anyone knows this lady contact me.",["Date","2022-08-08T10:15:04.000Z"],0.77,{"text":248,"timestamp":249,"topicId":5,"sentiment":101,"topicConfidence":13,"sentimentConfidence":250},"SOS!!!Anyone available to walk a dog in Lasnamäe area asap? My leg is injured and I can't go out. I Will pay of course!",["Date","2022-08-05T10:41:59.000Z"],0.48,{"text":252,"timestamp":253,"topicId":5,"sentiment":6,"topicConfidence":86,"sentimentConfidence":180},"Good day 😊 Can you recommend me any puppy school\u002Ftrainer who can teach our puppy basic things and teach us (owners) how to teach her later by ourselves? Would be happy for any recommendation 🐶",["Date","2022-08-04T14:09:20.000Z"],{"text":255,"timestamp":256,"topicId":5,"sentiment":6,"topicConfidence":13,"sentimentConfidence":86},"Hello everyone! I just would like to let you know that here in this group you have a dog sitter🐾  In case you need to go away somewhere or you would like to travel and be sure that your little (or not😄) fury friend feels nice and like at home, you could freely contact me and we will discuss all the details☺️ Of course, long walks are guaranteed😜 I am located in Viimsi🌊 Wishing you a wonderful end of summer!☀️",["Date","2022-08-02T17:25:08.000Z"],{"text":258,"timestamp":259,"topicId":5,"sentiment":6,"topicConfidence":19,"sentimentConfidence":86},"Hello expat community,  my wife and I just arrived in Tallinn and are having a wonderful time of settling in and exploring. We are wondering: is there any such thing as a dog daycare that would provide walks, company and fun with co-canines 2-3 times a week? Our dog is a 12 year old friendly but non neutered rescue, most likely a catahula leopard dog, but perhaps only a weird shepherd labrador mix. Grateful for any hints!",["Date","2022-08-01T19:22:04.000Z"],{"text":261,"timestamp":262,"topicId":5,"sentiment":6,"topicConfidence":79,"sentimentConfidence":199},"We have an adorable little black girl kitten to give away to a loving home 🐈‍⬛  ❤️ 2.5 months old ❤️ weaned & toilet trained  ❤️ fabulous with children  We live in Maardu Küla.  DM me if you’re interested!",["Date","2022-07-19T18:29:53.000Z"],{"text":264,"timestamp":265,"topicId":5,"sentiment":12,"topicConfidence":13,"sentimentConfidence":59},"Hi all👋 what is the best way to bring two cats here from UK? Any personal experience? 😣 mu understanding only Air Baltic takes cats and only in cargo? Which is thousands of pounds. Other option is driving them myself which is like 1,5k in petrol alone, any other ways? Thank you",["Date","2022-07-16T15:45:35.000Z"],{"text":267,"timestamp":268,"topicId":5,"sentiment":12,"topicConfidence":13,"sentimentConfidence":269},"Hello!  Anyone had an experience with https:\u002F\u002Fwww.trustedhousesitters.com\u002F ?  Is it worth the membership fee? And is it realistic to find a catsitter if I need it after 2 weeks for example.",["Date","2022-07-13T17:00:00.000Z"],0.81,{"text":271,"timestamp":272,"topicId":5,"sentiment":12,"topicConfidence":13,"sentimentConfidence":8},"Hi, I'm a dog photographer from Finland and I'm looking for a dog model for photo session near Tallinn. This probably isn't the best group to put this ad on but I have no better options so ... 😅 Photoshoot would be held in Jägala (the waterfall area) next week most likely on Thursday (July 21st) if the weather is good. Photoshoot is free for the dog owner and they will be getting few free photos as a thank you.  I'm looking for an obedient dog who isn't afraid of water. Preferably midsize or big. The dog should be able to stand still and sit still.  If you would be interested or you know someone who would, please comment below preferably with the image of the dog.  More of my photos can be found on my Instagram www.instagram.com\u002Ftiiatahvanainen_photography or my website www.tiiatahvanainen.com which is only in Finnish though",["Date","2022-07-12T19:43:58.000Z"],{"text":274,"timestamp":275,"topicId":5,"sentiment":12,"topicConfidence":13,"sentimentConfidence":276},"New puppy \u002Fbasic obedience classe in July! Greetings! My name is Alexandra and I am a professional dog trainer and handler with more than 14 years of experience.  At the moment I can take two new dogs for one-to-one training or behavior correction and five dogs in a group. MY EDUCATION: 2003 Dog Handler school at Kennel club\u002F St. Peterborough 2009 Сynology school at Moscow State Academy of Veterinary Medicine and Biotechnology 2010 School of salon and professional grooming \"Bonsherry\". 2011 Dog handling workshop with Camilla Tells (Sweden).",["Date","2022-07-12T14:20:00.000Z"],0.56,{"text":278,"timestamp":279,"topicId":5,"sentiment":12,"topicConfidence":13,"sentimentConfidence":72},"Hi everyone!  Is there anyone who moved to Estonia with a pet? Me and my wife are about to move Tallinn with our cat. We did all the microchip, vaccination and blood test processes but according to regulations we need to wait three months before we move. Our school will start next month and we don't want to wait or leave our cat for three months. Is there anyone who has experience with moving to EU from a non EU country with a pet?",["Date","2022-07-07T09:24:28.000Z"],{"text":281,"timestamp":282,"topicId":5,"sentiment":6,"topicConfidence":13,"sentimentConfidence":149},"Hey hey! Hello Expats ! I cat sit - dog walk your furry friends while you are in need ! In case of need you can DM me and I can provide you my references\u002Fdetails ☀️ Have a great day! 🐈 🐕",["Date","2022-07-06T07:08:22.000Z"],{"text":284,"timestamp":285,"topicId":5,"sentiment":101,"topicConfidence":286,"sentimentConfidence":153},"Hello! Anyone here knows a very good grooming service for pet where they talk English?  My Jonsi needs a nail cut and he became very aggressive in those cases.  Last time I bring him to the vet they didn't properly handle him and ended up crying and hiding for 2 days, my heart broken in 1000 pieces :( Anyone who can suggest me a place where they are very gentle and professional?  Bonus Picture of my beautiful crazy dog",["Date","2022-06-28T05:22:19.000Z"],0.76,{"text":288,"timestamp":289,"topicId":5,"sentiment":12,"topicConfidence":13,"sentimentConfidence":290},"Hello I am arriving to Tallinn for work on the 3rd with my small dog Tiny we are looking for a room to rent long term and also new friends. Please feel free to add or PM me.",["Date","2022-06-26T13:02:29.000Z"],0.55,{"text":292,"timestamp":293,"topicId":5,"sentiment":6,"topicConfidence":13,"sentimentConfidence":294},"Hello!  My dogs are coming to Estonia in around a month from my home country and I wonder if you know what do I need to do to pick them up from the airport. I did everything else through a relocation company, so I just need information for customs release or whatever is called. TIA!! ❤️❤️❤️",["Date","2022-06-26T11:31:06.000Z"],0.65,{"text":296,"timestamp":297,"topicId":5,"sentiment":12,"topicConfidence":157,"sentimentConfidence":290},"Thanks for accepting me. Im brand new and looking for an alternative to the hostel. From Michigan with no intent to return.Well, having learned of the, coming, perpetual frozen night, im thinking snow bird. I cant do that after 50 michigan winters.  So my post should be looking to pet sit or plant sit until the end of warmth. I grew up with horses, trained as a horeshoer, cared for livestock, cats, dogs, goats, jackasses, tropical fish, fresh water fish, amphibibians, reptiles, insects, arachnids, tropical pet and farm birds, cows, racoon, and others.  Fear few but respect all.  Worked in greenhouses, and vegetable farms, studied permaculture and am a certified holistic health coach with a… More",["Date","2022-06-25T17:10:46.000Z"],{"text":299,"timestamp":300,"topicId":5,"sentiment":6,"topicConfidence":301,"sentimentConfidence":19},"Dear people, My comfortable house 400m from the sea is available for good tenants in Viimsi. 3 bedrooms, private garsen, pets allowed.  Please contact me for details BR, Anu",["Date","2022-06-23T13:55:14.000Z"],0.38,{"text":303,"timestamp":304,"topicId":5,"sentiment":6,"topicConfidence":13,"sentimentConfidence":7},"Any fellow dog owners can recommend a dog sitter from July 07th to 25 either Tallinn or Tartu would be ideal.   Thanks in advance 🙂.",["Date","2022-06-21T13:24:19.000Z"],{"text":306,"timestamp":307,"topicId":5,"sentiment":6,"topicConfidence":276,"sentimentConfidence":294},"Hi hi any Spanish people here who can give me advice on finding affordable temporary housing in Barcelona? I've got a training coming up there 🙃 any functioning house&pet sitting platforms used locally there? Thank you for any leads 🙏",["Date","2022-06-18T08:37:34.000Z"],{"text":309,"timestamp":310,"topicId":5,"sentiment":6,"topicConfidence":13,"sentimentConfidence":276},"Hi all! Can anyone suggest a good dog groomer? Tried Petcity ones, but they are postponing all the time, but my home can't survive this much fur anymore.  Pic for tax :D Thank you all! Got our groomer.",["Date","2022-06-17T07:15:17.000Z"],{"text":312,"timestamp":313,"topicId":5,"sentiment":6,"topicConfidence":13,"sentimentConfidence":233},"Hello people! I have a question, since my boyfriend and I are leaving for our vacation from the 23.06 - 03.07 and need somebody to take care of our pet bunny🐰 (who lives in a cage). We would bring him and all of his necessities.  I would be very thankful if somebody would be able to take care of him and will also give a gift to the person who would like to do it. Thxx😊",["Date","2022-06-14T09:31:13.000Z"],{"text":315,"timestamp":316,"topicId":5,"sentiment":12,"topicConfidence":13,"sentimentConfidence":290},"Hi. I have a Dachshund and unfortunately a bad leg. I would need sometimes someone to take him out for a 30 min walk. Not very often but only when my wife is out of Tallinn. Dog is very friendly. 2,5 years old. Male. I'll compensate. Kesklinn. Near police park. 100 metres from Stockmann",["Date","2022-06-12T16:41:17.000Z"],{"text":318,"timestamp":319,"topicId":5,"sentiment":6,"topicConfidence":13,"sentimentConfidence":128},"Hello! Does anyone know if there is a doggy daycare in Tallinn? ❤ Thanks!",["Date","2022-06-07T10:10:27.000Z"],{"text":321,"timestamp":322,"topicId":5,"sentiment":6,"topicConfidence":323,"sentimentConfidence":120},"Hello everyone, my girlfriend and I would like to do some house sitting in Tallinn from 20.7 to 27.7, if there is anybody who is away for this period of time and needs somebody to look after the house, pets, and garden we would be more than happy to help!",["Date","2022-06-03T10:40:18.000Z"],0.28,{"text":325,"timestamp":326,"topicId":5,"sentiment":12,"topicConfidence":13,"sentimentConfidence":327},"It’s tick season 🤯  Where are you taking your furry friends for grooming?  Please give some suggestions if you have any .  🌸",["Date","2022-05-28T18:50:27.000Z"],0.72,{"text":329,"timestamp":330,"topicId":5,"sentiment":6,"topicConfidence":13,"sentimentConfidence":286},"This is not a complaining post!  I have never tried the Reading dog service provided by the Keskraamatukogu yet but I am surprised at this offer. Thank you the one who initiated this idea.",["Date","2022-05-27T08:52:21.000Z"],{"text":332,"timestamp":333,"topicId":5,"sentiment":6,"topicConfidence":334,"sentimentConfidence":276},"Hello everybody! A while ago when my husband and I lost our jobs due to the pandemic, we decided to start our pet focused art studio where we do pet portraits with human characterization. TO DO THEM YOU JUST SEND US PHOTOS OF YOUR PETS AND WE WILL DO THE MAGIC!!!! 10% of all sales will be donated to upaw.org, which is an organization that brings together several shelters for homeless animals in the Ukrainian War. What we offer is : -A Portrait of pets from the photos you send us. - The format is A4 or A3, digital, printed or framed. - The price is from 20 euros. AND SHIPPING IS TOTALLY FREE. To more info you can visite my web https:\u002F\u002Fen.gatydog.com\u002F (For those who want to donate to the organisation, without the need to order a portrait, you can do so at the following link. Everything donated goes directly to the shelters https:\u002F\u002Fen.gatydog.com\u002Fdonaciones ) For more information please do not hesitate to contact me Greetings  MAr",["Date","2022-05-26T16:29:21.000Z"],0.66,{"text":336,"timestamp":337,"topicId":5,"sentiment":12,"topicConfidence":13,"sentimentConfidence":105},"Any recommendations for a pet sitter who can give my daughter's rabbit some TLC for a few weeks?",["Date","2022-05-26T16:11:30.000Z"],{"text":339,"timestamp":340,"topicId":5,"sentiment":12,"topicConfidence":13,"sentimentConfidence":79},"Hi, any dog trainers or vets with some sort of dog psychological knowledge that can help me with a couple of questions?  PM, thanks.",["Date","2022-05-22T13:29:07.000Z"],{"text":342,"timestamp":343,"topicId":5,"sentiment":6,"topicConfidence":13,"sentimentConfidence":128},"Hello, I am looking for a house sitter for two dogs. People suggested posting again and ask for it here. The dogs are a beagle and a corgi. They are very friendly and playful. We live in Mustamäe siili. I would prefer someone reliable who could stay over with my dogs in the apartment. If you are interested let me know. The fixed dates will be shared later. It is approximately end of June or beginning of July (5-7 days). DM or leave a comment for more details.  Thanks. We are on Instagram as bouncy_queen_dogs. Follow our photos and videos. https:\u002F\u002Fwww.instagram.com\u002Finvites\u002Fcontact\u002F?i=iki903d2go47&utm_content=h3u034l",["Date","2022-05-20T19:19:22.000Z"],{"text":345,"timestamp":346,"topicId":5,"sentiment":12,"topicConfidence":7,"sentimentConfidence":347},"Can you recommend a good dog food for sensitive stomachs? I'm unfamiliar with the brands here and I'd like to find something my dog can have. Thanks!",["Date","2022-05-20T17:25:02.000Z"],0.53,{"text":349,"timestamp":350,"topicId":5,"sentiment":12,"topicConfidence":13,"sentimentConfidence":286},"Dear expats with pets, I am interested in knowing where do you leave your pets (dogs) when you travel or visit your families back home or during business trips? Are there any families with dogs that take care of pets while owner is away for couple of days? Also, if you are willing to share the services you use for example a hotel for your pets please do let me know. I know that Pet City has a animal hotel option. Has anyone ever used it? Thanks.",["Date","2022-05-19T16:39:28.000Z"],{"text":352,"timestamp":353,"topicId":5,"sentiment":6,"topicConfidence":13,"sentimentConfidence":120},"Hello, Can anyone recommend a good place that can accommodate cats for about a month? I'm looking for a pet hotel, nothing fancy but affordable and good for cats. Thank You",["Date","2022-05-19T14:20:34.000Z"],{"text":355,"timestamp":356,"topicId":5,"sentiment":6,"topicConfidence":190,"sentimentConfidence":86},"Two beautiful cat princesses are looking for their new home. Those ladies were rescued from the suburbs of Paljassaare. They are the best friends in the world, came a long way through struggle of the street life. They are like Inj and Jan - the white one is the calmest cat I've ever met, soft and with incredibly beautiful eyes and the black one is an active, energetic, and caring creature who always comes first for snuggling. If you feel like there is an empty place in your life, these two beauties can be the right fulfillment. Come to meet and chat with them!",["Date","2022-05-17T17:44:48.000Z"],{"text":358,"timestamp":359,"topicId":5,"sentiment":12,"topicConfidence":13,"sentimentConfidence":51},"Hey, is there someone who is flying to Frankfurt on June 1 or 2? My friend needs to travel there with two cats. As you’re allowed to take only one pet per person with you she’s looking for someone who could book one cat on rheir ticket.",["Date","2022-05-17T03:20:38.000Z"],{"text":361,"timestamp":362,"topicId":5,"sentiment":6,"topicConfidence":13,"sentimentConfidence":363},"Hello! Has anyone lost their cat? I've seen this cat near Saeveski 10a area. He's very friendly, he was letting everyone pet him. Maybe he's lost!",["Date","2022-05-09T11:44:57.000Z"],0.59,{"text":365,"timestamp":366,"topicId":5,"sentiment":6,"topicConfidence":13,"sentimentConfidence":124},"This young gentleman (less than 1 year old) is looking for home 🏡. Size to the knee, weight max 9 kg, color light sand, energetic, trustful, well- behaving, curious. The personnel of this shelter speaks English and they transport their dogs to any place in Europe. http:\u002F\u002Fwww.pets.ee\u002F",["Date","2022-05-08T13:20:42.000Z"],{"text":368,"timestamp":369,"topicId":5,"sentiment":6,"topicConfidence":7,"sentimentConfidence":370},"7th International Animal Futures Conference. ♥️🌱 #animalfutures #animalrights #conference https:\u002F\u002Floomus.ee\u002Fen\u002F7th-international-animal-futures-conference\u002F",["Date","2022-05-01T15:32:51.000Z"],0.82,{"text":372,"timestamp":373,"topicId":5,"sentiment":12,"topicConfidence":13,"sentimentConfidence":276},"Best vet clinic for cats in Tallinn 💅🏼 Suggestions?",["Date","2022-04-27T07:24:08.000Z"],{"text":375,"timestamp":376,"topicId":5,"sentiment":101,"topicConfidence":7,"sentimentConfidence":199},"One of my f*ckin worst fears in life came true.. Was petting my dog and I also pet a tick 😂😭😭! I have a panick attack, someone can recommend a vet\u002Fplace where they can remove them? Palun? 😭😭",["Date","2022-04-26T19:44:31.000Z"],{"text":378,"timestamp":379,"topicId":5,"sentiment":101,"topicConfidence":13,"sentimentConfidence":269},"I searched the group, but did not find anything on this: Has anyone had a recent experience with bringing a dog to Estonia from the states? The airlines I checked still have a COVID-era embargo on dogs in the cargo area.... which means I can't bring my dog over (\u003E 20 lbs must go in cargo). thx in advance.",["Date","2022-04-25T18:31:56.000Z"],{"text":381,"timestamp":382,"topicId":5,"sentiment":12,"topicConfidence":190,"sentimentConfidence":383},"Global pets relocation services  Our services  Door - door relocation services Pet import and export permit Rabies titer test For more information contact us through +255748139129 Email oscarsam288@gmail.com",["Date","2022-04-23T07:45:26.000Z"],0.88,{"text":385,"timestamp":386,"topicId":5,"sentiment":6,"topicConfidence":387,"sentimentConfidence":149},"Cat Clinic OÜ is the best, Dr Aleksandr is kind & caring. He took time to make Willy's passing peaceful & comforting.",["Date","2022-04-21T10:09:21.000Z"],0.64,{"text":389,"timestamp":390,"topicId":5,"sentiment":6,"topicConfidence":13,"sentimentConfidence":67},"Hi everyone!  Looking for a doggy sitter or good dog hotel from May 3-10. She's mixed breed around 16 kg and really likes other dogs but is quite scared of people! We live in Pirita.  She  is quite anxious so anyone with a bit of experience would help a lot 🙂  Thanks in advance for any tips or recommendations 🥰",["Date","2022-04-18T10:00:21.000Z"],{"text":392,"timestamp":393,"topicId":5,"sentiment":6,"topicConfidence":13,"sentimentConfidence":363},"Pet relocation services  Door  to door -pet Relocation   Moving to A new place is never easy.At global pet relocation we know this, which is why' we strive to offer a like a breeze one stop.solution for you, to create a stress & worry free experience ' for you and your furkids(s)  For door to door relocation services contact us through +255748139129 oscarsam288@gmail.com",["Date","2022-04-16T07:35:00.000Z"],{"text":395,"timestamp":396,"topicId":5,"sentiment":12,"topicConfidence":13,"sentimentConfidence":363},"A friend of mine is trying to move her German Shepherd from Tallinn to Kenya later this year and is looking for a pet shipping company who could help her ship the dog and do the paperwork. Has anyone on here used a pet shipping company to send animals out of Estonia? I have only ever brought animals in so don't actually know of any companies!!",["Date","2022-04-15T19:48:13.000Z"],{"text":398,"timestamp":399,"topicId":5,"sentiment":6,"topicConfidence":8,"sentimentConfidence":94},"Another expat approved apartment available within the next couple of weeks. Cats are also welcome! Not sure about other animals, should be fine too (we have two cats, that’s why I can confirm the cats only 😁).  Neighbours are great, the location is perfect for city lovers and there is no furniture in it. I especially love the huge red brick wall that extends throughout the apartment. We’re moving out as we bought a house ✨",["Date","2022-04-13T06:23:06.000Z"],{"text":401,"timestamp":402,"topicId":5,"sentiment":6,"topicConfidence":13,"sentimentConfidence":19},"Hey 😄 I'm moving to Tallinn this summer and in that case I'm wondering if anybody know a veterinarian who speaks English well ?  Looking to talk to a vet to ask for advice before I go there, but also to go to for my dogs yearly shots and so on.. 😅 I appreciate every tip 😊",["Date","2022-04-11T22:05:42.000Z"],{"text":404,"timestamp":405,"topicId":5,"sentiment":6,"topicConfidence":13,"sentimentConfidence":216},"Hello Guys, I'm travelling next week with my dog on Airbaltic and I would like to know if someone could accept to lend or to rent his cage for 3 weeks. I'm looking for a big cage (for example Gulliver 6 or 7). Let me know if you're interested :)",["Date","2022-04-11T11:58:40.000Z"],{"text":407,"timestamp":408,"topicId":5,"sentiment":6,"topicConfidence":327,"sentimentConfidence":233},"All animal lovers! If you can help even a bit, it would mean a lot. I hope it is ok to share it here. https:\u002F\u002Fgogetfunding.com\u002Fhelp-save-kenzos-life\u002F",["Date","2022-04-10T19:08:13.000Z"],{"text":410,"timestamp":411,"topicId":5,"sentiment":6,"topicConfidence":412,"sentimentConfidence":233},"Hello wonderful people. I’m looking for a new apartment that allow cats, but I haven’t had any luck so far. So now im turning to Facebook to see if anyone can help. Location would be preferred around kesklinn, Kadriorg or vanalinn. Would prefer rent around 700 or lower  euro (utilities not included) but I’m flexible with both location and rent. If anyone can help me and my cat, I would be very happy. Thanks In advance for any info! 😊",["Date","2022-04-10T18:30:37.000Z"],0.39,{"text":414,"timestamp":415,"topicId":5,"sentiment":6,"topicConfidence":416,"sentimentConfidence":370},"2 female miniature rex rabbits looking for a loving home. Black and white(Mesi) born 6th Jan 2020 is the mum of Mathilde (Grey and white) born 17th September 2021. Very friendly, they love space to run and jump. Currently living inside so need to stay inside until the weather warms up, but then can be outdoors if wanted. Mesi has a pedigree. Can sell with them an indoor cage (€40) and\u002For outdoor cage (€50) Location Tondi, Tallinn.",["Date","2022-04-07T13:42:53.000Z"],0.46,{"text":418,"timestamp":419,"topicId":5,"sentiment":12,"topicConfidence":420,"sentimentConfidence":153},"Hello friends. :-) Has this ever been tried in Estonia: Canada is getting ready to make it illegal for Landlord to discriminate against pets owner. see:",["Date","2022-04-07T13:24:17.000Z"],0.44,{"text":422,"timestamp":423,"topicId":5,"sentiment":101,"topicConfidence":13,"sentimentConfidence":67},"Hi. My dog has been having a seizure and I need to take her to the emergency vet. I have not been able to get a bolt to help. Is there anyone that is awake at the moment that would be able to help?",["Date","2022-04-07T00:55:50.000Z"],{"text":425,"timestamp":426,"topicId":5,"sentiment":6,"topicConfidence":13,"sentimentConfidence":47},"Good day. I would like to take a dog from the shelter. I am just of the beginning stage, so wanted to ask to share experience with me if some of you did it before. Can you share links and addresses of the good animal shelters? How is the process look like overall 😊🐶",["Date","2022-03-31T19:02:30.000Z"],{"text":428,"timestamp":429,"topicId":5,"sentiment":6,"topicConfidence":13,"sentimentConfidence":347},"Upd! They are with foster mom.  But since it's a kitten season, we still need your help! Write tome if you are interested)  Those babies are in urgent need of a foster family! Mother and 4 kittens. Cat Help Mtu will provide you with all the necessary staff, crate, food, litter etc. And will pay for vet bills.  They just need a safe space!",["Date","2022-03-30T13:06:38.000Z"],{"text":431,"timestamp":432,"topicId":5,"sentiment":12,"topicConfidence":269,"sentimentConfidence":128},"Hey all! Does anyone have pet relocation service suggestions, I need to relocate my Pomeranian from Spain to Tallinn. 🤔",["Date","2022-03-26T15:57:39.000Z"],{"text":434,"timestamp":435,"topicId":5,"sentiment":6,"topicConfidence":86,"sentimentConfidence":120},"Just a big Thank You to the group. I had lost my dog, but I took my post down. It took about 5 min after my post before he was found thanks to all of you  he is home and safe!",["Date","2022-03-24T16:44:55.000Z"],{"text":437,"timestamp":438,"topicId":5,"sentiment":12,"topicConfidence":19,"sentimentConfidence":387},"New groups in May! Read the information below. Greetings! My name is Alexandra and I am a professional dog trainer and handler with more than 14 years of experience At the moment I can take two new dogs for one-to-one training or behavior correction. Group lessons are also available.  MY EDUCATION: 2003 Dog Handler school at Kennel club\u002F St.Peterborough 2009 Сynology school at Moscow State Academy of Veterinary Medicine and Biotechnology 2010 School of salon and professional grooming \"Bonsherry\". 2011 Dog handling workshop with Camilla Tells (Sweden). Dog handling workshop and ring-training workshop with Jerald O'Shea (Sweden). Irish wolfhound handling workshop with Irina Kirjushina (Magic… More",["Date","2022-03-20T12:04:35.000Z"],{"text":440,"timestamp":441,"topicId":5,"sentiment":12,"topicConfidence":13,"sentimentConfidence":120},"Garage sale\u002Fbigger items: 2 Gulliver IATA approved dogcrates size 6\u002FL €70 each 1 metal dogbench size L €30 1 outdoor garden\u002Fbalcony set €450",["Date","2022-03-19T13:21:49.000Z"],{"text":443,"timestamp":444,"topicId":5,"sentiment":6,"topicConfidence":13,"sentimentConfidence":31},"Hi, I can offer myself as a pet sitter, live in Kesklinn, could discuss an option to take your pet to my place (since May). I learn at home, so have enough time.",["Date","2022-03-16T16:29:04.000Z"],{"text":446,"timestamp":447,"topicId":5,"sentiment":6,"topicConfidence":13,"sentimentConfidence":233},"Hello All! Looking for recommendations on a veterinary that specialises in cancer (dog). I would appreciate it very much!",["Date","2022-03-14T09:45:45.000Z"],{"text":449,"timestamp":450,"topicId":5,"sentiment":12,"topicConfidence":13,"sentimentConfidence":233},"Any dog sitter available tomorrow from 13:00 to 15:00 around Stroomi area? 🐕",["Date","2022-03-13T12:47:11.000Z"],{"text":452,"timestamp":453,"topicId":5,"sentiment":101,"topicConfidence":13,"sentimentConfidence":116},"Has anyone had any luck adopting a dog from a shelter in Tallinn? It seems many have very out of date websites or only have cats listed, and when I called the one on Sinirebase they were suuuuuper rude.",["Date","2022-03-11T14:24:04.000Z"],{"text":455,"timestamp":456,"topicId":5,"sentiment":6,"topicConfidence":420,"sentimentConfidence":14},"Hello All, wanted to check if any of you know of any businesses that do cakes for dogs. My doggo also has many many allergies so ideally we'd be looking for someone who is flexible and can customise ingredients. Thanks in advance! 🙏🏽",["Date","2022-03-10T19:12:54.000Z"],{"text":458,"timestamp":459,"topicId":5,"sentiment":12,"topicConfidence":71,"sentimentConfidence":198},"Hi expats, does anyone know what Estonian animal organizations help rescue animals from the Ukrainian shelters and bring them to Estonia from the Ukrainian border?  🐶🐱❤",["Date","2022-03-08T10:42:03.000Z"],{"text":461,"timestamp":462,"topicId":5,"sentiment":12,"topicConfidence":13,"sentimentConfidence":112},"Hi guys! Do you know of any English speaking vet with normal\u002Fdecent prices in Kesklinn area? We live near Lastekodu. Thanks!",["Date","2022-03-07T13:23:38.000Z"],{"text":464,"timestamp":465,"topicId":5,"sentiment":6,"topicConfidence":363,"sentimentConfidence":51},"UPD: Thanks to all of you, wonderful people. Our family is safe now and has a place to stay. Thank you all for your support and kindness, you are amazing. Stay safe, stay strong, and support each other. That's how we will win. Much love and hugs. Thank you  --------- Hi there, friends I and my mother, and our cat managed to escape from my beloved city of Kyiv, Ukraine Now we are in Tallinn and looking for a not overpriced apartment, preferably one-bedroom, where owners don't afraid of Ukrainian citizenship, war refugees and pets. It's sad but I've been asked about my status here a dozen times today. Also, I've contacted the help centre but there is still no result, for my regret I'm an IT specialist, quite a normal human being I hope. My mother and a cat are nice, too) Please dm me if you know something Thanks in advance",["Date","2022-03-06T17:15:11.000Z"],{"text":467,"timestamp":468,"topicId":5,"sentiment":6,"topicConfidence":13,"sentimentConfidence":27},"Hey 👋 Sharing my experience from today. Very often landlords in Estonia don’t allow to have pets or we may also travel a lot. Animal shelters provide a great opportunity to spend time with dogs. Think about this option if you want to go for a walk. They are waiting 🐶🐕🐩 4U.",["Date","2022-03-06T13:25:56.000Z"],{"text":470,"timestamp":471,"topicId":5,"sentiment":12,"topicConfidence":13,"sentimentConfidence":59},"Hello I need help with pet relocation. I am potentially moving back to the U.S. at the end of March or middle of April. I have three cats that I want to bring with me and I need to find two people who are interested in flying to the U.S. that will accompany the cats. The flight will be with Finnair and they only allow two pets in the cabin per flight, so I will have to book a separate flight for the third cat and person flying with the cat. They also only allow pets that have a person with them (I can't buy two seats and leave one empty and bring two cats by myself).  If anyone is interested in a free one way flight to the U.S. with the caveat that they have to bring one of my cats with them, then let me know. I will be on one of the flights with one of the volunteers but not on the other one. The flight is direct from Helsinki to Dallas. Currently I live in Pärnu. I would prefer that you are a couple or two female friends. And of course you must like cats. Again at the moment this plan is very tentative. Thank you.",["Date","2022-03-05T17:48:58.000Z"],{"text":473,"timestamp":474,"topicId":5,"sentiment":6,"topicConfidence":43,"sentimentConfidence":269},"Pets have the power to make us feel loved, safe, happy, cared for and many more things. So expect nothing less from the latest exhibition “The Pet Show” at the Fotografiska Tallinn. 25 artists have put on show their photos of pets and their owners. Gerrard Gethings compares cats and their owners with a pinch of  humor. While Martin Usborne puts on show poet hi all series of hunting dogs resting with Spain’s pretty landscapes at the background. In these dark ties the exhibition offers a moment to escape. The display is also suitable for kids.  Ticket to the museum is 15€.  Note that you can put the photo of your own pet on the wall at the museum by posting the picture in social media with a hashtag #fotografiskalemmikud.",["Date","2022-03-05T08:57:00.000Z"],{"text":476,"timestamp":477,"topicId":5,"sentiment":12,"topicConfidence":226,"sentimentConfidence":383},"PET CITY has cat & dog food donation boxes in their stores.",["Date","2022-02-28T22:48:32.000Z"],{"text":479,"timestamp":480,"topicId":5,"sentiment":12,"topicConfidence":327,"sentimentConfidence":334},"We are with all the Ukrainians in this moment of agony.  We are with our colleges in Shelter Ugolyok: Animal Rescue and Farm Sanctuary, Ukraine and in Fur Free Alliance - UAnimals. POLAND and HUNGARY have opened their borders to Ukrainians fleeing with their pets. Exceptionally, refugees are allowed to cross the border with animals even if the animals do not have papers. To those who have the possibility to donate, here are some ideas: https:\u002F\u002Fredcross.org.ua\u002Fen\u002Fdonate\u002F https:\u002F\u002Fwww.ukrainaheaks.ee\u002Fen https:\u002F\u002Fwww.bearsanctuary-domazhyr.org\u002Fways-to-give #slavaukraini #standwithukraine Oleme mõtteis ja südameis teiega, Ukraina, inimesed ja loomad Ukrainas.  Oleme mõtteis oma kolleegidega… More",["Date","2022-02-25T15:02:57.000Z"],{"text":482,"timestamp":483,"topicId":5,"sentiment":6,"topicConfidence":43,"sentimentConfidence":27},"UPD: I finally got message from my friend. Situation turned better: the second owner of the dogs will manage to pick them up. And she found people in Ukraine not far from border who can take care about them until this. Thank you so much for support! All the info was very helpful and we got a lot of offers to help from awesome Polish people ❤️ Guys, are there any Poland people? Can you help me with searching for information, please🙏? My friend is fleeing Ukraine with 6 animals. She has her own dog and cat+2 husky and 2 cats of her friend who stack in Crete and can’t come back. She hope to cross Poland border with all the zoo, but have no idea what to do next. She asked me to help find Husky help group in Poland, because her internet connection is bad. Can you please tell me in which groups I can ask help? Or maybe you know someone who can accommodate 2 dogs in Poland?",["Date","2022-02-25T14:04:57.000Z"],{"text":485,"timestamp":486,"topicId":5,"sentiment":6,"topicConfidence":13,"sentimentConfidence":43},"Hello! Would like to make a small research here 😙 How is your pet(s) sitting arranged when you need to be away?  What animal do you have?  Do you feel that you are missing someone you can always trust with your pet(s)?  I am very interested to hear about different species, not only dogs and cats 🙂",["Date","2022-02-16T10:06:51.000Z"],{"text":488,"timestamp":489,"topicId":5,"sentiment":6,"topicConfidence":13,"sentimentConfidence":294},"Hello! I am wondering if anyone working\u002Fvolunteering at a cat shelter would like some high quality grain free cat food (brands: Applaws, Mac's)? I have sealed boxes of wet and dry cat food that I would need to donate this week. Please DM me if you could put it to good use!",["Date","2022-02-14T15:54:33.000Z"],{"text":491,"timestamp":492,"topicId":5,"sentiment":6,"topicConfidence":13,"sentimentConfidence":51},"Hey everyone :) I need a really strong IATA compliant pet carrier for an upcoming flight. Have any of you had luck finding one in Tallinn? A lot of the stores have flimsy pet carriers, but I want something actually IATA compliant and indestructible. Thank you!",["Date","2022-02-14T06:29:38.000Z"],{"text":494,"timestamp":495,"topicId":5,"sentiment":12,"topicConfidence":13,"sentimentConfidence":105},"Parents of cats on a BARF diet, what products do you buy & where? Thanks 😸",["Date","2022-02-12T16:35:54.000Z"],{"text":497,"timestamp":498,"topicId":5,"sentiment":12,"topicConfidence":190,"sentimentConfidence":198},"New group!  Canine freestyle and advance trick training. Read the information below.  Greetings! My name is Alexandra and I am a professional dog trainer and handler with more than 14 years of experience At the moment I can take three new dogs for training or behavior correction. MY EDUCATION: 2003 Dog Handler school at Kennel club\u002F St.Peterborough 2009 Сynology school at Moscow State Academy of Veterinary Medicine and Biotechnology 2010 School of salon and professional grooming \"Bonsherry\". 2011 Dog handling workshop with Camilla Tells (Sweden). Dog handling workshop and ring-training workshop with Jerald O'Shea (Sweden). Irish wolfhound handling workshop with Irina Kirjushina (Magic Forest… More",["Date","2022-02-11T14:16:45.000Z"],{"text":500,"timestamp":501,"topicId":5,"sentiment":12,"topicConfidence":13,"sentimentConfidence":383},"does any one wants to give home for this special cat ?14.03.2022 В НОВОМ ДОМЕ ❤️ ЛАСКОВЫЙ И ДОБРЫЙ ФИЛИПП СРОЧНО ИЩЕТ ДОМ! Филя был найден в ужасном состоянии. Проделана большая работа про превращению этого настрадавшегося больного котика в здорового и красивого кота. Каким был Филипп на улице можно увидеть на последних фотографиях. Всё это позади, теперь осталось найти ему надежный дом. И как можно скорее, так как из-за особенности рта (у Филиппа всегда торчит язык) ему сложно есть сухой корм и кормить его надо в основном консервой. В общей кошачьей комнате это организовать достаточно сложно. Так же, когда Филипп пьёт воду, у него текут слюни :( В остальном он обычный кот и не требует какого-то специального ухода.  Филипп супер - ласковый и общительный парень. Он очень ценит тепло и хороших людей рядом. Ходит за человеком хвостиком, как собака и не слезает с рук, если у него есть такая возможность ))  Котик обработан от паразитов, чипирован, вакцинирован и кастрирован. Очень ждём предложений дома для Филиппа от ответственных людей. Филипп находится в Таллинне.",["Date","2022-02-05T20:43:25.000Z"],{"text":503,"timestamp":504,"topicId":5,"sentiment":12,"topicConfidence":13,"sentimentConfidence":505},"Hello, everyone! I need a recommendation from a vet who works on weekends, better if was in kesklinn region.  If you can also estimate the value of the consultation, that would be great. I believe my cat has urinary obstruction 😥",["Date","2022-02-05T15:55:41.000Z"],0.43,{"text":507,"timestamp":508,"topicId":5,"sentiment":12,"topicConfidence":13,"sentimentConfidence":19},"Going for a work trip or holiday? Who takes care of the dog\u002Fcat?  🤗🙋‍♀️",["Date","2022-02-05T08:14:29.000Z"],{"text":510,"timestamp":511,"topicId":5,"sentiment":6,"topicConfidence":13,"sentimentConfidence":116},"Looking for a house- and dog-sitter 21 to 25. February  Anyone willing to earn some bucks and enjoy staying in Viimsi for a few days? Dog is a StaffBull, 2nd name couch potatoe, so nothing too stressy with him. Plus: he loves humans and food.  Anyone knows someone willing to support us, please let me know. Thanks for your support.",["Date","2022-02-02T08:31:16.000Z"],{"text":513,"timestamp":514,"topicId":5,"sentiment":12,"topicConfidence":246,"sentimentConfidence":35},"Call for help :) Elery and her dog are looking for a home. She is currently not working due to pregnancy and having trouble finding an affortable place to live. Sharing it here for better reach, or in case if any of group members know something that can help her.",["Date","2022-02-01T08:42:16.000Z"],{"text":516,"timestamp":517,"topicId":5,"sentiment":12,"topicConfidence":13,"sentimentConfidence":112},"All the pet owners out there. Do you usually travel with your pets? The pandemic has brought a new fury family member to many homes. So just wondering if it has an impact on our travelling habits as well.",["Date","2022-01-30T18:45:57.000Z"],{"text":519,"timestamp":520,"topicId":5,"sentiment":12,"topicConfidence":180,"sentimentConfidence":59},"Cat lost in Kalamaja area! Friends, living there, please have a look! He might be afraid, so don't attempt to catch him, write directly to Ekaterina.Upd. Обновила фото и описание.  Друзья! Каламая! Tööstuse 47a!  Выскочила из переноски кошка. Черно белая, проблема с глазом. Естественно, боится. Вдруг кто видит, сообщите, пожалуйста 🙏",["Date","2022-01-29T10:23:14.000Z"],{"text":522,"timestamp":523,"topicId":5,"sentiment":12,"topicConfidence":149,"sentimentConfidence":71},"‼ ATTENTION ANIMAL LOVERS ‼ We are looking for VOLUNTEERS to join our team. Fill in the application today: https:\u002F\u002Fanimalrescue.ee\u002Fen\u002Fabout-us\u002Fapplication-for-joining\u002F Our mission: https:\u002F\u002Fanimalrescue.ee\u002Fen\u002Fabout-us\u002Fmission_vision\u002F",["Date","2022-01-25T19:26:13.000Z"],{"text":525,"timestamp":526,"topicId":5,"sentiment":6,"topicConfidence":13,"sentimentConfidence":124},"Hello!  I am looking for someone that’s willing to look after my dogs on a regal basis as I will be traveling for work and pleasure.  I am hoping to build a relationship with this person so that I can use the same person every time when needed and when available.  I am open to having my 2 dogs staying with the said person or this person staying in our place for the duration. (My dogs do not sleep outside they are house dogs).  If you are interested, let’s chat. Let me know what your rates would be.  Thanks.",["Date","2022-01-25T18:26:42.000Z"],{"text":528,"timestamp":529,"topicId":5,"sentiment":6,"topicConfidence":13,"sentimentConfidence":180},"Hello friends, I have decided to adopt a dog here in Tallinn, but before I do so, I want to have all my ducks in a row so to speak. If you also own a dog, could you please forward me your recommendations for: 1. A veterinarian  2. Any dog walking services  3. A great trainer 4. Pet hotel or boarding service for when on vacation… 5. Anything else that I am not thinking of? Thank you so much in advance - I really appreciate the collective wisdom in this group!",["Date","2022-01-19T13:17:22.000Z"],{"text":531,"timestamp":532,"topicId":5,"sentiment":6,"topicConfidence":13,"sentimentConfidence":43},"Hi! Please advise a zoopsychologist or a veterinarian in Tallinn who could help befriend two cats. Thank you.",["Date","2022-01-17T13:37:14.000Z"],{"text":534,"timestamp":535,"topicId":5,"sentiment":12,"topicConfidence":105,"sentimentConfidence":206},"Hello fellow expats! I have a couple of dogs and we are looking for a place to live. All our lives we've been living in a house and now we have to live in an apartment. I just wanted to ask how is to live with dogs in a building? Is it hard? I already know that is better a house for them, I just want to hear some experiences from dog owners living in apartments. Many thanks!  Btw, we have been looking for a house since June but it's harder that it seems (€1500 budget).",["Date","2022-01-14T05:55:49.000Z"],{"text":537,"timestamp":538,"topicId":5,"sentiment":12,"topicConfidence":13,"sentimentConfidence":416},"Hi!  Need some vet recommendations for my cat. He’s okay, but his deworming is due and we still haven’t taken him to a vet here.",["Date","2022-01-13T14:22:40.000Z"],{"text":540,"timestamp":541,"topicId":5,"sentiment":12,"topicConfidence":13,"sentimentConfidence":286},"Does anyone know where I can allocate my time every weekend or so for volunteering? Preferably at an animal shelter.  Picture of my cat attached for no specific purpose.",["Date","2022-01-12T11:23:23.000Z"],{"text":543,"timestamp":544,"topicId":5,"sentiment":12,"topicConfidence":13,"sentimentConfidence":116},"Are there any off leash dog parks here in Tallinn?",["Date","2022-01-07T09:37:34.000Z"],{"text":546,"timestamp":547,"topicId":5,"sentiment":12,"topicConfidence":13,"sentimentConfidence":67},"Hi does anyone know of a taxi company or pet service or similar that allows transportation of dogs in the backseat? My dog needs transportation after surgery tomorrow and needs to be able to lie down next to me.",["Date","2022-01-05T17:32:43.000Z"],{"text":549,"timestamp":550,"topicId":5,"sentiment":101,"topicConfidence":13,"sentimentConfidence":269},"Hello. A 2-year old dachshund Ukko needs someone to walk him sometimes. I have a leg problem and long walks are not possible. Kesklinn 100 metres from Stockmann and near Police park. I'll compensate.",["Date","2022-01-03T07:44:18.000Z"],{"text":552,"timestamp":553,"topicId":5,"sentiment":12,"topicConfidence":13,"sentimentConfidence":246},"Dog Sitter Can anyone recommend a good dog sitter? Looking for someone who can take my dog for a day or overnight boarding once in a while.  I have a 15 year old female, 17kg, boston terrier mix. She sleeps most of the day, requires minimal exercise.",["Date","2022-01-01T17:22:31.000Z"],{"id":5,"label":555,"color":556},"dog, cat, pet","#59a14f",[558,561,564,567,570,573,575,577,579,582],[559,560],"dog",200,[562,563],"cat",140,[565,566],"pet",120,[568,569],"animal",60,[571,572],"vet",40,[574,572],"sitter",[576,572],"shelter",[578,572],"owner",[580,581],"cargo",20,[583,581],"relocation"],"uses":{"params":["topic_id"]}}]}
