{"type":"data","nodes":[null,{"type":"data","data":[{"posts":1,"topic":302,"representativeWords":305},[2,9,15,20,25,30,35,40,44,47,51,56,61,66,70,74,77,80,85,89,92,96,100,105,109,113,116,119,123,127,131,135,139,143,146,149,153,156,160,163,167,170,173,176,179,182,185,189,192,195,198,201,205,208,211,214,217,220,223,226,229,232,235,238,242,246,249,253,256,259,262,265,269,272,276,280,283,286,289,293,296,299],{"text":3,"timestamp":4,"topicId":5,"sentiment":6,"topicConfidence":7,"sentimentConfidence":8},"Hello all, I have a question 😊. What (typical) Estonian do you like to bring as a gift or for your close ones to try? In these cases: 1) You fly with Ryanair and have only small or 10 kg cabin bag 2) You fly with Ryanair and have payed for 10-20 check-in bag 3) You travel to your home country by car (if possible 😉). Thank you very much in advance for your tips!",["Date","2022-12-30T04:10:33.000Z"],12,"Positive",0.66,0.94,{"text":10,"timestamp":11,"topicId":5,"sentiment":12,"topicConfidence":13,"sentimentConfidence":14},"?Would you like to move or send a package?  Licensed road transport in Europe. We transport packages, suitcases, furniture, bicycles, motorcycles, etc You can find the next route here: JANUARY 2023 03.01 Estonia (Tartu, Viljandi) 04.01 Estonia (Tallinn) 05.01 Estonia (Pärnu) 06.01 Estonia, Latvia, Lithuania 07.01 Poland 08.01 Germany 09.01 Belgium (Brussels, Antwerp) 10.01 France (Paris, Grenoble) 11.01 Spain (Barcelona, Valencia) 12.01 Spain (Alicante, Torrevieja) 13.01 Spain ( Malaga, Marbella) 14.01 - 15.01--- 16.01 Spain (Malaga, Alicante) 17.01 Spain (Valencia, Barcelona) 18.01 France (Montpellier, Lyon) 19.01 Belgium 20.01 Germany 21.01 Poland, Lithuania 22.01 Latvia, Estonia… More",["Date","2022-12-28T09:34:37.000Z"],"Neutral",0.86,0.85,{"text":16,"timestamp":17,"topicId":5,"sentiment":12,"topicConfidence":18,"sentimentConfidence":19},"Hello I need to buy new luggage.  Does anybody recommend a place? Preferably a physical store. Thanks!",["Date","2022-12-19T08:52:39.000Z"],0.75,0.61,{"text":21,"timestamp":22,"topicId":5,"sentiment":12,"topicConfidence":23,"sentimentConfidence":24},"Travel hand bag for adults 50 euros and a black GaGa travel bag for adults 40 euros. Contact if interested. The dimensions are about 60\u002F50.",["Date","2022-12-17T10:25:57.000Z"],0.81,0.9,{"text":26,"timestamp":27,"topicId":5,"sentiment":12,"topicConfidence":28,"sentimentConfidence":29},"Does anyone have experience ordering from Amazon.de? Does it come direct to your door? Who delivers? I’ve ordered presents that are arriving on 22nd Dec and I worried that if we get a slip from omniva in our post box to collect from the post office (like we have done with parcels from other places) then we won’t have enough time to get the parcels before Christmas (with the extra time of receiving the slip etc - hope that makes sense!). Thanks 👍",["Date","2022-12-13T22:01:38.000Z"],1,0.5,{"text":31,"timestamp":32,"topicId":5,"sentiment":6,"topicConfidence":33,"sentimentConfidence":34},"Dear Expats, Hope you are doing great. I wanna send few packages due to relocation from Tallinn to the Netherlands. I would appreciate if you know any companies which do it with an affordable price. Best regards Sema",["Date","2022-11-27T18:18:27.000Z"],0.89,0.93,{"text":36,"timestamp":37,"topicId":5,"sentiment":6,"topicConfidence":38,"sentimentConfidence":39},"Hello guys, I am moving out of Estonia very soon, and I would like to sell some of my items. Hope you will be interested 😊 Please note that I dont have a car so if you like something, kindly pick it up from my place in Mustamae. Thanks 😊 Details here: https:\u002F\u002Fdocs.google.com\u002Fdocument\u002Fd\u002F1prrQWf34dju1slxsYkbYb9riZk_DZKe61KPHxL_JseY\u002Fedit?usp=sharing UPDATE as of 1pm Nov 26: All items are taken except for the ThinkVision monitor and snow sled. Thank you to all the buyers 😊🧡",["Date","2022-11-24T19:58:04.000Z"],0.63,0.88,{"text":41,"timestamp":42,"topicId":5,"sentiment":12,"topicConfidence":43,"sentimentConfidence":24},"Is there any parcel forwarding service from Finland to Estonia?  Like Eshopwedrop.",["Date","2022-11-23T11:49:16.000Z"],0.97,{"text":45,"timestamp":46,"topicId":5,"sentiment":6,"topicConfidence":28,"sentimentConfidence":23},"Hello, I need to send a small package to India, Please suggest a fast courier service which can deliver it in a short time. Thanks in advance.",["Date","2022-11-13T18:56:10.000Z"],{"text":48,"timestamp":49,"topicId":5,"sentiment":12,"topicConfidence":19,"sentimentConfidence":50},"Does anyone have a recommendation on where the best\u002Fcheapest place is to buy a bulk pack of Vana Tallin’s as a gift? Either in Tallinn or on a ship to Helsinki. I need 6-8.",["Date","2022-11-13T09:13:54.000Z"],0.87,{"text":52,"timestamp":53,"topicId":5,"sentiment":12,"topicConfidence":54,"sentimentConfidence":55},"Looking for a Logistics enthusiast to join our European Supply Chain team located in Tallinn! #supplychain #logistics #team #fleetcomplete #fleetmanagement #IoT",["Date","2022-11-03T16:36:36.000Z"],0.71,0.51,{"text":57,"timestamp":58,"topicId":5,"sentiment":12,"topicConfidence":59,"sentimentConfidence":60},"Hello Friends 😊 I'm looking for a planters on wheels that can serve as an acoustic wall in our office. I have seen some in Tallinn ''specialized'' stores but 1000€ for a plastic box with wheels is beyond insane. I'm looking for something approx 1.5 meters tall X 1.5m to 2m long and about 30 cm wide. I need to buy like 6-7 of them. Do you have any recommendation?  Something like below 😇",["Date","2022-11-03T09:21:16.000Z"],0.7,0.48,{"text":62,"timestamp":63,"topicId":5,"sentiment":6,"topicConfidence":64,"sentimentConfidence":65},"Dear Altruists, Those of you have legalised their documents at MOFA in Tallinn, which courier services you had used? If it's through Omniva, what would be the suitable method to send such documents faster and securely? Express letter or Registered letter? I'm looking for a fast but secured service, where i can be at peace knowing that delivery has been done successfully. Your suggestions would be appreciated.",["Date","2022-10-31T20:02:16.000Z"],0.98,0.55,{"text":67,"timestamp":68,"topicId":5,"sentiment":6,"topicConfidence":19,"sentimentConfidence":69},"Hello everyone! I just realized that all my stuff wont fit in 1 luggage, so I need another one. Does anyone have a medium or large luggage that wants to give away or sell for cheap?  Preferably with wheels.  Thank you in advance! 😊",["Date","2022-10-28T16:24:36.000Z"],0.6,{"text":71,"timestamp":72,"topicId":5,"sentiment":12,"topicConfidence":28,"sentimentConfidence":73},"Hello! Does anyone have experience with delivery services from Estonia to the US? A parcel of a suitcase size or less. Any recommendations?",["Date","2022-10-18T14:52:35.000Z"],0.92,{"text":75,"timestamp":76,"topicId":5,"sentiment":12,"topicConfidence":28,"sentimentConfidence":73},"Hello people! Does anyone have experience with delivery services from Estonia to the US? A parcel of a suitcase size or less. Any recommendations?",["Date","2022-10-17T11:44:46.000Z"],{"text":78,"timestamp":79,"topicId":5,"sentiment":12,"topicConfidence":28,"sentimentConfidence":50},"Hello! I would like to ship 10 bags from Estonia to Germany. Any shipping company you’d recommend?",["Date","2022-10-04T09:14:38.000Z"],{"text":81,"timestamp":82,"topicId":5,"sentiment":83,"topicConfidence":18,"sentimentConfidence":84},"Hello, everyone, I need the experienced friends who have brought a suitcase \u002F goods here before with DHL or similar transportation companies. I would be very happy if someone has the knowledge.  My family sent me a suitcase from Turkey with DHL. There are winter items such as sweaters, coats, gloves, beanies, boots etc. inside.  A lady working at DHL Estonia told me that these items could not pass through customs duty free and that I did not meet the necessary conditions.  However; they asked me for a lot of information\u002Fdocuments such as my lease agreement, employment contract, residence permit, flight tickets, documents showing my entry into Estonia, proof that I have been outside the EU… More",["Date","2022-09-27T16:08:16.000Z"],"Negative",0.54,{"text":86,"timestamp":87,"topicId":5,"sentiment":83,"topicConfidence":28,"sentimentConfidence":88},"Guys, I bought a thing online and I want to return it. It came with the return tag already. My question is, how can I do it? I never used the post here so I’m not sure how I can do it. Omniva was who delivered, and I collected the parcel at a parcel locker, if it makes any difference. Thanks",["Date","2022-09-26T05:55:29.000Z"],0.49,{"text":90,"timestamp":91,"topicId":5,"sentiment":83,"topicConfidence":34,"sentimentConfidence":50},"what is this? I have received a text from Omniva but I need to pay 3.59€ to get the package. The storage deadline is 3\u002F10\u002F22. I am not expecting any packages. Can I just ignore it?",["Date","2022-09-26T05:18:26.000Z"],{"text":93,"timestamp":94,"topicId":5,"sentiment":12,"topicConfidence":43,"sentimentConfidence":95},"Dear Group members, what’s the procedure in Estonia to provide the recommended parcel to the receiver via post? Should the  courier of the Estonian post (Itella) collect the signature of the receiver while providing the parcel ? Thank you 🙏",["Date","2022-09-22T13:00:59.000Z"],0.77,{"text":97,"timestamp":98,"topicId":5,"sentiment":12,"topicConfidence":19,"sentimentConfidence":99},"Hi! Wonder if someone sells a cabin-size suitcase or has a spare one that would be happy to give away or sell. Or does anyone know where in Tallinn I can find one, simple and cheap? I am traveling soon to Tallinn, and want to bring back where I live few things, so I just need a one occasion suitcase.  TIA",["Date","2022-09-21T09:43:56.000Z"],0.58,{"text":101,"timestamp":102,"topicId":5,"sentiment":6,"topicConfidence":103,"sentimentConfidence":104},"Looking for a used ABS suitcase, 75cm circa height.   No broken wheels.  50 euro offer.   Cheers",["Date","2022-09-12T13:22:25.000Z"],0.64,0.62,{"text":106,"timestamp":107,"topicId":5,"sentiment":12,"topicConfidence":108,"sentimentConfidence":33},"UK expats.  Maxima carry stock of these, plus other flavours.",["Date","2022-09-08T12:16:59.000Z"],0.65,{"text":110,"timestamp":111,"topicId":5,"sentiment":12,"topicConfidence":28,"sentimentConfidence":112},"Hola, Could you recommend a reasonably priced way to re-ship from US to Estonia? I want to buy a vinyl that is distributed only in US at the moment.",["Date","2022-09-07T19:00:40.000Z"],0.8,{"text":114,"timestamp":115,"topicId":5,"sentiment":6,"topicConfidence":28,"sentimentConfidence":39},"Hey,  By any chance anyone would be traveling to Georgia (Country) from Tallinn to take one 20kg luggage along ? of course, I will pay the cost of the package.  It is medium size suitcase on wheels, so super easy to transport. I'd myself drop it in airport or any suitable location for you.  Thank you in advance.",["Date","2022-09-02T10:45:25.000Z"],{"text":117,"timestamp":118,"topicId":5,"sentiment":6,"topicConfidence":28,"sentimentConfidence":23},"It’s the little things. I still find it endearing every time that a courier 🚚 calls here just before they drive over and attempt a 📦 delivery. Especially helpful for early morning drop offs! Back in 🇬🇧, lost count of the number times that I missed a delivery after waiting in for hours only to miss them by minutes. Saves on unnecessary trips as well 😉",["Date","2022-09-02T07:41:22.000Z"],{"text":120,"timestamp":121,"topicId":5,"sentiment":83,"topicConfidence":8,"sentimentConfidence":122},"Hi all, I ordered with delivery from China, the track now show the status of delivery: \"Held by customs - customs documents missing\". What do i need to provide to them? 🙄 The item is small, for 20€ only.",["Date","2022-08-29T19:46:05.000Z"],0.59,{"text":124,"timestamp":125,"topicId":5,"sentiment":83,"topicConfidence":43,"sentimentConfidence":126},"Is anybody else experiencing problems with package shipment this week? Between my wife and I, we have 3 packages that are taking super long within Estonia",["Date","2022-08-26T11:58:35.000Z"],0.83,{"text":128,"timestamp":129,"topicId":5,"sentiment":12,"topicConfidence":130,"sentimentConfidence":126},"🆘️ Hey people, does anybody know where I could post or ask for help about lost items in Finland??",["Date","2022-08-20T15:35:25.000Z"],0.91,{"text":132,"timestamp":133,"topicId":5,"sentiment":12,"topicConfidence":28,"sentimentConfidence":134},"Good evening!  Has anyone here ever missed their IKEA home delivery? If so, how did you retrieve your order after that?  I was supposed to have some stuff delivered tomorrow between 13 and 17, and only now was made aware of an event I can’t miss. I tried calling the IKEA support number, but there was no response since it’s after six. As the order has been handed over to the courier already, I don’t think I have that many options left.",["Date","2022-08-19T15:53:14.000Z"],0.44,{"text":136,"timestamp":137,"topicId":5,"sentiment":83,"topicConfidence":28,"sentimentConfidence":138},"Hello all. I have a story + question and looking for an intelligent advice here. Recently I had to send documents to Helsinki. It was set in stone, that I have to send them, not bring in person. For some reason I decided that Omniva would be good for that. I packed documents with Omniva's tracking code and sent them from postkontor, expecting courier delivery to the place. But something went wrong and tracking told that letter was left in postimat. I knew that the organisation will never take it by themselves. So went to Omniva asking for courier delivery or returning documents back. Only latter choice was available. They did request and told me that Finland posti might answer with 2 months,… More",["Date","2022-08-18T18:11:17.000Z"],0.53,{"text":140,"timestamp":141,"topicId":5,"sentiment":6,"topicConfidence":28,"sentimentConfidence":142},"Good morning! Does anyone know of a good, tried and tested company for sea shipment? Many thanks 🙏",["Date","2022-08-18T04:08:11.000Z"],0.95,{"text":144,"timestamp":145,"topicId":5,"sentiment":12,"topicConfidence":28,"sentimentConfidence":88},"I know this is at my own risk... Hand luggage is too heavy for air Baltic, and yes I've already bought the extra hand luggage weight! Anyway, my question is for anyone that's flown Tallinn to Riga recently, do they typically weigh your hand luggage? I will then be flying Riga to Copenhagen, so again if anyone has travelled Riga to Copenhagen do they typically weigh in Riga? I will (probably\u002Fpossibly??) take the chance that they don't weigh it? At my own risk I know, and I know I could end up with hefty charges. Thanks for any input!",["Date","2022-08-12T12:55:16.000Z"],{"text":147,"timestamp":148,"topicId":5,"sentiment":6,"topicConfidence":59,"sentimentConfidence":99},"Dear all! Does anybody know an international moving manager who can provide the service of moving a truck full of my stuff from Tallinn to Prague? Thanks in advance!",["Date","2022-08-12T12:23:29.000Z"],{"text":150,"timestamp":151,"topicId":5,"sentiment":6,"topicConfidence":33,"sentimentConfidence":152},"Hi everyone, had a fabulous time in Tallinn over the last week but have left an item behind at the airport 😡 Lost and found have it but I am having trouble getting postage arrangements to the UK so wondering if any kind souls are travelling or know anyone travelling to the UK who may be willing to bring it. Or if anyone is going to\u002Fworks at the airport and could collect and send to me - all costs reimbursed of course. Many thanks!",["Date","2022-08-11T19:06:56.000Z"],0.52,{"text":154,"timestamp":155,"topicId":5,"sentiment":12,"topicConfidence":69,"sentimentConfidence":138},"Hello community :) the zipper of my backpack broke and I would like to buy an ADD-ON ZIPPER   like you can see on the photo or on the amazon link. does anybody know where I can buy an add-on zipper like that in Tallinn (or online without 10€ delivery fee...)? https:\u002F\u002Fwww.amazon.de\u002FHEMO-Rei%C3%9Fverschluss-Sofortreparatur-Ersatz-Rei%C3%9Fverschluss-Schieber-Rei%C3%9Fverschl%C3%BCsse\u002Fdp\u002FB09MFFNSBJ\u002Fref=asc_df_B09MFFNSBJ\u002F?tag=googshopde-21&linkCode=df0&hvadid=600985868285&hvpos=&hvnetw=g&hvrand=15477764122738731272&hvpone=&hvptwo=&hvqmt=&hvdev=c&hvdvcmdl=&hvlocint=&hvlocphy=1003854&hvtargid=pla-1715243460847&psc=1&th=1&psc=1 Maybe I am not the only one with this problem...",["Date","2022-08-02T12:48:35.000Z"],{"text":157,"timestamp":158,"topicId":5,"sentiment":12,"topicConfidence":28,"sentimentConfidence":159},"Hi all  I’m flying out to Tallinn from the UK on Thursday if anyone is desperate for any small treats from the uk. I have a little room in my bag.",["Date","2022-07-31T09:20:06.000Z"],0.72,{"text":161,"timestamp":162,"topicId":5,"sentiment":12,"topicConfidence":14,"sentimentConfidence":29},"Where can i find electronic luggage tags that work with Android? (i am not a techy person unfortunately, but i see what is happening at the airport of where I am traveling to and feel like i should be prepared)",["Date","2022-07-13T05:28:02.000Z"],{"text":164,"timestamp":165,"topicId":5,"sentiment":6,"topicConfidence":166,"sentimentConfidence":13},"Hi guy!  What are some fees and how much do we have to pay for them when we ship equipments from outside of the European Union (specifically from southeast Asia - but I might also ship items from elsewhere)? For example This is the tools shop in singapore https:\u002F\u002Fcrimsonhides.com Or if you have other shops with lower fee to suggest that would be great too 😊",["Date","2022-07-11T10:45:56.000Z"],0.78,{"text":168,"timestamp":169,"topicId":5,"sentiment":12,"topicConfidence":28,"sentimentConfidence":103},"Hello I'd like to send a paper document  to my country ( Egypt ). Could you please tell me which courier provide this service ?  Thank you",["Date","2022-07-09T21:11:17.000Z"],{"text":171,"timestamp":172,"topicId":5,"sentiment":83,"topicConfidence":28,"sentimentConfidence":103},"Hi, has anyone received a package from England? I'm waiting for one but the delivery has been stopped since 16\u002F06. Do I need to go to the post office? Do something?Thanks Thanks Ev.",["Date","2022-06-27T11:55:53.000Z"],{"text":174,"timestamp":175,"topicId":5,"sentiment":12,"topicConfidence":73,"sentimentConfidence":19},"Hello! I'm looking for recommendations for an international shipping company. I'm looking to move about 200 kilos of personal effects (books, photos, papers) from California to Tallinn. (I'm not looking for a full-service moving company that packs everything for you.) This will be a sea-freight, less-than-container-load shipment. If you have any relevant experience with or knowledge about such companies, let me know! Thanks!",["Date","2022-06-26T17:46:50.000Z"],{"text":177,"timestamp":178,"topicId":5,"sentiment":6,"topicConfidence":28,"sentimentConfidence":43},"Update: Sorted. I really appreciate your kind response and help. You all are really helpful. ❤️ Dear expats, I am looking for recommendations for flights to New York from Tallinn\u002FRiga\u002FHelsinki. My concern is to know specifically about airlines that offer cheap prices for students and allow more baggage.  Thank you so much for your help.  Best Wishes Rasel",["Date","2022-06-22T12:27:31.000Z"],{"text":180,"timestamp":181,"topicId":5,"sentiment":12,"topicConfidence":50,"sentimentConfidence":33},"Looking for suggestion, maybe there were some people here who might have shipped monitor\u002Ftv from Estonia to Germany before? Which post service did you use and approximate price, maybe? thanks!",["Date","2022-06-22T10:11:10.000Z"],{"text":183,"timestamp":184,"topicId":5,"sentiment":12,"topicConfidence":104,"sentimentConfidence":134},"Dearest expats, I am looking for a suitcase. I would like it to be carry-on sized, have two wheels, and have a hard shell. And I'd like it to not be incredibly ugly, if possible. I thought finding one would be easy, but after visiting several stores and finding nothing I began to look online, where I still found nothing. It seems four-wheeled suitcases have completely replaced the two-wheeled variety.  Does anyone have any advice on where I might find such a thing, preferably in Tallinn?",["Date","2022-06-21T14:20:01.000Z"],{"text":186,"timestamp":187,"topicId":5,"sentiment":12,"topicConfidence":28,"sentimentConfidence":188},"Hi. Any recommendation for a post service like DHL but cheaper?  Timeline is 1 week, need to send a document to Armenia. Thanks",["Date","2022-06-21T08:43:47.000Z"],0.74,{"text":190,"timestamp":191,"topicId":5,"sentiment":12,"topicConfidence":19,"sentimentConfidence":24},"Is there a place you guys would recommend for buying a cheap duffel bag?",["Date","2022-06-10T12:44:36.000Z"],{"text":193,"timestamp":194,"topicId":5,"sentiment":6,"topicConfidence":28,"sentimentConfidence":23},"Hey everyone!  It’s my first time reviving a parcel through SmartPost, so I was wondering, how long are the parcels usually stored there for? Thank you in advance.",["Date","2022-06-09T08:44:33.000Z"],{"text":196,"timestamp":197,"topicId":5,"sentiment":12,"topicConfidence":28,"sentimentConfidence":19},"hi quick question about logistics: is there a convenient service where a package can be delivered from helsinki to Tallinn with 1-2 days? I forgot a small box in Helsinki and would prefer it be delievered instead of me taking the ferry back and forth.",["Date","2022-06-07T16:38:31.000Z"],{"text":199,"timestamp":200,"topicId":5,"sentiment":83,"topicConfidence":104,"sentimentConfidence":38},"Hey hive mind, Do you know any building suppliers in Tallinn and around that deliver building supplies like in the pic? Not a big fan of having Sand and MOT dumped on the drive im trying to build :)",["Date","2022-05-28T08:09:45.000Z"],{"text":202,"timestamp":203,"topicId":5,"sentiment":12,"topicConfidence":28,"sentimentConfidence":204},"Hi everyone! I am looking for advise on how to ship a big box from Estonia to Poland. Which companies do deliver between EU countries? Or should I use the usual post? What is the cheapest option?  Have you had such an experience? Any advise would be welcome!",["Date","2022-05-23T15:37:01.000Z"],0.73,{"text":206,"timestamp":207,"topicId":5,"sentiment":12,"topicConfidence":104,"sentimentConfidence":50},"Hello, where can get such bags in Tallinn?",["Date","2022-05-16T07:12:00.000Z"],{"text":209,"timestamp":210,"topicId":5,"sentiment":12,"topicConfidence":108,"sentimentConfidence":138},"Hi all!  I need to get a ca 8kg box of drinks from Spain (Valencia) to Tallinn. Can you recommend a reliable service provider to organize that but DPD?  PS Not horchata, but we can cooperate ;D",["Date","2022-05-10T09:31:51.000Z"],{"text":212,"timestamp":213,"topicId":5,"sentiment":12,"topicConfidence":28,"sentimentConfidence":8},"Any recommendations to send a small parcel to arrive tomorrow in Närpes, Finland?",["Date","2022-05-10T05:50:30.000Z"],{"text":215,"timestamp":216,"topicId":5,"sentiment":12,"topicConfidence":33,"sentimentConfidence":18},"Shipping a car from the states to Tallinn... any recommendations on a company for this?  thx!",["Date","2022-05-08T14:16:30.000Z"],{"text":218,"timestamp":219,"topicId":5,"sentiment":12,"topicConfidence":59,"sentimentConfidence":19},"Hello everybody, I will be relocating to Tallinn from Malta, beginning of June. I would like to research transport companies to possibly transfer large items, such as TV. I am not looking for courier services as these will be expensive for such transfer. I'm looking for road\u002Fshipping services via containers. Does anyone know a good logically priced transport service for such a task? Thank you.",["Date","2022-05-08T12:20:07.000Z"],{"text":221,"timestamp":222,"topicId":5,"sentiment":12,"topicConfidence":18,"sentimentConfidence":88},"Hi! Does anyone know where to buy a big suitcase from that falls within a cheaper price range? We need one kinda urgently. Already looked in Prisma, Pepco and Jysk, and they don't have any currently. Thank you in advance!",["Date","2022-04-29T18:48:38.000Z"],{"text":224,"timestamp":225,"topicId":5,"sentiment":12,"topicConfidence":28,"sentimentConfidence":59},"FYI. I will be returning to Tallinn from Brussels on May 11th, 2022. I will have extra space in my luggage. In case, someone needs to bring something from Brussels, let me know.",["Date","2022-04-27T12:43:08.000Z"],{"text":227,"timestamp":228,"topicId":5,"sentiment":12,"topicConfidence":28,"sentimentConfidence":95},"Does anybody need a truck\u002Floader to transport something from Estonia to Latvia in the coming 14days? We have an incoming delivery, but could slice the price 50% if they take something back with them 🙂. Saunas, cars, Russian tanks… please DM!",["Date","2022-04-26T05:40:44.000Z"],{"text":230,"timestamp":231,"topicId":5,"sentiment":83,"topicConfidence":28,"sentimentConfidence":99},"Hello, please help! Which reliable courier service does domestic\u002Flocal shipping of say passport & documents to embassies within Tallinn or Estonia that can also do door to door? Apparently, DHL Express here only does international shipping while Omniva post office says they take 2 weeks. US Embassy requires me to use a courier service. TIA!",["Date","2022-04-25T17:30:03.000Z"],{"text":233,"timestamp":234,"topicId":5,"sentiment":6,"topicConfidence":73,"sentimentConfidence":65},"Hello! Is anyone coming back from US the next month? I need to buy an small health device from a website that doesn't ship internationally.  Dim: 12 inch X 12 inch X 1.4 inch Q: 1.5 kg : 3.4 lb I will pay for the service. Thanks a lot.",["Date","2022-04-20T10:25:33.000Z"],{"text":236,"timestamp":237,"topicId":5,"sentiment":12,"topicConfidence":28,"sentimentConfidence":33},"Hello! Does anyone know if there is any company that can help shipping something small from sweden to estonia? Or is anyone traveling and is able to help?",["Date","2022-04-20T05:52:29.000Z"],{"text":239,"timestamp":240,"topicId":5,"sentiment":12,"topicConfidence":204,"sentimentConfidence":241},"Hello! I'm looking for a shop where I can  buy a small and preferably cheap suitcase (something that fits AirBaltic's dimensions for cabin luggage).  Does anyone have any recommendations?",["Date","2022-04-12T19:23:54.000Z"],0.56,{"text":243,"timestamp":244,"topicId":5,"sentiment":6,"topicConfidence":8,"sentimentConfidence":245},"Hey everyone! Maybe it’s a long shot, but: does anyone know someone coming from New York to Estonia (or any other nearby country) anytime in the next couple of weeks?  I need to bring a package from NY and the shipment is just absurd… I’m willing to pay for the help:)",["Date","2022-04-05T18:27:02.000Z"],0.42,{"text":247,"timestamp":248,"topicId":5,"sentiment":83,"topicConfidence":28,"sentimentConfidence":13},"update: amazon always comes to the rescue. The returned package will be resent! Why does Omniva works so badly? They never deliver the package, they just leave a note without ringing or calling, and then it only stays at the post office for a week before sending it back. Does this also happen to you?",["Date","2022-04-01T09:35:36.000Z"],{"text":250,"timestamp":251,"topicId":5,"sentiment":12,"topicConfidence":252,"sentimentConfidence":152},"Hello! I have received an Omniva package slip in my mailbox, but I won't return to Estonia until after the deadline for picking it up at the post office. Can my partner go and get it? Does he need a note from me or anything like that authorizing this?",["Date","2022-03-29T20:34:12.000Z"],0.84,{"text":254,"timestamp":255,"topicId":5,"sentiment":6,"topicConfidence":18,"sentimentConfidence":138},"Hello expats,  I’d like to buy a big checked luggage ( +30 inches capacity) with reasonable price. Any one know where I can find?",["Date","2022-03-26T18:10:09.000Z"],{"text":257,"timestamp":258,"topicId":5,"sentiment":12,"topicConfidence":50,"sentimentConfidence":13},"Do you have any experience sending from Malaga to Tallinn a small package. I need to send a small \"letter\" I cm. Checked  DHL and FedEX, both  86 € for 1cm? Any other ideas?",["Date","2022-03-25T11:00:27.000Z"],{"text":260,"timestamp":261,"topicId":5,"sentiment":12,"topicConfidence":28,"sentimentConfidence":50},"Hello! I’m moving to Norway from Estonia and would like to ship some bags. Any company you’d recommend?",["Date","2022-03-21T11:11:33.000Z"],{"text":263,"timestamp":264,"topicId":5,"sentiment":12,"topicConfidence":73,"sentimentConfidence":14},"Morning all… random question, I need to buy some luggage, best place?",["Date","2022-03-15T07:11:06.000Z"],{"text":266,"timestamp":267,"topicId":5,"sentiment":12,"topicConfidence":28,"sentimentConfidence":268},"Hi, can anyone recommend a company that transfers luggage to Europe\u002F ideally the UK. Thanks)",["Date","2022-03-12T11:47:30.000Z"],0.76,{"text":270,"timestamp":271,"topicId":5,"sentiment":12,"topicConfidence":24,"sentimentConfidence":8},"Hi, I need to send a box or a hand luggage of around 15 Kg from Tallinn to Italy. Which shipping company do you recommend or have already used?",["Date","2022-03-08T07:25:29.000Z"],{"text":273,"timestamp":274,"topicId":5,"sentiment":12,"topicConfidence":275,"sentimentConfidence":14},"Hi 👋  Looking for reliable international courier that will pick up from home . Need to send some documents.  Any personal recommendation ?",["Date","2022-02-13T16:24:52.000Z"],0.99,{"text":277,"timestamp":278,"topicId":5,"sentiment":12,"topicConfidence":23,"sentimentConfidence":279},"Hello! I just arrive to Tallinn and bought some stuffs from Amazon Germany and I need to return one. What’s the best option for it?? Does DHL works here??",["Date","2022-02-09T19:47:48.000Z"],0.69,{"text":281,"timestamp":282,"topicId":5,"sentiment":12,"topicConfidence":54,"sentimentConfidence":69},"Hi folks, Is it allowed to carry a Marshall-sized speaker (acton \u002F kilburn) in your hand\u002Fcarry-on baggage? I think battery-fitted items are not allowed in the checked-in luggage. Wanted to check if a larger-sized Bluetooth speaker is allowed in hand baggage? Thanks, Jaskaran",["Date","2022-02-07T07:51:42.000Z"],{"text":284,"timestamp":285,"topicId":5,"sentiment":12,"topicConfidence":103,"sentimentConfidence":166},"Dear fellow Brits, please proceed in an orderly manner to Depo for your Quality street and Hero's selection boxes",["Date","2022-01-22T11:52:36.000Z"],{"text":287,"timestamp":288,"topicId":5,"sentiment":12,"topicConfidence":28,"sentimentConfidence":55},"Has anybody sent stuff\u002Fluggage from Chennai India to Tallinn or Tartu. What solution or service provider have you used for that? Asking for a friend who is moving here in a month. Any ideas are welcome as the airline does not offer extra luggage for this ticket and extra kg is really expensive.",["Date","2022-01-21T08:39:00.000Z"],{"text":290,"timestamp":291,"topicId":5,"sentiment":12,"topicConfidence":28,"sentimentConfidence":292},"Folks, I'm ordering something big-ish (~11 kg) from Amazon.de As someone who has never ordered anything from Amazon.de, my \"preception\" was that they only deliver to Omniva-style smart boxes, instead of delivering to individual home\u002Fwork addresses. However, this item is allowing me to just insert my office (or home) address, and doesn't ask for any smart box preferences. So my question is - will this item be delivered to my individual address or will they eventually come to a smart box and I'll have to pick it up?",["Date","2022-01-18T16:20:28.000Z"],0.57,{"text":294,"timestamp":295,"topicId":5,"sentiment":6,"topicConfidence":28,"sentimentConfidence":126},"Hello everyone, I need recommendations on International moving companies ( couriers) with reliable services and reasonable pricing. I’m moving to Estonia from South East Asia in a few weeks and want to ship a few luggage boxes. Thank you!",["Date","2022-01-11T11:31:10.000Z"],{"text":297,"timestamp":298,"topicId":5,"sentiment":6,"topicConfidence":28,"sentimentConfidence":73},"Hi everyone! 🖐️😊 Did anyone here try to send his passport through a courier and everything went fine with him? Thanks!",["Date","2022-01-09T16:46:25.000Z"],{"text":300,"timestamp":301,"topicId":5,"sentiment":6,"topicConfidence":28,"sentimentConfidence":64},"Happy New Year Everyone. Please can anyone kindly recommend an affordable cargo\u002Fdelivery company that delivers worldwide from Estonia. Thank you 🙏🏽",["Date","2022-01-01T10:00:38.000Z"],{"id":5,"label":303,"color":304},"luggage, courier, suitcase","#e15759",[306,309,312,314,316,318,320,323,325,327],[307,308],"luggage",100,[310,311],"courier",80,[313,311],"suitcase",[315,311],"package",[317,311],"parcel",[319,311],"omniva",[321,322],"delivery",60,[324,322],"ship",[326,322],"dhl",[328,322],"document"],"uses":{"params":["topic_id"]}}]}
