{"type":"data","nodes":[null,{"type":"data","data":[{"posts":1,"topic":241,"representativeWords":244},[2,9,14,18,23,26,30,35,39,43,48,54,59,63,67,71,74,77,79,83,86,89,92,96,99,102,105,108,111,114,117,121,125,128,132,136,139,142,146,150,154,159,162,165,169,172,175,178,181,184,187,190,193,197,201,204,207,210,213,216,219,223,226,229,232,235,238],{"text":3,"timestamp":4,"topicId":5,"sentiment":6,"topicConfidence":7,"sentimentConfidence":8},"How Do one make friends and escape Loneliness in Tallinn?",["Date","2022-12-27T18:04:58.000Z"],19,"Neutral",1,0.82,{"text":10,"timestamp":11,"topicId":5,"sentiment":12,"topicConfidence":7,"sentimentConfidence":13},"Hi there ! It's been 5 days since I've moved to Tallinn. I prefer to meet some people here. I'm from Tunisia and I thought it may be good to have some new friends, anyone interested?",["Date","2022-12-03T15:44:26.000Z"],"Positive",0.94,{"text":15,"timestamp":16,"topicId":5,"sentiment":12,"topicConfidence":7,"sentimentConfidence":17},"Hey guys, looking for a friend female or male it does not matter. Im a male 27 years old, living in Tallinn. I’m studying web development and I graduated with a computer science degree. I speak English fluently and would be interested in learning Estonian. It would be nice if I could meet someone genuine, educated and ambitious. I like to go on walks, play video games, watch thriller series\u002Fmovies and try new activities. If you are interested in being friends and hangout possibly let me know. Have a wonderful day!",["Date","2022-12-01T16:55:01.000Z"],0.97,{"text":19,"timestamp":20,"topicId":5,"sentiment":6,"topicConfidence":21,"sentimentConfidence":22},"Hi everyone. I want to know because I recently moved to Estonia with my Estonian girlfriend after three years of long distance.  I am trying to settle in the country and meet some new people. I live in Tallinn. I moved here from Denmark 🇩🇰   Also, does anyone know if there is anywhere to play badminton either in a club or with friends? 😁",["Date","2022-12-01T15:07:08.000Z"],0.98,0.57,{"text":24,"timestamp":25,"topicId":5,"sentiment":12,"topicConfidence":7,"sentimentConfidence":21},"Hey Expats!  Just moved from Helsinki to Tallinn as an expat, presently working with a iGaming company. As living here by just myself, it would be awesome to meet up with likeminded people and make friends. Been meeting some amazing people from jiu-jitsu club, now want to make friends whom I can join for weekend drinks. Can we arrange a get together a drink or may be two within this group? 🍻 Totally open for any suggestions!  Thanks 🫡",["Date","2022-11-29T18:09:20.000Z"],{"text":27,"timestamp":28,"topicId":5,"sentiment":12,"topicConfidence":7,"sentimentConfidence":29},"Would you like to introduce your culture to others? Or getting to know others? Next week we will organize an event introducting Erasmus+ opoortunities for all Estonian residents and sharing the diversity we have over here :) We will be happy to have more people introducing their culture through food. Event is free. Costs of products will be reimbursed. More infortmation: https:\u002F\u002Ffb.me\u002Fe\u002F2Z6vFUMTm",["Date","2022-11-16T10:31:10.000Z"],0.95,{"text":31,"timestamp":32,"topicId":5,"sentiment":12,"topicConfidence":33,"sentimentConfidence":34},"Hello! Ciao! Can you name a group of Italians in Tallinn who go out together from time to time? I have a nice friend who feels lonely here in Tallinn, even though he has a job and came to live here in the summer of 2022. Grazie mille! :)",["Date","2022-11-06T12:14:39.000Z"],0.88,0.9,{"text":36,"timestamp":37,"topicId":5,"sentiment":12,"topicConfidence":7,"sentimentConfidence":38},"Hello, my name is Bart. This summer I moved with my Estonian-Dutch family from Rotterdam to Tallinn. I work as a moderator for public discussions, conferences and group dialogues, and I design participation processes. Since a few weeks I am renting a workplace at Telliskivi Creative City. Here is a short intro video about me & my work: https:\u002F\u002Fwww.youtube.com\u002Fwatch?v=ApYQFJfm0tw – When you are around Telliskivi and want to go for a coffee, let met know. I am happy to meet new people.",["Date","2022-10-31T13:20:50.000Z"],0.92,{"text":40,"timestamp":41,"topicId":5,"sentiment":12,"topicConfidence":42,"sentimentConfidence":17},"👀 looking for a shared home  👀 Hi everyone :) I’m searching for a room in a shared flat from November\u002FDecember. I’m 26 years old, from Germany and will relocate to Tallinn to start a little adventure and work as a web developer at a local company. For the last 7 years I have solely lived in shared flats and I always enjoyed it, so I was hoping to find some friendly people here looking for a flatmate. Apart from work, I enjoy playing my guitar, reading books, cooking, or going out to exhibitions and concerts. When it comes to living together, I enjoy a friendly and open minded community and I always value spending time together like cooking together, having a drink or going out. If you know anything, please feel free to contact me via DM 🐥",["Date","2022-10-28T13:56:09.000Z"],0.85,{"text":44,"timestamp":45,"topicId":5,"sentiment":12,"topicConfidence":46,"sentimentConfidence":47},"I apologize in advance if this has been posted\u002Fmentioned before, but this morning the Skyplus morning show talked about one of Manan Anwar’s awesome posts. Specifically the one about meeting Estonian women. Congrats, Manan! You’re Eesti famous now! 👏🏼🎉🎉",["Date","2022-10-26T18:41:00.000Z"],0.89,0.99,{"text":49,"timestamp":50,"topicId":5,"sentiment":51,"topicConfidence":52,"sentimentConfidence":53},"Hello, Unusual question but people with long names, Do you suffer with Mobile id and\u002For smart id? Am talking about people with too long\u002Fmany names they can't fit them on the id",["Date","2022-10-12T07:36:43.000Z"],"Negative",0.81,0.6,{"text":55,"timestamp":56,"topicId":5,"sentiment":12,"topicConfidence":57,"sentimentConfidence":58},"Good day ! Sorry I am a new person here, few days in Tallinn. Have a question- how do you meet new people, make new friends and have a nice time similar to Netflix and chill? Is there any available events or etc ? When you alone - you need a company",["Date","2022-10-08T12:52:27.000Z"],0.8,0.79,{"text":60,"timestamp":61,"topicId":5,"sentiment":12,"topicConfidence":7,"sentimentConfidence":62},"Hey there, we think about relocating from Germany to Tallinn and would love to talk to some expats living there to get a better picture. Is there anybody here in this group open to have a little video chat? Or maybe also to meet up for a coffee in Tallinn in mid-October? (We are just planning a trip.) We are Jana, Andreas and our 1,5 years old son and our dog - so input on family life and how dog friendly the city is would be appreciated as well. Also feel free to leave a comment or DM me if that suits you better. Any tipps are welcome. Thank you!",["Date","2022-10-01T17:28:08.000Z"],0.96,{"text":64,"timestamp":65,"topicId":5,"sentiment":6,"topicConfidence":7,"sentimentConfidence":66},"We've had a work club running for 4 weeks already, aimed at people who've come to Estonia from outside the EU. If you'd still like to join and find out more about finding work in Estonia and the work culture, then join us on Tuesday, 4th October at 5pm.    Have a closer look and sign up here:",["Date","2022-09-30T07:45:21.000Z"],0.56,{"text":68,"timestamp":69,"topicId":5,"sentiment":6,"topicConfidence":7,"sentimentConfidence":70},"We've had a work club running for 4 weeks already, aimed at people who've come to Estonia from outside the EU. If you'd still like to join and find out more about finding work in Estonia and the work culture, then join us on Tuesday, 4th October at 5pm.  Have a closer look and sign up here:",["Date","2022-09-30T07:44:53.000Z"],0.55,{"text":72,"timestamp":73,"topicId":5,"sentiment":12,"topicConfidence":7,"sentimentConfidence":8},"Dear friends sorry but the event will be moved to my friend place  \"Ragu kohvik-resto\" in \"Liivalaia 27\", Tallinn, Estonia because of some technical problem. It's a nice and bigger place so I can host even more people. See you soon!",["Date","2022-09-29T08:03:33.000Z"],{"text":75,"timestamp":76,"topicId":5,"sentiment":12,"topicConfidence":7,"sentimentConfidence":46},"Hello, on Wednesday, 28th September, you have the opportunity to come to the adaptation club. It's a series of meetings which are aimed at people who've moved to Estonia from outside the EU. The aim of the meetings is to meet others in a similar situation and make connections in a relaxed atmosphere, as well as to share tips and tricks that make adapting to life in Estonia easier. The events are free of charge, refreshments will be provided. Have a look and sign up if interested:",["Date","2022-09-22T07:57:20.000Z"],{"text":75,"timestamp":78,"topicId":5,"sentiment":12,"topicConfidence":7,"sentimentConfidence":46},["Date","2022-09-22T07:56:28.000Z"],{"text":80,"timestamp":81,"topicId":5,"sentiment":12,"topicConfidence":21,"sentimentConfidence":82},"❗❗ Already next week!⁣⁣⁣ A lively discussion webinar on the ups and downs and do's and don'ts of settling in. 🇪🇪 ⁣ ⁣⁣⁣ 📆  20th of September, 4.30 pm. ⁣⁣⁣ Secure your spot.👇",["Date","2022-09-16T10:39:46.000Z"],0.72,{"text":84,"timestamp":85,"topicId":5,"sentiment":12,"topicConfidence":8,"sentimentConfidence":22},"Hi expats! I’m looking for a workplace (better if reserved) for 3\u002F4 days in the next week. Any suggestions? Thanks in advance.",["Date","2022-09-16T10:30:08.000Z"],{"text":87,"timestamp":88,"topicId":5,"sentiment":12,"topicConfidence":7,"sentimentConfidence":21},"Up for drinks with 10-14 other expats, and 1-2 Estonians? We're meeting EVERY EVENING 19.30 at some great pubs and restaurants. Don't worry about being late - we've never left before the place closes :D  Definitely let me know if you'd be interested, and I can add you to our chat as well 😉 Why do it? I've got a lot of free time as I'm writing my thesis. But also, as an Estonian I've just had a lot of fun organising the meetups and met some super interesting people from diverse backgrounds.  Having up to 14 people has enabled everyone to mingle. It also allows having daily meetups. Thus, you can always let me know when you have a free evening and would like to just hang out.  Cheers 🙂",["Date","2022-09-13T19:56:43.000Z"],{"text":90,"timestamp":91,"topicId":5,"sentiment":6,"topicConfidence":7,"sentimentConfidence":22},"Hey Expats! Do we have many Canadians in Tallinn or maybe someone from Caribbean also? My husband feels a little bit unsure if he can meet friends there.",["Date","2022-09-09T14:42:57.000Z"],{"text":93,"timestamp":94,"topicId":5,"sentiment":12,"topicConfidence":95,"sentimentConfidence":33},"BECOME AN AMBASSADOR OF TALLINN Do you love meeting new people and sharing your passion? Are you a communicative person with a love for the city of Tallinn? Our online platform that connects locals and travellers, is looking for friendly and interesting members of this group that would like to earn some extra money by showing travellers from all around the world what they love about their city. The idea is to let the travellers feel what makes your city so unique from your personal perspective. Such experiences can last 1 to 2 hours and can be on the following topics (you can choose what you are passionate about): a) History or Architecture of Tallinn b) Culture and Art of Tallinn c) The Instagrammable Spots in Tallinn d) Discover Tallinn in 60 minutes e) your own ideas 📷 🙂 It is fully flexible and you get paid for every hosted experience. For more information, please contact me directly via PM.",["Date","2022-09-09T11:08:00.000Z"],0.83,{"text":97,"timestamp":98,"topicId":5,"sentiment":12,"topicConfidence":7,"sentimentConfidence":46},"Hey everyone! I'm looking for communications \u002F social media volunteers for ONE DAY to be part of the Call & Media Centre for World Cleanup Day 2022.  The pop-up Call & Media Centre will be in Tallinn from 7am on Saturday, 17th SEPTEMBER until midnight. If you know how to use Canva or are good with social media \u002F content creation or maybe even interviewing people from around the world, please DM me as soon as possible :) Thank you!",["Date","2022-09-06T10:28:00.000Z"],{"text":100,"timestamp":101,"topicId":5,"sentiment":12,"topicConfidence":47,"sentimentConfidence":21},"Up for drinks with 8-9 other expats, and 1-2 Estonians? We're meeting Thursday (tonight) and Saturday 19.30 at Hell Hunt. Don't worry about being late. Definitely let me know if you'd be interested and I can add you to our chat as well ;) Why do it? Firstly, I've got a lot of free time as I'm writing my thesis. But also, as an Estonian I've just had a lot of fun organising five great meetups in the past couple weeks. Having up to 10 people enables everyone to mingle, so I'd like to continue with that format. It also allows having more meetups, compared to larger networking events that are great but often take place only once a month. Cheers :)",["Date","2022-08-30T13:26:12.000Z"],{"text":103,"timestamp":104,"topicId":5,"sentiment":12,"topicConfidence":7,"sentimentConfidence":46},"Hello, on Monday, 5th September, you have the opportunity to come to the adaptation club. It's a series of meetings start which are aimed at people who've moved to Estonia from outside the EU. The aim of the meetings is to meet others and make connections in a relaxed atmosphere, as well as to share tips and tricks that make adapting to life in Estonia easier. The events are free of charge, refreshments will be provided.  Have a look and sign up if interested:",["Date","2022-08-30T09:48:47.000Z"],{"text":106,"timestamp":107,"topicId":5,"sentiment":12,"topicConfidence":7,"sentimentConfidence":33},"Hello, on Monday, 5th September, you have the opportunity to come to the adaptation club. It's a series of meetings start which are aimed at people who've moved to Estonia from outside the EU. The aim of the meetings is to meet others and make connections in a relaxed atmosphere, as well as to share tips and tricks that make adapting to life in Estonia easier. The events are free of charge, refreshments will be provided. Have a look and sign up if interested:",["Date","2022-08-30T09:47:31.000Z"],{"text":109,"timestamp":110,"topicId":5,"sentiment":12,"topicConfidence":8,"sentimentConfidence":82},"Meet new people & BlaBla Language Exchange 🙂 🇱🇹 Tallinn: www.facebook.com\u002Fevents\u002F379727307528118",["Date","2022-08-15T18:28:03.000Z"],{"text":112,"timestamp":113,"topicId":5,"sentiment":12,"topicConfidence":7,"sentimentConfidence":21},"Dear friends, please join us this Saturday in Paide in this discussion in which we will talk about inclusion issues in Estonia. Besides, the weather will be lovely (we have planned the whole thing) 😀",["Date","2022-08-10T18:18:40.000Z"],{"text":115,"timestamp":116,"topicId":5,"sentiment":12,"topicConfidence":7,"sentimentConfidence":46},"Hello group! My husband is in love with Indian culture, so I am wondering if there is an active Indian community in Tallinn who organises cultural events that foreigners can visit as well?",["Date","2022-08-07T20:02:26.000Z"],{"text":118,"timestamp":119,"topicId":5,"sentiment":12,"topicConfidence":7,"sentimentConfidence":120},"Are you tired of superficial swiping? Looking for friends and connections? Do you want to build deep and meaninguful relationships instead of wasting time on cold mismatches that come too easy and disappear even easier? Say no more, bring all your singulars and register!  We will handle the rest!  #tallinn #singlesparty #speeddating  www.deepmatches.com ✌️🤍🙃",["Date","2022-08-06T05:38:26.000Z"],0.54,{"text":122,"timestamp":123,"topicId":5,"sentiment":12,"topicConfidence":124,"sentimentConfidence":13},"Hello everyone! Me and two friends of mine are spending a couple of days in Tallinn. We are friendly Italian guys just willing to meet new people 😄 Is everyone down for a hanging out or for a drink? Do you have any suggestions for cool places to go in the evening? feel free to comment on this post or to pm me!",["Date","2022-08-04T13:33:41.000Z"],0.87,{"text":126,"timestamp":127,"topicId":5,"sentiment":6,"topicConfidence":34,"sentimentConfidence":52},"Dear fellow expats, With regards to the Nordkapp expedition I was thinking Aug 8 Monday. We need also to create a separate group\u002Fchat to discuss it further and schedule a face to face meeting before the scheduled trip so we discuss everything in detail. What do u think? Feel free to comment and we need to assign a leader.  Regardless I will proceed anyway with or without company.",["Date","2022-08-02T21:25:31.000Z"],{"text":129,"timestamp":130,"topicId":5,"sentiment":6,"topicConfidence":7,"sentimentConfidence":131},"Hey guys, I was wondering if the group have any expat meetups planned or if there are some meetups taking place in Tallinn on a regular basis? I visited a couple of times and did get to know this retired American gentleman who moved there from the US last year, while he may be young at heart he is not very tech-savvy and he has not managed to understand Facebook or open an Estonian bank account for example. He also can’t get PayPal to work and is stressed out about owing me 70 euros after a night out drinking although I constantly reassure him that it is no problem and I don’t worry at all but you know, that generation…. I think it would help him a lot to get to know other expats in the kind of ”where are y’all from what can we help each other with?” setting that I imagine such meetups being. So, any tips?  Facebook links are good, I will just convert them to the necessary format of venue name, street address, date and time and then text them to him like you do with old people 😁",["Date","2022-07-26T07:34:16.000Z"],0.48,{"text":133,"timestamp":134,"topicId":5,"sentiment":12,"topicConfidence":62,"sentimentConfidence":135},"Don't forget your umbrella and your sunscreen :D 😎 Feat The fellowship of Tallinn - Memes, chatting, social events",["Date","2022-07-07T11:29:55.000Z"],0.76,{"text":137,"timestamp":138,"topicId":5,"sentiment":12,"topicConfidence":52,"sentimentConfidence":38},"Hi everyone, Does anybody know how neighbors typically communicate with each other in Tallinn? Do they use any apps\u002FFacebook\u002Fmessengers to discuss different questions, plan activities or just chat? Thank you very much in advance for all the responses! 🙂",["Date","2022-07-04T21:36:02.000Z"],{"text":140,"timestamp":141,"topicId":5,"sentiment":12,"topicConfidence":7,"sentimentConfidence":62},"Hello everyone! There is a free event coming up on Wednesday that I'm organising, aimed at people who've moved to Estonia from outside the EU and are looking for activities to help them adapt to the life here and meet others. On Wednesday, the 29th, a seminar for parents (you can join for both of the topics or just one, based on your interest). You are very welcome! https:\u002F\u002Fwww.facebook.com\u002Fevents\u002F558688179079055",["Date","2022-06-27T14:02:37.000Z"],{"text":143,"timestamp":144,"topicId":5,"sentiment":12,"topicConfidence":7,"sentimentConfidence":145},"Hello guys 👋🏻 me and my bf almost 2,5 month here in Tallinn. We like it a lot but we faced a little issue, we don’t have any friends here. The problem is that we both a bit introverted 😅 we want to make new friendships but both of us have no idea how to do it 😅 any ideas?❤️",["Date","2022-06-26T22:39:48.000Z"],0.42,{"text":147,"timestamp":148,"topicId":5,"sentiment":12,"topicConfidence":7,"sentimentConfidence":149},"👉🏽👉🏽 Help 😃 Any Jaanipäev events in or near Tallinn (with expats) to go to Friday?? 🙏🏽 Relocated back to Tallinn recently and a bit out of touch 😏 Can join a group and contribute jokes, conversation and good energy 😋 Reply or DM palun",["Date","2022-06-23T16:22:17.000Z"],0.68,{"text":151,"timestamp":152,"topicId":5,"sentiment":12,"topicConfidence":47,"sentimentConfidence":153},"Hello everyone! There are two free events coming up next week that I'm organising, aimed at people who've moved to Estonia from outside the EU and are looking for activities to help them adapt to the life here and meet others.  On Wednesday, the 29th, a seminar for parents (you can join for both of the topics or just one, based on your interest)  https:\u002F\u002Fwww.facebook.com\u002Fevents\u002F558688179079055 On Saturday, 2nd July, a crafts workshop and a visit to the Botanic Gardens for the whole family https:\u002F\u002Fwww.facebook.com\u002Fevents\u002F704882007245994\u002F You are welcome to join!",["Date","2022-06-22T10:42:16.000Z"],0.91,{"text":155,"timestamp":156,"topicId":5,"sentiment":6,"topicConfidence":157,"sentimentConfidence":158},"✅✅ Hello People , wanna meet in reality ? Would you like to spend time together and make a new friends? Let’s join our group 🌀 June 24th - restaurant meeting 🍽 June 26th - 1 day trip to Helsinki 🇫🇮 https:\u002F\u002Fwww.facebook.com\u002Fgroups\u002F421853446424862\u002F?ref=share_group_link",["Date","2022-06-18T21:20:44.000Z"],0.84,0.5,{"text":160,"timestamp":161,"topicId":5,"sentiment":12,"topicConfidence":7,"sentimentConfidence":34},"Hi Folks.  Some of you may be aware and some not, but there is an event for personal growth and wellbeing occurring for 3 weeks in Tallinn, and many people are arriving to live in Tallinn between 4th and 25th July. And i know there are many people looking for accommodation during this time.  So if you know of anywhere of have a space or 2 yourself and you would like to rent the room\u002Fspace out, people will be happy to pay of course, so feel free to send me a message and i could connect you. They will be nice friendly people.  All the best.  Steve 🙏",["Date","2022-06-18T19:42:46.000Z"],{"text":163,"timestamp":164,"topicId":5,"sentiment":12,"topicConfidence":7,"sentimentConfidence":17},"Hi everyone, I have recently moved to Tallinn, I have a background in psychology.  I was just wondering if there are any community events happening anytime soon, where you can go and connect with others. I am very new to the city, and I'd be super happy to connect with like-minded individuals. 😊 Thanks!",["Date","2022-06-14T20:44:12.000Z"],{"text":166,"timestamp":167,"topicId":5,"sentiment":12,"topicConfidence":33,"sentimentConfidence":168},"Hello Tallinn, I am writing to invite you all to a meet-up event where everyone is welcomed to share their creative ideas to help our guests from Ukraine. We will have mentors from different fields of life who will assist us in shaping our ideas. Also, there is a lunch planned to keep the fluids running. 🙂  Venue: Palo Alto, Teliskivi 57 Day: Tomorrow, Saturday 11\u002F06 Time: 1030 - 1600 (but you can quietly sneak out if you have something pre planned) You're welcomed to drop a reply or DM if you have any question! Dropping some snaps from today's team meet-up",["Date","2022-06-10T14:27:25.000Z"],0.93,{"text":170,"timestamp":171,"topicId":5,"sentiment":12,"topicConfidence":7,"sentimentConfidence":33},"Hello 👋  I just created a newly group in Tallinn for social activities in reality. No matter how long you live here feel free to join the group and let’s meet in real. Let’s make a new friends 🙂 https:\u002F\u002Ffacebook.com\u002Fgroups\u002F421853446424862\u002F",["Date","2022-06-02T21:41:58.000Z"],{"text":173,"timestamp":174,"topicId":5,"sentiment":12,"topicConfidence":153,"sentimentConfidence":57},"For real, Rimi is my second home now 😅 Feat The fellowship of Tallinn - Memes, chatting, social events",["Date","2022-05-30T09:22:46.000Z"],{"text":176,"timestamp":177,"topicId":5,"sentiment":12,"topicConfidence":7,"sentimentConfidence":13},"Yesterday we started a series of work club events, aimed at people from outside EU who want to know more about working in Estonia. If you're interested in joining, the second meeting is today at 5pm and you are very welcome to join and meet others :) https:\u002F\u002Fwww.facebook.com\u002Fevents\u002F5284475754946649\u002F",["Date","2022-05-26T10:56:46.000Z"],{"text":179,"timestamp":180,"topicId":5,"sentiment":12,"topicConfidence":62,"sentimentConfidence":21},"There is going to be a Developers meetup next Thursday at pipedrive Pipedrive :) If you work in IT then this might be interesting to you :)  Only less than 20 spots left!",["Date","2022-05-20T14:23:38.000Z"],{"text":182,"timestamp":183,"topicId":5,"sentiment":12,"topicConfidence":7,"sentimentConfidence":34},"Hello everyone, next week there's a series of meetings starting on sharing tips and gaining a better understanding of working in Estonia. The events are aimed at people who've come to Estonia from outside the EU and have never worked here or are looking to change jobs.  You don't need to participate on all days but the more the better :)  Have a look and please sign up :)  https:\u002F\u002Fwww.facebook.com\u002Fevents\u002F5284475754946649\u002F5284491444945080\u002F",["Date","2022-05-20T05:33:45.000Z"],{"text":185,"timestamp":186,"topicId":5,"sentiment":12,"topicConfidence":7,"sentimentConfidence":34},"Hello everyone, next week there's a series of meetings starting on sharing tips and gaining a better understanding of working in Estonia. The events are aimed at people who've come to Estonia from outside the EU and have never worked here or are looking to change jobs. You don't need to participate on all days but the more the better :) Have a look and please sign up :) https:\u002F\u002Fwww.facebook.com\u002Fevents\u002F5284475754946649\u002F5284491444945080\u002F",["Date","2022-05-20T05:33:11.000Z"],{"text":188,"timestamp":189,"topicId":5,"sentiment":12,"topicConfidence":7,"sentimentConfidence":46},"Hello everyone, sharing an event this weekend - a family picnic aimed at people from outside of EU who have moved to Estonia. Please sign up if interested. Bring your family and friends :) https:\u002F\u002Fwww.facebook.com\u002Fevents\u002F1578159429234020",["Date","2022-05-12T07:04:53.000Z"],{"text":191,"timestamp":192,"topicId":5,"sentiment":12,"topicConfidence":7,"sentimentConfidence":34},"Hi there :D  I've just created a group for people living in Tallinn and fans of pop culture (LOTR, Star Wars, back to the future, etc...), music, and gaming. The goal is to share some memes about our life in Tallinn, talk and meet new people which have the same interests, maybe organize some chill events :D   For example, you're looking for other players of your multiplayer game? You can ask it here!  You wanna go for a walk with other geeks? Yep, the place to be.  You wanna share that awesome Anakin meme? Let's go!   Here is the link of the group :D The fellowship of Tallinn - Memes, chatting, social events",["Date","2022-05-11T13:06:11.000Z"],{"text":194,"timestamp":195,"topicId":5,"sentiment":12,"topicConfidence":62,"sentimentConfidence":196},"Dear community, I have a few spots left for the workshop I am organizing next Wednesday in Telliskivi! 👉If you've been thinking about starting your own business but you've been postponing this decision for months and months 👉If you want to become an entrepreneur but there are many fears in you that stop you from making the first step 👉If you feel you want to work for yourself and create a business that you are passionate about This workshop will be for you!   I will be sharing my experience of working with people who have decided to become entrepreneurs and succeeded.  I will not talk about the obvious things you can google. I will be talking about the crucial aspects of starting an entrepreneurial journey. You are welcome to join by registering for my event 📩",["Date","2022-05-03T06:32:05.000Z"],0.64,{"text":198,"timestamp":199,"topicId":5,"sentiment":12,"topicConfidence":13,"sentimentConfidence":200},"Looking for a good opportunity to get a bit of culture, in English, in Tallinn? My friend is organizing this live talk show event Thursday night. Check out the description here! avhttps:\u002F\u002Ffacebook.com\u002Fevents\u002Fs\u002Flooming-ja-ranne-live-talk-sho\u002F403361794597400\u002F",["Date","2022-04-27T18:30:21.000Z"],0.65,{"text":202,"timestamp":203,"topicId":5,"sentiment":12,"topicConfidence":7,"sentimentConfidence":153},"hey everyone!! my name is Agniia, i created a chat for international students in Tallinn to find friends, party and etc. 🙂 so feel free to join this chat but please be nice and don't spam there!!",["Date","2022-04-23T19:11:20.000Z"],{"text":205,"timestamp":206,"topicId":5,"sentiment":12,"topicConfidence":7,"sentimentConfidence":62},"Good opportunity to mingle on a deeper level. Offering some breathwork journeys in small groups for foreigners and expats (non estonian speaking crowd) here in Tallinn. All the info in the events post. If it resonates, hit me up! 😉",["Date","2022-04-15T09:38:03.000Z"],{"text":208,"timestamp":209,"topicId":5,"sentiment":12,"topicConfidence":7,"sentimentConfidence":62},"Good opportunity to mingle on a deeper level. Offering some breathwork journeys in small groups for foreigners and expats (non estonian speaking crowd) here in Tallinn. All the info in the events post.  If it resonates, hit me up! ;)",["Date","2022-04-15T09:34:07.000Z"],{"text":211,"timestamp":212,"topicId":5,"sentiment":12,"topicConfidence":7,"sentimentConfidence":13},"Hi group. I just moved to Tallinn and it would be nice to meet locals or other fellow expats. I'm a scientist \u002F entrepreneur, always up for a drink or something cultural. I speak Spanish, English and French, so hmu if you'd like to hangout! 🍻",["Date","2022-04-10T15:57:27.000Z"],{"text":214,"timestamp":215,"topicId":5,"sentiment":12,"topicConfidence":7,"sentimentConfidence":131},"Hello, guys! Could you please let me know if there is a Greek community in Tallinn or speaking clubs where I can meet Greeks? I studied and lived there, and I miss Greece a lot. Any help will be highly appreciated!",["Date","2022-03-10T11:41:15.000Z"],{"text":217,"timestamp":218,"topicId":5,"sentiment":12,"topicConfidence":95,"sentimentConfidence":21},"Hello everyone!  I am new in Tallinn, just came last Wednesday. I am looking to meet new people and make friends here. I would like to explore Tallinn in weekends. If anyone would like to hang out or visit tourist attractions then feel free to send me a message. 🙂  Have a nice weekend!  head ööd!🇪🇪☺️",["Date","2022-03-04T20:34:26.000Z"],{"text":220,"timestamp":221,"topicId":5,"sentiment":12,"topicConfidence":7,"sentimentConfidence":222},"Hello everyone  I am a French student and with some friends we are going to Tallinn from 19 to 22 February so we are looking to hang out with Estonian student so I hope you will respond to my message  Thanks you  Bye",["Date","2022-02-18T13:26:22.000Z"],0.77,{"text":224,"timestamp":225,"topicId":5,"sentiment":12,"topicConfidence":17,"sentimentConfidence":168},"Hello good people, first Happy friendship day to all of you, stay healthy (physically and mentally) I have a question to the Apple users: has anyone of you ever changed the antenna in your iPhone? In Tallinn? Where? How much €?? TIA",["Date","2022-02-14T12:29:48.000Z"],{"text":227,"timestamp":228,"topicId":5,"sentiment":6,"topicConfidence":7,"sentimentConfidence":158},"Hey expats, I am moving to Tallinn today, and I need some help... making new friends. I lived in 7 countries so far, and had no problems with it, but now the thing is I have my own gig and don't have a specific program, studies or company to guide me through socialization. Has any of you been in a similar situation? If you have any ideas, want to meet up for coffee with other expats, please let me know! Truly feels a bit awkward asking, but I'm gonna miss some social interactions during winter months :)",["Date","2022-01-28T12:52:17.000Z"],{"text":230,"timestamp":231,"topicId":5,"sentiment":12,"topicConfidence":7,"sentimentConfidence":21},"Hello guys! My name is Kiriakos, and i am from Greece. I just moved to Tallinn on Thursday. I already met few nice people but if anyone wants a coffee etc is more than welcome. Always good to know cool persons. Also i am searching for any basketball team. Football i found on Esn Tallinn. Thank you and see you around 😎",["Date","2022-01-16T18:30:15.000Z"],{"text":233,"timestamp":234,"topicId":5,"sentiment":12,"topicConfidence":7,"sentimentConfidence":95},"*Recruiting summer friends* 😂  Ok- now that I caught your attention, the above statement is kinda true haha 🙂 I have a  group of friends in Tallinn but we’d like to meet more people and sometimes is hard (I mean the past 2 years have been very crazy due to our current global situation). Anyway, if you’d like to meet a cool bunch (mostly foreigners but some Estonians as well) send me a dm 🙂 we usually organize dinners together, on the summer go to Noblesseneri, events, watch the sunset, make bbq etc.  Our age group is mid twenties to mid-late thirties. Many bonus points if you are a girl. 🤗 You may ask: “Why summer if we are still on winter?”  Well… you can’t make friends overnight (I mean sometimes we do) haha but- it will give us room to create enough bonding and if it can survive until the summer, then the mission is accomplished. 😂",["Date","2022-01-13T00:25:12.000Z"],{"text":236,"timestamp":237,"topicId":5,"sentiment":12,"topicConfidence":7,"sentimentConfidence":17},"Good morning! ❄️☀️ Hope you are enjoying the crisp weather (if not, well, the summer comes every year, at least so far!).  If you want to meet new people, both Estonians and other nationalities, Estonian Refugee Council is looking for volunteers.  The activities vary a lot (from being a language buddy to help organize cultural events or if you have any specific skill you think might be useful - let us know!).  Last autumn we made the video below (first test - if you like it, contact us! :D). More information: https:\u002F\u002Fwww.pagulasabi.ee\u002Fen\u002Fvolunteer-us or anu@pagulasabi.ee Looking forward to meet you! :)",["Date","2022-01-12T07:17:29.000Z"],{"text":239,"timestamp":240,"topicId":5,"sentiment":12,"topicConfidence":17,"sentimentConfidence":13},"Greek Cultural Evening 🇬🇷🇬🇷🇬🇷 ✨Save the date: 13.01 at 17:00–19:00 and join us to explore Greek ancient culture with its broadest and long-lasting impact on western civilization, including architecture, the arts, government, language, literature, philosophy, and much more 🥰🌟 ✨Most importantly, our Greek guest speaker, amazing Katerina, will provide you with first-hand information 🥳🎉 📍 The event takes place in Kesklinna Noortekeskus, Raua 23. All youngsters are warmly invited 🥰🥰 ✨Registration link: https:\u002F\u002Fforms.gle\u002FsGvEdMWnf8b55akT8 https:\u002F\u002Ffb.me\u002Fe\u002F2M7amHodn",["Date","2022-01-10T12:15:03.000Z"],{"id":5,"label":242,"color":243},"meet, meeting, aimed","#bab0ab",[245,248,251,253,255,257,260,262,264,266],[246,247],"meet",80,[249,250],"meeting",60,[252,250],"aimed",[254,250],"moved",[256,250],"event",[258,259],"people",40,[261,259],"meetups",[263,259],"series",[265,259],"friend",[267,259],"sign"],"uses":{"params":["topic_id"]}}]}
