{"type":"data","nodes":[null,{"type":"data","data":[{"posts":1,"topic":372,"representativeWords":375},[2,9,14,19,24,29,34,37,42,47,53,58,62,67,72,76,79,83,88,93,96,100,104,108,113,117,122,126,130,134,137,141,146,151,154,157,162,165,169,172,176,180,183,187,190,193,196,200,203,207,211,215,218,221,224,227,231,235,239,242,245,249,252,255,259,262,266,270,273,277,281,284,287,290,294,297,300,304,307,310,314,317,321,324,327,330,333,336,339,343,346,349,352,355,358,361,364,368],{"text":3,"timestamp":4,"topicId":5,"sentiment":6,"topicConfidence":7,"sentimentConfidence":8},"Hi, Does ending contract with § 89 (1) TLS (lay-off) gives employee the right to claim unemployment insurance? Thank you.",["Date","2022-12-29T17:58:25.000Z"],9,"Neutral",0.22,0.8,{"text":10,"timestamp":11,"topicId":5,"sentiment":6,"topicConfidence":12,"sentimentConfidence":13},"Hello, Looking for an accountant\u002Ftax consultant, any recommendations? Thanks!",["Date","2022-12-27T10:20:36.000Z"],0.5,0.61,{"text":15,"timestamp":16,"topicId":5,"sentiment":6,"topicConfidence":17,"sentimentConfidence":18},"Hi, Can anyone recommend a tax consultant (private matter, not corporate) who can work across EU legislations (Latvia \u002F Estonia) - e.g. help figure out double taxation issues, tax residency and such?",["Date","2022-12-26T21:56:40.000Z"],0.63,0.85,{"text":20,"timestamp":21,"topicId":5,"sentiment":6,"topicConfidence":22,"sentimentConfidence":23},"Hello every one and merry christmas🥳🥳🥳. I am wondering whether or not it is possible to work in another European country if an expat own a company in Estonia and then pay the tax here? I am a non-EU residence but has TRP in Estonia and own a health service company.",["Date","2022-12-26T14:44:08.000Z"],0.41,0.59,{"text":25,"timestamp":26,"topicId":5,"sentiment":6,"topicConfidence":27,"sentimentConfidence":28},"Hi, ECA § 100 part 1 and 2 prescribes that upon cancellation of an employment contract due to lay-off, an employer shall pay an employee compensation to the extent of one month’s average wages of the employee and an employee has the right to receive a benefit upon lay-offs under the conditions and pursuant to the procedure prescribed in the Unemployment Insurance Act. ECA § 97 part 2 prescribes that an employer shall give an employee advance notice of extraordinary cancellation if the employee’s employment relationship with the employer has lasted: 1) less than one year of employment – no less than 15 calendar days; 2) one to five years of employment – no less than 30 calendar days; 3) five to ten years of employment – no less than 60 calendar days; 4) ten and more years of employment – no less than 90 calendar days. Does giving notice cancel the one month compensation? or vice-versa Or laying-off leads to notice time + compensation? duration of employment 1.5 years. Thank you.",["Date","2022-12-19T11:24:09.000Z"],0.24,0.76,{"text":30,"timestamp":31,"topicId":5,"sentiment":6,"topicConfidence":32,"sentimentConfidence":33},"Finally, I will utilize my Estonian company. Question about tax: If I pay my salary to my Dutch bank account, how much % of tax do I need to pay to Estonia? I am aware that in the Netherlands I have to pay tax as well. Thanks!",["Date","2022-12-15T13:33:41.000Z"],0.57,0.58,{"text":35,"timestamp":36,"topicId":5,"sentiment":6,"topicConfidence":32,"sentimentConfidence":32},"Good day all, I have a question many may be wondering about. I was employed in Estonia for 3 months and 10 days. Can I ask tax and unemployment deductions rebate because of that? If I could, who should I reach for that? TIA and happy holidays.",["Date","2022-12-03T18:36:43.000Z"],{"text":38,"timestamp":39,"topicId":5,"sentiment":6,"topicConfidence":40,"sentimentConfidence":41},"Hi guys. I wanna order something from iherb. It will cost me ca. 40 euro. Is there any extra taxes in Estonia for that?",["Date","2022-11-28T20:06:18.000Z"],0.21,0.68,{"text":43,"timestamp":44,"topicId":5,"sentiment":6,"topicConfidence":45,"sentimentConfidence":46},"Tere! Hi there! I recently moved to Tallinn and thought about moving my freelance business status here too. Right now, I'm working via a freelance contract with my main client (remote employer basically, the Netherlands) and sometimes doing side work on the freelance markets.  I have the status of an Individual Entrepreneur in Armenia that has 0% tax (special condition for IT business) and something about 200 EUR per year of social fees. However, Armenian banking is not perfect, also the possibilities for using online payments in Armenia are kinda limited.  I was thinking of opening a business status here in Estonia, I checked FIE and OU statuses but as I see the tax rates are extremely… More",["Date","2022-11-21T13:30:49.000Z"],0.42,0.52,{"text":48,"timestamp":49,"topicId":5,"sentiment":50,"topicConfidence":51,"sentimentConfidence":52},"Hello everyone, I’m looking for an accountant who knows the business of mobile apps and can assist to fill the form W-8BEN-E. Thanks !",["Date","2022-11-21T10:40:45.000Z"],"Positive",0.43,0.69,{"text":54,"timestamp":55,"topicId":5,"sentiment":50,"topicConfidence":56,"sentimentConfidence":57},"Hi I’m looking for an accountant for a business based in Vilnius? Any leads?  Thank you.",["Date","2022-11-21T09:41:35.000Z"],0.26,0.51,{"text":59,"timestamp":60,"topicId":5,"sentiment":50,"topicConfidence":12,"sentimentConfidence":61},"It’s not that easy to manage accounting. But if you divide the task into pieces and set up a daily routine, it would be much easier! Explore these tips to keep your accounting books in a good shape https:\u002F\u002Fenty.io\u002Faccounting?utm_source=facebook&utm_medium=smm&utm_campaign=community",["Date","2022-11-15T06:43:56.000Z"],0.7,{"text":63,"timestamp":64,"topicId":5,"sentiment":6,"topicConfidence":65,"sentimentConfidence":66},"Hi there, I am looking for an accountant, any leads?",["Date","2022-11-08T22:12:11.000Z"],0.49,0.88,{"text":68,"timestamp":69,"topicId":5,"sentiment":50,"topicConfidence":70,"sentimentConfidence":71},"Hi there, happy Thursday!!🥳 I’m sure this has been asked before and I have searched for the threads BUT I have to ask- I’m looking for someone to give me some advice or clear guidance on opening a company in Estonia. I know it’s simple and easy and takes 5 minutes BUT which business entity is the best option? Would I need to hire an accountant and what are the tax implications?  If anyone can help, I would greatly appreciate it😊",["Date","2022-11-03T10:12:55.000Z"],1,0.83,{"text":73,"timestamp":74,"topicId":5,"sentiment":6,"topicConfidence":61,"sentimentConfidence":75},"Hi! As there have been a lot of issues and myths about establishing and running a company here in Estonia, and about taxation as well (especially among couriers and platform employees). Therefore we have prepared a one-day course so that important questions could get clearer as we guide you in the establishment process and taxation. Register www.tarkeesti.com. The lecturer is a practicing lawyer and University's tax and business lecturer. See you soon!",["Date","2022-11-01T06:59:23.000Z"],0.54,{"text":77,"timestamp":78,"topicId":5,"sentiment":50,"topicConfidence":65,"sentimentConfidence":33},"Hello! Any recommendations for an accountant to help to set up an OÜ? I know how to Google but would prefer a personal recommendation. Thanks in advance!",["Date","2022-10-31T15:34:45.000Z"],{"text":80,"timestamp":81,"topicId":5,"sentiment":50,"topicConfidence":70,"sentimentConfidence":82},"Hey everyone, I am planning to permanently move to Tallinn next year and in order to sort out my business needs I am looking for a good international tax advisor. Maybe even one that knows Luxembourg and Estonia tax \u002F dual tax agreement. If anyone has any recommendations, happy to her as so far google has brought rather questionable companies to my eye. Cheers, John",["Date","2022-10-23T17:57:48.000Z"],0.64,{"text":84,"timestamp":85,"topicId":5,"sentiment":50,"topicConfidence":86,"sentimentConfidence":87},"Hey fellow expats,  has anyone been in a situation of living in Estonia with a TRP for employment, working for a foreign (non-Estonian) company?  Wondering whether this is legally possible, given the company could hire me through a 3rd party entity that is registered in Eesti.  Appreciate your help!",["Date","2022-10-23T11:06:34.000Z"],0.2,0.73,{"text":89,"timestamp":90,"topicId":5,"sentiment":50,"topicConfidence":91,"sentimentConfidence":92},"#USA #EU #VAT #salestax  Hi, I founded a tech company in Estonia. We operating international website. Users can buy contents (pictures & videos). If i have company with residence in Estonia (EU) but customer from USA and make a (B2C) purchase on my website, do i have to pay VAT\u002FSales tax to USA? (Based on residence state of customer) Thanks in advance for your assistance!",["Date","2022-10-21T19:30:55.000Z"],0.28,0.65,{"text":94,"timestamp":95,"topicId":5,"sentiment":6,"topicConfidence":22,"sentimentConfidence":92},"Yesterday the Tax Foundation published the new AD 2022 International Tax Competitiveness Index. \"The International Tax Competitiveness Index (ITCI) seeks to measure the extent to which a country’s tax system adheres to two important aspects of tax policy: competitiveness and neutrality.\" - Top 4 countries with the most competitive tax system remain unchanged: Estonia, Latvia, New Zealand, Switzerland - in the Top10 - 30% are the Baltic countries - On the bottom: Portugal, France, and Italy.",["Date","2022-10-19T08:21:22.000Z"],{"text":97,"timestamp":98,"topicId":5,"sentiment":6,"topicConfidence":99,"sentimentConfidence":13},"Sometimes there is a risk that your income may be taxed twice. Let’s take a look at the issue of double taxation on the example of Estonia and figure out how one can avoid it.",["Date","2022-10-14T07:07:57.000Z"],0.47,{"text":101,"timestamp":102,"topicId":5,"sentiment":6,"topicConfidence":70,"sentimentConfidence":103},"Hi guys, I'm looking to move and register my company in Estonia as from the new year TAX income and such will again increase in Poland. I'm looking for someone who can advise me on different TAX laws for small online businesses. Can anyone recommend some accountant that can help with (paid) consultancy and perhaps future accounting?",["Date","2022-10-12T12:47:25.000Z"],0.84,{"text":105,"timestamp":106,"topicId":5,"sentiment":6,"topicConfidence":107,"sentimentConfidence":87},"Hi!  Can anyone recommend a good, professional accountant in Tallinn?",["Date","2022-10-10T20:14:52.000Z"],0.36,{"text":109,"timestamp":110,"topicId":5,"sentiment":6,"topicConfidence":111,"sentimentConfidence":112},"Hi, we are planning to move to Tallinn from uk in Jan, my husband is uk citizen works for international company, does anyone knows ( or been in the same situation) would he be able to pay tax as Estonian\u002F eu  resident at 20% rate once we move? , his employer willing to comply with taxation the country he reside. We are trying to figure it’s out and im not sure if it will apply to him as he is no longer EU citizen . Tia",["Date","2022-10-07T20:39:27.000Z"],0.38,0.72,{"text":114,"timestamp":115,"topicId":5,"sentiment":50,"topicConfidence":116,"sentimentConfidence":18},"Hi all, Is there anyone who can recommend an English-speaking accountant for establishing an OÜ (private limited company) and potentially regular accounting services thereafter? Personal experience would be greatly appreciated (good and timely communication, ability to guide on details, etc.) Thanks in advance!",["Date","2022-10-07T17:02:45.000Z"],0.37,{"text":118,"timestamp":119,"topicId":5,"sentiment":50,"topicConfidence":120,"sentimentConfidence":121},"Hi guys, does anyone have recommendations for tax professionals who can advise on the best Estonian tax\u002Fbusiness setup for an American self-employed person with foreign-sourced income? Bonus points if they can advise on visas too. Thanks :)",["Date","2022-10-04T10:56:13.000Z"],0.98,0.71,{"text":123,"timestamp":124,"topicId":5,"sentiment":6,"topicConfidence":125,"sentimentConfidence":23},"Hey guys, can you please suggest an accountant who can give online consultation for an Estonian start-up company to fill monthly expenses? Thanks!",["Date","2022-09-30T09:50:34.000Z"],0.3,{"text":127,"timestamp":128,"topicId":5,"sentiment":6,"topicConfidence":129,"sentimentConfidence":66},"What is a considered a good monthly gross salary in Estonia atm?",["Date","2022-09-29T17:47:39.000Z"],0.39,{"text":131,"timestamp":132,"topicId":5,"sentiment":6,"topicConfidence":107,"sentimentConfidence":133},"Hello, friends.  Does anyone have an experience working under a freelance contract with a company outside Estonia (within EU) ?  How does the taxes work? Does this affect in any way the criteria of working in Estonia for 5 years to get the permanent residency (or is it just based on paying taxes for Estonia for 5 years) ?  Thank you",["Date","2022-09-28T09:08:11.000Z"],0.81,{"text":135,"timestamp":136,"topicId":5,"sentiment":6,"topicConfidence":66,"sentimentConfidence":57},"Hi guys, I have a business-related question; if someone having OÜ registered in Estonia and working from home under this business. I believe he is allowed to add a proportion of the rent [50%, for example] within the scope of the business expenses, correct? and if so, how it should be taxed, and what are the ramifications on the company itself and the employee in terms of the taxes\u002Fcosts etc.? if someone can help, I would really appreciate it :)",["Date","2022-09-24T22:01:07.000Z"],{"text":138,"timestamp":139,"topicId":5,"sentiment":6,"topicConfidence":99,"sentimentConfidence":140},"I had an important question regarding health insurance here in Estonia. Does being the manager of my Estonian company automatically entitle me to it or do I first have to pay myself a salary and pay certain taxes to have access to it ? Thank you for your clarifications 😊",["Date","2022-09-20T13:09:56.000Z"],0.62,{"text":142,"timestamp":143,"topicId":5,"sentiment":144,"topicConfidence":87,"sentimentConfidence":145},"Hello! I have a question about taxes. As I see a FIE must pay 20% tax, but have a FIE also pay 33% social tax? I was studying Estonian taxes quite a lot, but social taxes confused me...",["Date","2022-09-14T21:38:14.000Z"],"Negative",0.66,{"text":147,"timestamp":148,"topicId":5,"sentiment":50,"topicConfidence":149,"sentimentConfidence":150},"EDIT: problem solved and I highly recommend Vlad Postnikov! Hi everyone, I'm urgently looking for an accountant who can do a Majandusaasta aruanne \u002F annual report for a company that never had any economic activity. I need it done by this Friday, any recommendations will be highly appreciated!",["Date","2022-09-14T20:00:12.000Z"],0.34,0.75,{"text":152,"timestamp":153,"topicId":5,"sentiment":6,"topicConfidence":70,"sentimentConfidence":17},"Corporate taxation can be a hurdle for your company. With this in mind, we created new cards with easy-to-use info on taxation and dividends in Estonia. Explore, save, and share with those who might need this! Want to know more? Plunge into the full article: https:\u002F\u002Fenty.io\u002Fblog\u002Fsalary-and-dividends-taxation-in-estonia?utm_source=facebook&utm_medium=smm&utm_campaign=community",["Date","2022-09-14T12:22:20.000Z"],{"text":155,"timestamp":156,"topicId":5,"sentiment":50,"topicConfidence":22,"sentimentConfidence":41},"Hello, I have questions about VAT payer as a self-employed based in Estonia. Do you know someone who can be consulted about this? (regardless of paid or free) It'd be great if you could DM me. Thank you.",["Date","2022-09-11T08:55:08.000Z"],{"text":158,"timestamp":159,"topicId":5,"sentiment":6,"topicConfidence":160,"sentimentConfidence":161},"Hello, could you please advise how the vacation pay is calculated in Estonia? I mean, is the calculation done based on fix monthly salary written in the employment contract or it must be calculated based on total average monthly income in some period, where also additional bonuses are included?",["Date","2022-09-05T17:40:46.000Z"],0.31,0.9,{"text":163,"timestamp":164,"topicId":5,"sentiment":50,"topicConfidence":70,"sentimentConfidence":12},"Any Americans working remotely in Estonia? What's the tax situation like for Americans staying long-term? And any recommendations for a reputable, international tax specialist would be greatly appreciated. 😁",["Date","2022-09-04T18:54:01.000Z"],{"text":166,"timestamp":167,"topicId":5,"sentiment":6,"topicConfidence":125,"sentimentConfidence":168},"Hello there, I am writing you in regards to work done during bank holiday. I have a part time contract and I work usually 80-100 hours a month. in August I worked 10 hours on national holiday, 20th august, surprisingly though I haven't received any additional salary for that, I asked HR and they replied \"we do not compensate double payment for part timers, only full timers get double pay on holiday\", is that even legal? is there any specific law I should point HR at? thank you in advance",["Date","2022-09-02T13:13:05.000Z"],0.53,{"text":170,"timestamp":171,"topicId":5,"sentiment":6,"topicConfidence":70,"sentimentConfidence":46},"Anyone here in Estonia, a Tax resident and but still getting dividends from a passive company abroad? How do you declare that in Estonia and how is it taxed? I know FB advice on this is not exactly the best idea, but maybe someone has experience they are happy to share, while I try and speak to someone at the EMTA in English!  Cheers",["Date","2022-08-24T10:01:34.000Z"],{"text":173,"timestamp":174,"topicId":5,"sentiment":6,"topicConfidence":149,"sentimentConfidence":175},"Q to Americans living in Estonia, What sort of form\u002Fcertificate have you used from EMTA as an alternative to US form W2 for wages? Anyone had any experience in this manner? Thanks for any input",["Date","2022-08-22T09:18:06.000Z"],0.91,{"text":177,"timestamp":178,"topicId":5,"sentiment":6,"topicConfidence":179,"sentimentConfidence":17},"Considering I'm an expat and intend to move back to my home country at some point I was just curious if 'Funded Pension Payment' deduction from my salary is some how avoidable or refundable when I leave. Any clue anyone?",["Date","2022-08-19T07:37:18.000Z"],0.32,{"text":181,"timestamp":182,"topicId":5,"sentiment":6,"topicConfidence":45,"sentimentConfidence":57},"Hello everyone, How can i learn the tax rates for freelance work in Estonia? I want to have a projection for a year.  My company is willing to have a contract with me as a freelancer and a third party will deal with the issuing invoices (this is their agreed 3rd party) which means i won’t need to have a company. My company is operating outside of Estonia but the third party will have my payroll in Estonia.  But they said that they will pay me gross monthly and i need to take care of my taxes alone. Do you have any idea where can i get a better projection? (Even an online calculator would work, but each of them varies I couldn’t find a proper one) Thank you!!",["Date","2022-08-10T12:10:13.000Z"],{"text":184,"timestamp":185,"topicId":5,"sentiment":50,"topicConfidence":12,"sentimentConfidence":186},"Hi Looking for an accountant to file (late) the annual report for 2021. Any recommendations? Thank you!",["Date","2022-08-10T09:06:37.000Z"],0.56,{"text":188,"timestamp":189,"topicId":5,"sentiment":6,"topicConfidence":12,"sentimentConfidence":145},"Hi everyone, I’m looking for a new accountant. I have my OÜ now for about two months and am using Riihos for my bookkeeping. They do well but I’m looking for something a bit more personal considering that I’m new to the Estonian tax system. Any recommendations?",["Date","2022-07-21T14:55:03.000Z"],{"text":191,"timestamp":192,"topicId":5,"sentiment":6,"topicConfidence":91,"sentimentConfidence":75},"Hello Dear Tallinners! #freelance #typeD #recentgraduate  I have a question! I am a recent graduate from the Estonian Academy of Arts and i am holding type D visa which is issued for 9 months. With this visa i know that i am able to work at Estonia. But can i also work as a freelancer for a company in Germany and issue an invoice on behalf of my name?( then i pay the tax to Estonia?) I have this e-resident card but do i have to open a company on my name?  I appreciate if you can help. I am trying to reach out to migration consultants but they decline by saying that they are busy.  Aitah! 🥰",["Date","2022-07-19T10:39:42.000Z"],{"text":194,"timestamp":195,"topicId":5,"sentiment":6,"topicConfidence":125,"sentimentConfidence":57},"Dear all, could you please help what can I do if an Estonian client disappears for two months after we sent out our bill (correct contract, webshop building), and ignores us when we ask him to pay? Which is the quickest way to get what we were working for? Thank you!",["Date","2022-07-16T08:59:49.000Z"],{"text":197,"timestamp":198,"topicId":5,"sentiment":6,"topicConfidence":199,"sentimentConfidence":32},"Hello, does anyone know of a decent tax advisor (or accountant who understands the Estonian tax system)? English speaking preferably but Russian also fine...",["Date","2022-07-04T13:56:53.000Z"],0.82,{"text":201,"timestamp":202,"topicId":5,"sentiment":6,"topicConfidence":12,"sentimentConfidence":18},"Hello, I need recommendations for an accountant (who actually replies), for a very small oü.",["Date","2022-06-18T05:24:56.000Z"],{"text":204,"timestamp":205,"topicId":5,"sentiment":6,"topicConfidence":206,"sentimentConfidence":186},"Hi guys! I will move to Estonia soon and I'm in the process of signing documents etc. I have got one question regarding \"Tax free minimum amount\" and I should choose if I want to get it calculated or not. On the government homepage I found some information and I understood that I'm not eligible because my gross salary will exceed the maximum amount for which this benefit is allowed. However, since I will be employed in July maybe they calculate the gross based on 6 months for 2022? In that case the total yearly gross\u002F12  will be within the sum for being eligible. Did anyone have similar situation and could advise what is the best to choose? I would like to avoid to get some free amount and then to pay it back because of miscalculation. Thank you very much in advance!",["Date","2022-06-08T12:47:50.000Z"],0.33,{"text":208,"timestamp":209,"topicId":5,"sentiment":50,"topicConfidence":168,"sentimentConfidence":210},"Hi everyone, Hope everyone is doing great 😊 Can someone help me with some clarification in working as a solo employee (like a freelancer, with a company that's mine), as we call it Business to Business (B2B). I have some questions about what are the necessary rules, process, taxes or fees I have to pay to open it. I already have an estonian ID. Any help you can give me, I would really appreciate it 😊😊 Have a great day 😉",["Date","2022-06-08T07:18:19.000Z"],0.94,{"text":212,"timestamp":213,"topicId":5,"sentiment":6,"topicConfidence":214,"sentimentConfidence":12},"Tricky question - can I officially have two jobs in Estonia (one full time, one part time\u002Ffreelance) as a non EU citizen?  All info that I found stated that if I have TRP issued by one employer, there is no need for the second employer to bother. But that’s all I found. Any idea where to read more? Or mb relevant experience? Thanks in advance 💛",["Date","2022-06-04T12:08:03.000Z"],0.23,{"text":216,"timestamp":217,"topicId":5,"sentiment":6,"topicConfidence":129,"sentimentConfidence":87},"Hi. Maybe someone works on Upwork with an Estonian residence permit. Where did you get the VAT number for the platform? Upwork wants a 9-digit number, but our ID number has 11 digits.",["Date","2022-05-27T15:35:39.000Z"],{"text":219,"timestamp":220,"topicId":5,"sentiment":50,"topicConfidence":70,"sentimentConfidence":75},"Hey fellow expats - need some advice if you are a professional contractor and a tax resident in Estonia. If you're working as a contractor (with a foreign company not in Estonia) what did you do about income tax? Did you work with an accountant?  Most common advice I hear is to create a Private limited company (OÜ) to invoice. It seems a bit complex (especially on how you need to split money to salary and dividends to get paid and not get screwed with %) I saw some services like xolo but they charge a tiered fee and have odd ways of doing thing. Would really appreciate if you can share your experience and what you did :)  Thanks a lot!",["Date","2022-05-18T13:26:31.000Z"],{"text":222,"timestamp":223,"topicId":5,"sentiment":6,"topicConfidence":149,"sentimentConfidence":28},"I urgently need an accountant to handle my Annual reports. Is anyone qualified out there, please pm me? Vajan kiiresti raamatupidajat, kes tegeleks aastaaruannetega. Kas keegi on seal kvalifitseeritud, palun kirjuta mulle?",["Date","2022-05-15T18:42:01.000Z"],{"text":225,"timestamp":226,"topicId":5,"sentiment":6,"topicConfidence":107,"sentimentConfidence":87},"I urgently need an accountant to handle my Annual reports. Is anyone qualified out there, please pm me?  Vajan kiiresti raamatupidajat, kes tegeleks aastaaruannetega. Kas keegi on seal kvalifitseeritud, palun kirjuta mulle?",["Date","2022-05-15T18:40:59.000Z"],{"text":228,"timestamp":229,"topicId":5,"sentiment":6,"topicConfidence":149,"sentimentConfidence":230},"Good afternoon! I moved to Estonia a few days ago and would like to start working again. Back in my country, I was what you call FIE here, but after finding out I'd lose 40% of my income to the taxes, my newcomer enthusiasm quickly disappeared. I looked at the previous posts and comments here and saw there's an option of OÜ, but I don't know much about it. So I'm looking for someone who could provide more detailed info about what is OÜ and if it's a viable option for me. Please let me know, thank you!",["Date","2022-05-14T13:15:12.000Z"],0.44,{"text":232,"timestamp":233,"topicId":5,"sentiment":144,"topicConfidence":234,"sentimentConfidence":28},"Solved ======= Hello, is there a way to extract any kind of certificate proving the time i worked in Estonia?  In my home country it's a standard procedure to receive such a certificate on the last day of employment, but here i didn't get anything. I wonder what i should present to authorities to claim years that i worked in other EU country. Apparently there are no strict regulations on how it has to look like, but i guess it has to be precise in dates.  I bet there's some governmental website where it could be stated, but I have difficulties finding it. Help needed. I thougt about pay slips from bank account, but they don't state exact dates on what day exactly i started and finished working, so they are no good. Thank uu",["Date","2022-05-10T20:20:20.000Z"],0.25,{"text":236,"timestamp":237,"topicId":5,"sentiment":6,"topicConfidence":45,"sentimentConfidence":238},"Hi all. I am hoping someone can help me with finding the per-diem rates which a company should pay when an Estonian worker works abroad. Please note that most Google searches give you the rate for working IN Estonia when stationed abroad.",["Date","2022-05-09T10:53:22.000Z"],0.74,{"text":240,"timestamp":241,"topicId":5,"sentiment":6,"topicConfidence":56,"sentimentConfidence":161},"I have registered Estonian Company, I reside in India, how can I buy LVMH. shares ?",["Date","2022-05-07T13:42:34.000Z"],{"text":243,"timestamp":244,"topicId":5,"sentiment":6,"topicConfidence":75,"sentimentConfidence":161},"Hi all I would like to ask a question re Tax. Does Estonia have Tax brackets? or its a flat rate 0f 20% on all income?",["Date","2022-04-24T19:16:58.000Z"],{"text":246,"timestamp":247,"topicId":5,"sentiment":144,"topicConfidence":248,"sentimentConfidence":92},"Hello, Is anyone having online job from a company located outside of Estonia? If yes, how do you pay taxes in Estonia (other than LHV entrepreneur account)? Because I knew that LHV entrepreneur account just takes 20% off from the income whether it is small or big, and if crossed the 25k annually mark, it goes to 40%. So, it is not the right account for income as social tax is not handled this way either.  Kindly contact me directly or write in the comments how do you do it.",["Date","2022-04-18T07:10:36.000Z"],0.45,{"text":250,"timestamp":251,"topicId":5,"sentiment":50,"topicConfidence":65,"sentimentConfidence":65},"Hi, everyone! Does anybody know if there's any practical guide in english (video or written) for how to fill the e-forms for income taxes? I've been looking for it but didn't find any so far. Thank you!",["Date","2022-04-07T14:32:57.000Z"],{"text":253,"timestamp":254,"topicId":5,"sentiment":50,"topicConfidence":214,"sentimentConfidence":87},"Hello guys! I want to ask a question: I currently hold Estonian TRP after finishing master degree here but got another job offer in Netherlands. My TRP is not bond to my employer and it expires in 5 years. If I move to Netherlands, will my current TRP be cancelled? And in the future, if I decide to come back to Estonia, will they issue me a TRP again? I'm from Non-EU\u002FEEA countries. Thanks in advance for your great help!",["Date","2022-03-29T14:02:47.000Z"],{"text":256,"timestamp":257,"topicId":5,"sentiment":6,"topicConfidence":258,"sentimentConfidence":17},"Hello guys. I am Italian and my residence is in France. Does anyone know if it's possible to open an OU in Estonia and pay corporate taxation in Estonia on dividends? Once the dividends are paid I will declare them in France on my personal income ( impots ). I do not send any invoices in France. Most of my income is generated in USA and Italy. Does this sound possible from anyone's experience? Best Edoardo",["Date","2022-03-25T08:57:41.000Z"],0.79,{"text":260,"timestamp":261,"topicId":5,"sentiment":6,"topicConfidence":116,"sentimentConfidence":17},"Running an e-commerce company? We have a special accounting offer for you. You may know that the accounting process for e-commerce companies is quite complex. As it includes sales reports, lots of invoices, and in most cases VAT liabilities. We’ve decided to create an accounting plan specifically for such companies. Just upload your sales reports, invoices, and other documents on our platform in time, and we’ll take care of the rest. Explore the offer and prices on the special webpage.",["Date","2022-03-22T14:22:22.000Z"],{"text":263,"timestamp":264,"topicId":5,"sentiment":144,"topicConfidence":186,"sentimentConfidence":265},"A question to the US citizens.  One of my friends wanted to make his IRS declaration online. He was told that he has zu use FB or Google. He is not in social media.  Does anyone  know about such absurd rules before?",["Date","2022-03-20T13:39:00.000Z"],0.6,{"text":267,"timestamp":268,"topicId":5,"sentiment":6,"topicConfidence":269,"sentimentConfidence":133},"Tere Hommikust.Ma vajan nõu ....when Talking about a permanent establishment .... ¿Is there any specific requirement from authorities??could It be considered a storage room if I have a part-time employee in the country?¿Shall It be a Coworking space,perhaps?  Täname teid kõiki koostöö eest",["Date","2022-03-17T11:57:04.000Z"],0.27,{"text":271,"timestamp":272,"topicId":5,"sentiment":50,"topicConfidence":40,"sentimentConfidence":8},"Hey people, question about legal entities: Does MTÜ covers the opportunities of a social enterprise? Thank you!",["Date","2022-03-17T10:38:03.000Z"],{"text":274,"timestamp":275,"topicId":5,"sentiment":6,"topicConfidence":276,"sentimentConfidence":33},"Hi everyone!  I’m trying to declare my income for last year. Besides my job in Estonia I’m also doing some freelance jobs on Upwork. However I’m struggling with adding Upwork’s income to declaration.  Could anyone who went through it already advise what exactly has to be added in section “Registry code”? Is it Upwork’s registration number?",["Date","2022-03-13T17:31:59.000Z"],0.46,{"text":278,"timestamp":279,"topicId":5,"sentiment":6,"topicConfidence":280,"sentimentConfidence":12},"Hey everyone, I just opened my OÜ, in the near future I am planning to use it to freelance in Estonia and abroad. At the moment I’m looking for a bookkeeper to help a bit with the tax system and some general information about setting up invoices over here. If you know someone or know where to look, I would appreciate your recommendations.",["Date","2022-03-09T09:58:20.000Z"],0.86,{"text":282,"timestamp":283,"topicId":5,"sentiment":50,"topicConfidence":70,"sentimentConfidence":71},"Hi everyone! I've searched the group for a few indications of accountants experienced with the establishment of FIE and OÜ, but the maximum I could find was one lost in a comment. I'm considering a move to Estonia and other EU countries, but since I work for different companies from different countries I'm still looking for the best tax match. I have read quite a bit about FIE, in the first place, but in order to make a decision, I'm certainly going to need some guidance. Any recommendation would be greatly appreciated. Thank you very much in advance!",["Date","2022-03-09T09:32:08.000Z"],{"text":285,"timestamp":286,"topicId":5,"sentiment":6,"topicConfidence":179,"sentimentConfidence":23},"Hello everyone. I need some professional advice regards work visas, taxes, employment status. Below is a quick overview of my situation. If anyone here has experience with any consultants that could help me, please let me know.  Situation - I am a British national. Living in Tallinn with a residency permit. It is looking likely that I will get a new job with an EU company with no Estonian entity. As I do not have an EU passport, I am unsure of the best way to be employed by said company? From my limited understanding, I think the best option is for me to setup my own Estonian company and therefore be employed in Estonia.  If anyone has any experience with a similar situation then I would appreciate it.",["Date","2022-03-09T07:02:28.000Z"],{"text":288,"timestamp":289,"topicId":5,"sentiment":6,"topicConfidence":160,"sentimentConfidence":265},"Hi everyone! I have a dormant company (OU) here in Estonia and I've been asked to submit an annual report. Through online research I've been able to complete it (almost) on my own but got stuck on two things. 1. What should be the labor cost? (no employees) 2. What do I choose on the 'proposal for distribution \u002F covering loss' field? Hope you can shade some light on this. Thanks a lot 🙏",["Date","2022-03-08T00:30:41.000Z"],{"text":291,"timestamp":292,"topicId":5,"sentiment":6,"topicConfidence":12,"sentimentConfidence":293},"Hi Anyone can recommend an accountant for a very simple company tax declaration consultation? Thanks",["Date","2022-03-01T11:18:24.000Z"],0.67,{"text":295,"timestamp":296,"topicId":5,"sentiment":144,"topicConfidence":45,"sentimentConfidence":293},"My new employer says that I can apply for basic exemption. Can someone explain very simply to me what that means? What are the pro’s and con’s or advantages\u002Fdisadvantages of applying for basic exemption?  Does exemption mean I don’t need to pay tax at all? Will that come around and bite me in the ass later on? If I become unemployed later on will that mean I don’t qualify for any benefits?  I have read this page and I still don’t quite understand. Please explain to me like I’m 5 years old 😅 thanks",["Date","2022-02-25T13:21:55.000Z"],{"text":298,"timestamp":299,"topicId":5,"sentiment":6,"topicConfidence":276,"sentimentConfidence":28},"Is there anyone that can help me with my Tax? I've heard I can get some sort of tax break as my wife isn't working but I have no clue... and are there other things that I may be able to claim back but I don't know aboutUPDATE- The event will take place on the 1st of March at 16.30. See you all International House of Pärnu, Eesti Pagulasabi \u002F Estonian Refugee Council and EMTA (Estonian Tax and Customs Board) will have an online training Tomorrow on the 22nd of February at 16.00. Purpose of the free training: How to fill out an income tax form.  If you are interested in participating, please PM me, and I´ll share the link. The project \"#minuadapter: adaptation activities for third-country nationals\" is funded by the European Union through the Asylum, Migration and Integration Fund and the Ministry of the Interior. International House of Pärnu, Tartu Rahvaülikool and Tallinna Rahvaülikool as partners.  The event takes place in English.",["Date","2022-02-21T13:02:04.000Z"],{"text":301,"timestamp":302,"topicId":5,"sentiment":6,"topicConfidence":303,"sentimentConfidence":61},"Doing my tax return and there is a tax payable of 100 e. Annoying. Not sure how it occurred, but my question is, are there any common tax deductions available when doing tax returns that I may have missed? First time doing it. Where I am from you can claim detergent\u002Felectricity\u002Fdry cleaning all sorts of things but not sure here for a Full time employee.UPDATE- The event will take place on the 1st of March at 16.30. See you all International House of Pärnu, Eesti Pagulasabi \u002F Estonian Refugee Council and EMTA (Estonian Tax and Customs Board) will have an online training Tomorrow on the 22nd of February at 16.00. Purpose of the free training: How to fill out an income tax form.  If you are interested in participating, please PM me, and I´ll share the link. The project \"#minuadapter: adaptation activities for third-country nationals\" is funded by the European Union through the Asylum, Migration and Integration Fund and the Ministry of the Interior. International House of Pärnu, Tartu Rahvaülikool and Tallinna Rahvaülikool as partners.  The event takes place in English.",["Date","2022-02-21T10:51:11.000Z"],0.97,{"text":305,"timestamp":306,"topicId":5,"sentiment":6,"topicConfidence":12,"sentimentConfidence":18},"Anybody have recommendations for an accountant for a very small, side business?  OU, very little invoices in or out, but one part part time employee.  Looking for someone to handle organize the monthly books and pay the employee.  No monthly VAT reporting or monthly reporting, just year end report (which happens in August)",["Date","2022-02-21T06:56:22.000Z"],{"text":308,"timestamp":309,"topicId":5,"sentiment":6,"topicConfidence":12,"sentimentConfidence":175},"Looking for a recommendation: Tax counselling\u002Fadvice for (FIE). English speaking?",["Date","2022-02-18T08:47:22.000Z"],{"text":311,"timestamp":312,"topicId":5,"sentiment":6,"topicConfidence":313,"sentimentConfidence":140},"hi , is there an option on tax refund. that I have not been in EU, while I was being taxed in Estonia ?",["Date","2022-02-15T11:19:05.000Z"],0.35,{"text":315,"timestamp":316,"topicId":5,"sentiment":144,"topicConfidence":66,"sentimentConfidence":12},"Hi! I was looking at Emta website about tax declarations and eventually tax refund. They mention that I’m not a a taxable resident in Estonia (move in in October got residence in November) and they ask me to declare my previous income in Italy to be taxed here. But I did already paid income taxes in Italy higher then here and I don’t see the reason to declare it here. Can I avoid to do it?",["Date","2022-02-12T22:05:50.000Z"],{"text":318,"timestamp":319,"topicId":5,"sentiment":50,"topicConfidence":107,"sentimentConfidence":320},"Dear Group, I can always count on your help 🙏 🐝 this time I am looking for an accountant as I opened my own OU. The job will be simple because I will not have many invoices. The truth is I don’t speak Estonian and I may have more questions at the beginning to learn the process but we may agree for a different price for the first month accounting + consultancy. Thank you for recommendations of free mind accountants (cool people) who speak English and don’t mind working with foreigners. 🙏🤞🌎",["Date","2022-02-09T20:17:36.000Z"],0.87,{"text":322,"timestamp":323,"topicId":5,"sentiment":6,"topicConfidence":7,"sentimentConfidence":112},"If you leave your job or get made redundant (and perhaps for topic purposes there is a difference l) do you get paid out unused annual\u002Fvacation leave?",["Date","2022-02-09T19:37:44.000Z"],{"text":325,"timestamp":326,"topicId":5,"sentiment":50,"topicConfidence":111,"sentimentConfidence":17},"Good morning! Any recommendations for accounting services in Tallinn? Occasional expenses and billing, annual report. Thanks!",["Date","2022-02-09T07:12:44.000Z"],{"text":328,"timestamp":329,"topicId":5,"sentiment":6,"topicConfidence":70,"sentimentConfidence":13},"Question for those who are Estonian tax residence and hold US REITs through their Estonian investment account: Do you pay the taxes on those dividends to the US IRS or the Estonian tax board? The LHV broker that I spoke to said that we pay the Estonian tax board, but the info that I found on the web states that US REITs dividends are subject to US taxes regardless of whether foreigners own it. 😐 Can anyone recommend an English speaking tax consultant in this field?",["Date","2022-02-07T20:06:03.000Z"],{"text":331,"timestamp":332,"topicId":5,"sentiment":144,"topicConfidence":40,"sentimentConfidence":17},"I recall when I first arrived in Estonia being told repeatedly that Full time employees HAVE to take 14 or 15 calendar days  off work consecutively. My employer has asked for proof of this but info seems scarce. I’m sure I didn’t imagine this?",["Date","2022-02-04T09:18:36.000Z"],{"text":334,"timestamp":335,"topicId":5,"sentiment":6,"topicConfidence":230,"sentimentConfidence":161},"Can you recommend a freight forwarder for books USA-ESTONIA that would also handle the import filings, duties, or taxes with the Estonian toll?",["Date","2022-02-02T12:45:37.000Z"],{"text":337,"timestamp":338,"topicId":5,"sentiment":6,"topicConfidence":160,"sentimentConfidence":28},"Quick biz question - I am purchasing some raw materials from the UK. I am a registered OU company here in Estonia with a VAT number. Do I have to pay VAT to the UK supplier?",["Date","2022-01-28T12:58:36.000Z"],{"text":340,"timestamp":341,"topicId":5,"sentiment":144,"topicConfidence":342,"sentimentConfidence":133},"Hi expats, I'm currently looking for a flat, and most of the ones I like end up having a D\u002FE energy certificate, or no certificate at all. For a 2 rooms flat for a single person, what impact could that have on the bills? I understand it's the worst case, but how much worse than an A\u002FB certificate? 100% more expensive bills or anything like that?",["Date","2022-01-24T07:01:13.000Z"],0.4,{"text":344,"timestamp":345,"topicId":5,"sentiment":50,"topicConfidence":99,"sentimentConfidence":265},"Hi, I am looking for a private accountant who can help me file my tax return. Please PM if interested. Thanks!",["Date","2022-01-19T17:48:10.000Z"],{"text":347,"timestamp":348,"topicId":5,"sentiment":144,"topicConfidence":70,"sentimentConfidence":12},"Hi hi everyone, Is there anyone using xolo.go for freelance invoices? If yes, how do you do your taxes\u002Fwhat accounting services you use? I don’t have OU in Estonia and considering this service, but a bit lost with legal part of taxation system",["Date","2022-01-14T18:02:53.000Z"],{"text":350,"timestamp":351,"topicId":5,"sentiment":6,"topicConfidence":150,"sentimentConfidence":168},"\u003CIssuing invoices question\u003E  Hi! I work part-time in a school in Tallinn, so they pay for my social tax and so on and I'm a tax resident in Estonia. I have the possibility to also teach some hours in an online language school based in Spain, but they need me to create an invoice. What options do I have? I have checked OÜ, FIE and the entrepreneur account in LHV but the cost is quite high for the benefit (less than 500 gross) and in LHV I am not able to issue an invoice. Is there any way I could issue an invoice without any of these for this small amount? Thank you all!",["Date","2022-01-13T11:33:46.000Z"],{"text":353,"timestamp":354,"topicId":5,"sentiment":6,"topicConfidence":175,"sentimentConfidence":121},"Guys, I am looking for freelance Estonian tax accountant who can file my returns for 2019 and 2020.  There’s rarely any transaction in 2019 And around 3000 euros gross transactions in 2020. Not looking for agencies, only individuals.",["Date","2022-01-13T11:18:20.000Z"],{"text":356,"timestamp":357,"topicId":5,"sentiment":6,"topicConfidence":12,"sentimentConfidence":103},"Hello fellow expats, Anyone own an OÜ? I need to ask some questions: 1- Is there a running cost for having an OÜ? 2- How do you report taxes? 3- Is there an app or a third party company that helps with handling taxes, bookkeeping, etc.? Feel free to write to me directly also please.",["Date","2022-01-10T13:00:41.000Z"],{"text":359,"timestamp":360,"topicId":5,"sentiment":6,"topicConfidence":52,"sentimentConfidence":87},"Hi all, A friend of mine who ended up living in Tallinn longer than expected in 2021needs some tax advice from a knowledgeable Estonian accountant or tax attorney familiar with foreigners' tax issues. Does anybody have any good reference to share? thanks!",["Date","2022-01-05T20:45:33.000Z"],{"text":362,"timestamp":363,"topicId":5,"sentiment":50,"topicConfidence":238,"sentimentConfidence":210},"Hey guys! I'm looking for a nice, professional accountant in Estonia 🙂 Please make some recommendations!",["Date","2022-01-04T10:08:14.000Z"],{"text":365,"timestamp":366,"topicId":5,"sentiment":6,"topicConfidence":13,"sentimentConfidence":367},"Has anyone recently sent some things from the UK to EE? I just got a new place in Tallinn and finally want to send the remainder of my things out here. I notice there is a tax exemption on relocating things here it however the list of documents is things like purchase receipts for goods etc that ive had in my mums loft for 10 years. If you have done this recently how strict did you find it? Using estolink to send FYI.",["Date","2022-01-03T22:10:43.000Z"],0.77,{"text":369,"timestamp":370,"topicId":5,"sentiment":6,"topicConfidence":371,"sentimentConfidence":82},"Hi, I'm in a process of starting up a small company that provides videos and animations. I don't know where to turn to for accounting needs. I would need someone who could work around a project based income. Suggestions are welcome.",["Date","2022-01-02T22:54:15.000Z"],0.29,{"id":5,"label":373,"color":374},"tax, accountant, income","#bab0ab",[376,379,382,385,387,389,391,393,396,398],[377,378],"tax",220,[380,381],"accountant",100,[383,384],"income",60,[386,384],"pay",[388,384],"company",[390,384],"invoice",[392,384],"employee",[394,395],"accounting",40,[397,395],"freelance",[399,395],"taxation"],"uses":{"params":["topic_id"]}}]}
