{"type":"data","nodes":[null,{"type":"data","data":[{"posts":1,"topic":474,"representativeWords":477},[2,9,15,19,23,27,30,35,39,44,48,52,56,60,64,68,72,76,80,84,88,93,96,101,106,110,114,118,122,125,128,131,134,138,143,146,149,152,156,159,162,166,169,174,177,181,184,187,190,193,196,199,202,206,209,212,216,220,224,227,231,234,237,240,243,246,250,253,256,260,264,267,271,274,278,281,284,287,290,293,296,299,302,305,308,311,314,317,320,323,326,329,332,335,338,341,345,349,352,355,359,362,365,368,371,374,377,380,383,386,390,393,396,399,402,405,408,411,414,417,420,423,426,429,432,435,438,441,444,447,450,453,456,459,462,465,468,471],{"text":3,"timestamp":4,"topicId":5,"sentiment":6,"topicConfidence":7,"sentimentConfidence":8},"Hi, I'm looking for math tutor for my son, year 9, in European school (EB\u002FIB system). Can be done online. Would appreciate recommendations 🙂",["Date","2022-12-29T15:52:56.000Z"],7,"Positive",0.89,0.81,{"text":10,"timestamp":11,"topicId":5,"sentiment":12,"topicConfidence":13,"sentimentConfidence":14},"Hello, my boyfriend is looking for an English teacher for him to get a diploma that proves he speaks english, is there anyone to help?",["Date","2022-12-27T20:12:35.000Z"],"Neutral",0.74,0.83,{"text":16,"timestamp":17,"topicId":5,"sentiment":12,"topicConfidence":8,"sentimentConfidence":18},"Really need to learn Estonian. For a minute I thought Elisa is giving me €5,000 as a Christmas present 🤣",["Date","2022-12-15T13:54:47.000Z"],0.48,{"text":20,"timestamp":21,"topicId":5,"sentiment":6,"topicConfidence":7,"sentimentConfidence":22},"Hi all. We are looking for a Maths tutor for a 13-year-old boy. It needs to be someone who has experience teaching this age and, ideally, has some references. Please recommend someone on here or pm me. Thanks😊",["Date","2022-12-13T13:18:31.000Z"],0.62,{"text":24,"timestamp":25,"topicId":5,"sentiment":12,"topicConfidence":26,"sentimentConfidence":22},"Hello! 🇺🇸 Language School Tarkus is looking for a native English teacher who would be ready to teach adult individual and group students in the center of Tallinn. If you are interested, please contact info@tarkus24.ee.",["Date","2022-12-12T08:54:16.000Z"],1,{"text":28,"timestamp":29,"topicId":5,"sentiment":12,"topicConfidence":26,"sentimentConfidence":22},"Hello!  🇺🇸 Language School Tarkus is looking for a native English teacher who would be ready to teach adult individual and group students in the center of Tallinn. If you are interested, please contact info@tarkus24.ee.",["Date","2022-12-12T08:53:49.000Z"],{"text":31,"timestamp":32,"topicId":5,"sentiment":6,"topicConfidence":33,"sentimentConfidence":34},"ENGLISH ONLINE COURSE 🇬🇧  Hi everyone 🙂  My name is Nata, I am an English teacher with more than 5 years of experience 👩🏻‍🏫  🎧 private lessons ONLINE on Skype   📝 I'll help you with the English language to be able to have a job interview or simply to improve the conversation 🗣  ✔️ all levels from A1 to C1.  ✔️ study materials are provided by me 📚 no need to buy anything  For details and prices please send me a private message 📩 I will answer to everyone!  Thank you for your attention 🙂",["Date","2022-12-05T11:49:57.000Z"],0.91,0.88,{"text":36,"timestamp":37,"topicId":5,"sentiment":12,"topicConfidence":38,"sentimentConfidence":8},"If anyone here is a student from Bangladesh, please ping me on messenger. I need some information.  Thanks in advance.",["Date","2022-11-27T09:55:24.000Z"],0.78,{"text":40,"timestamp":41,"topicId":5,"sentiment":12,"topicConfidence":42,"sentimentConfidence":43},"Hello group, I am looking for a chemistry teacher who speaks English or Spanish for my son.  If there is someone please I need it urgently",["Date","2022-11-27T09:27:28.000Z"],0.66,0.76,{"text":45,"timestamp":46,"topicId":5,"sentiment":12,"topicConfidence":47,"sentimentConfidence":34},"One way to practice counting in Estonian…",["Date","2022-11-20T13:04:21.000Z"],0.99,{"text":49,"timestamp":50,"topicId":5,"sentiment":6,"topicConfidence":26,"sentimentConfidence":51},"Hi everyone. This is Queenie:) I am looking for students who are interested to take online language classes.  I have a degree in Education and I also have a Master’s degree in creative art psychotherapy. I am very patient and my classes are fun. I have 10+ years teaching experience teaching students from Finland, Mongolia, China, UK, New York and Hong Kong.I can teach Cantonese, Mandarin and English for all ages remotely. If you are interested to learn from me, don’t hesitate to contact me:)",["Date","2022-11-09T18:23:03.000Z"],0.93,{"text":53,"timestamp":54,"topicId":5,"sentiment":6,"topicConfidence":13,"sentimentConfidence":55},"Hola 👋🏼, I am Javier. I am a certified native Spanish teacher with 3 years of experience 🇪🇦👨‍🏫.  I offer private and group courses online from beginner to advanced level. That's what I propose: 💬 Pronunciation and expressions 📝 Vocabulary and grammar 🎵 Oral and written comprehension  🔸️in a pleasant and communicative way 🔸️tailored to the student(s) needs 🔸️really affordable prices 🔸️online over Zoom 🔸️I speak English and French  Here you can check out my page: https:\u002F\u002Fwww.facebook.com\u002FHola-yo-hablo-espa%C3%B1ol-104906934680522  If you have any questions, it will be a pleasure to assist you.  See you soon! ¡Hasta pronto!  Thank you,  Javier",["Date","2022-11-06T10:01:33.000Z"],0.9,{"text":57,"timestamp":58,"topicId":5,"sentiment":12,"topicConfidence":26,"sentimentConfidence":59},"European online school is looking for native and non-native teachers of finish, swedish and dutch for teaching online. You should be a friendly and easy-going person, and eager to learn how to teach if you don’t have any teaching experience. Please write me a PM (private message) with short intro about yourself. P.S. Sorry, I don’t have time for answering your comments here.",["Date","2022-11-04T09:07:12.000Z"],0.53,{"text":61,"timestamp":62,"topicId":5,"sentiment":12,"topicConfidence":26,"sentimentConfidence":63},"Hello, can anyone suggest a good language school in Tallinn for intensive Estonian lessons, 3-4 weeks. I am somewhere between level A1 and A2. What I need is a conversational course with some grammar to get up to speed. Starting from next week or the week after. Thanks!",["Date","2022-11-01T07:40:24.000Z"],0.55,{"text":65,"timestamp":66,"topicId":5,"sentiment":6,"topicConfidence":26,"sentimentConfidence":67},"Hello everyone,  I am a native English man permanently living in Estonia. Do you or your children need help mastering the English language? If so then look no further, as a licensed ESL teacher I can help you achieve your goals. I offer private tutoring at €15 per hour.  Contact me for more information.",["Date","2022-10-19T08:59:40.000Z"],0.52,{"text":69,"timestamp":70,"topicId":5,"sentiment":6,"topicConfidence":26,"sentimentConfidence":71},"Hello everyone,  I am a native English man permanently living in Estonia. Do you or your children need help mastering the English language? If so, then look no further. As a licensed ESL teacher I can help you achieve your goals. I offer private tutoring at €15 per hour.  Contact me for more information.",["Date","2022-10-19T08:59:19.000Z"],0.5,{"text":73,"timestamp":74,"topicId":5,"sentiment":6,"topicConfidence":26,"sentimentConfidence":75},"Can someone reccomend an affordable private estonia language teacher  Love to learn for real!",["Date","2022-10-12T10:21:43.000Z"],0.86,{"text":77,"timestamp":78,"topicId":5,"sentiment":6,"topicConfidence":43,"sentimentConfidence":79},"Hi! Is here someone - who can teach Italian? (in Tallinn)  I´m interested in learning - for beginner. Thanks! 🇮🇹",["Date","2022-10-12T07:50:54.000Z"],0.84,{"text":81,"timestamp":82,"topicId":5,"sentiment":12,"topicConfidence":79,"sentimentConfidence":83},"How teachers are getting paid in Europe  https:\u002F\u002Fwww.euronews.com\u002Fnext\u002F2022\u002F10\u002F05\u002Fteachers-pay-which-countries-pay-the-most-and-the-least-in-europe",["Date","2022-10-07T05:14:52.000Z"],0.72,{"text":85,"timestamp":86,"topicId":5,"sentiment":12,"topicConfidence":38,"sentimentConfidence":87},"Please don’t be offended! I am grateful that the gov provided free Estonian class. My question is how do you learn Estonian grammar when your teacher does not speak English?",["Date","2022-10-06T11:37:41.000Z"],0.42,{"text":89,"timestamp":90,"topicId":5,"sentiment":6,"topicConfidence":91,"sentimentConfidence":92},"Hi everyone, new to the Group, I visit Tallinn every couple of months for a week of work.  My company Lingvist just launched their learn Estonian course (from English) in the last few weeks and are specifically targeting expats. It teaches vocabulary in contextual sentences and you can either practice your spelling by typing your answers or perfect your pronunciation with voice input.  It works wonders for developing passive vocabulary quickly in the short term (ie. Your reading comprehension increases rapidly) and over a longer period of use this translates into active use with spaced repetition.  I used the app for learning German before I started working for them and well… the fact I now work for them speaks for the fact it worked for me!!!  We are adding content all the time, our Android app is currently more advanced than iOS but iOS will catch up soon.  Any questions please reach out.  We are on Android, iOS and web",["Date","2022-10-04T14:40:39.000Z"],0.98,0.92,{"text":94,"timestamp":95,"topicId":5,"sentiment":12,"topicConfidence":26,"sentimentConfidence":7},"Hi, I am looking for a math teacher for my 16-year-old daughter to help her either online or in person 1-2x a week. Anyone you know?",["Date","2022-10-04T12:41:09.000Z"],{"text":97,"timestamp":98,"topicId":5,"sentiment":6,"topicConfidence":99,"sentimentConfidence":100},"Hi there! If any here here are interested in improving their or learning Estonian, Russian or another language by taking lessons at your most convenient times with experienced teachers then you can do so with us at WebTeachers. We are a language, content creation and social media management service provider company and provide lessons that can be customized to suit your level, goals, learning style and interests. If you would like to try out the first lesson for free to see how you like it then contact us on: info@webteachers.eu",["Date","2022-10-03T12:07:56.000Z"],0.94,0.7,{"text":102,"timestamp":103,"topicId":5,"sentiment":6,"topicConfidence":104,"sentimentConfidence":105},"Hi everyone! Are there any germans in this group who is willing to give private German lessons? If so, send me a DM. :)",["Date","2022-09-28T08:45:45.000Z"],0.67,0.6,{"text":107,"timestamp":108,"topicId":5,"sentiment":6,"topicConfidence":109,"sentimentConfidence":14},"💜 NEW ZOUK BEGINNERS 💜 In October we are opening new ZOUK group for beginners on THURSDAYS! Try out the lesson for FREE! 😍 The lessons will take place: 6th of October at 20:00–21:45 13th of October at 20:00–21:45 20th of October at 20:00–21:45 27th of October at 20:00–21:45 See you soon! ✨ You can register here: https:\u002F\u002Feuphoriastudio.ee\u002Ftrennid\u002Fzouk-beginners",["Date","2022-09-27T18:40:07.000Z"],0.59,{"text":111,"timestamp":112,"topicId":5,"sentiment":6,"topicConfidence":113,"sentimentConfidence":33},"Hi there! If any expats, remote workers or anyone else here are interested in improving their or learning Estonian, Russian or another language then you can do so with us at WebTeachers. We are a language, content creation and social media management service provider company and also offer our clients free online language lessons as cooperation benefits. The lessons are with experienced teachers and can be taken at your most preferred times. If you are interested to try then let us know on: info@webteachers.eu May you have a good week.",["Date","2022-09-19T18:41:13.000Z"],0.8,{"text":115,"timestamp":116,"topicId":5,"sentiment":6,"topicConfidence":117,"sentimentConfidence":55},"Hi there! If any expats, remote workers or anyone else here are interested in improving their or learning Estonian, Russian or another language then you can do so with us at WebTeachers. We are a language, content creation and social media management service provider company from Riga, Latvia and also offer our clients free online language lessons as cooperation benefits. The lessons are with experienced teachers and can be taken at your most preferred times. If you are interested to try then let us know on: info@webteachers.eu May you have a good week.",["Date","2022-09-19T17:16:17.000Z"],0.77,{"text":119,"timestamp":120,"topicId":5,"sentiment":6,"topicConfidence":121,"sentimentConfidence":51},"Hi everybody!  I was looking for recommendations for a good school or website\u002Fapp where I could learn POLISH language, level A1\u002FA2, better if it's in person. Thanks in advance! :)",["Date","2022-09-19T12:35:50.000Z"],0.96,{"text":123,"timestamp":124,"topicId":5,"sentiment":6,"topicConfidence":104,"sentimentConfidence":7},"Hey expats! My small international Pilates group in Kadriorg has a few spots available. I teach in English (obviously) and I'm looking for people already somewhat familiar with Pilates as this is an intermediate group. We do matwork as well as work with the equipment. Every Thursday at 18:00 in Vilmsi 45a. If you have been missing the small barrel and magic circle, this place is for you 😉 I can also open a new beginners group, if there are enough people interested. The groups are small - maximum 5 in Kadriorg and maximum 3 in Tõnismägi. Privates and duo classes also possible in both locations.  Send me a PM, if interested. I'm a physiotherapist who got enthusiastic about the Pilates method in 2015 and haven't stopped learning since. My last full comprehensive teacher training was this summer in the wonderful Pi Pilates studio in London.",["Date","2022-09-19T10:15:41.000Z"],{"text":126,"timestamp":127,"topicId":5,"sentiment":12,"topicConfidence":26,"sentimentConfidence":55},"Any recommendations for Estonian language tutor one to one.  ?",["Date","2022-09-19T09:26:52.000Z"],{"text":129,"timestamp":130,"topicId":5,"sentiment":12,"topicConfidence":47,"sentimentConfidence":113},"Hey! Could you recommend an Estonian language tutor, who preferably teaches either in English or Russian? 🤓",["Date","2022-09-19T08:31:39.000Z"],{"text":132,"timestamp":133,"topicId":5,"sentiment":6,"topicConfidence":22,"sentimentConfidence":117},"Hello,  I am looking for a French language tutor 😎 If you have been teaching French before or would be interested please let me know :)",["Date","2022-09-19T07:34:19.000Z"],{"text":135,"timestamp":136,"topicId":5,"sentiment":12,"topicConfidence":105,"sentimentConfidence":137},"Hello kind friends of expats. Can you help a mama out with the Estonian homework again? We need to find words from T_B_ We need to fill in the blank with vowels. We have TUBA, TIBU, and need another one 😜😜😜😅 Any ideas?  Thanks Edit: sorry my son had found TIBU not TIBI 😆😆😆",["Date","2022-09-18T16:02:37.000Z"],0.54,{"text":139,"timestamp":140,"topicId":5,"sentiment":6,"topicConfidence":141,"sentimentConfidence":142},"My previous attempt to find an Estonian teacher at the time slot I wanted, went really well. Urmela Kr is a great teacher and now I need someone who just started learning to practise my broken Estonian. This will be an unpaid job because both of us are going to benefit. No monies please 😉 Let me know if you want to try your broken Estonian on me! I am going to make your life very difficult 😅😂 Eesti Keel on väga raske, aga Ilus 😊😎",["Date","2022-09-18T14:45:13.000Z"],0.87,0.71,{"text":144,"timestamp":145,"topicId":5,"sentiment":12,"topicConfidence":105,"sentimentConfidence":92},"Hi people! Anybody knows an english speaking speech therapist for a 4yo kid in TLL?",["Date","2022-09-18T14:38:44.000Z"],{"text":147,"timestamp":148,"topicId":5,"sentiment":6,"topicConfidence":26,"sentimentConfidence":79},"Hello to all Teachers Education Academy #cooperates with many institutions from Europe, including Estonia. We want to expand our network of educational institutions with which we cooperate in Estonia. I would appreciate if the administrators of educational institutions at all levels who want to cooperate together in the field of education contact me. Kind regards #teachers #education #expand #network #europe #levels #administrators # #educational #estonia #headteachers #director",["Date","2022-09-16T06:43:59.000Z"],{"text":150,"timestamp":151,"topicId":5,"sentiment":12,"topicConfidence":105,"sentimentConfidence":109},"Hi, I’m looking for “ Understanding and Using English Grammar, SB - Betty S. Azar “ book.  Do you know where can I find it in Tallinn? Thank you in advance",["Date","2022-09-15T08:21:33.000Z"],{"text":153,"timestamp":154,"topicId":5,"sentiment":6,"topicConfidence":155,"sentimentConfidence":104},"Hey guys,  Could you give me recommendations regarding good therapist in Estonia? Online sessions only. Thank you",["Date","2022-09-14T21:13:36.000Z"],0.63,{"text":157,"timestamp":158,"topicId":5,"sentiment":6,"topicConfidence":121,"sentimentConfidence":38},"Good morning! Any experienced Estonian language teachers available for private online lessons (for me, still a beginner🙄) on Monday mornings, please send me a pm. Also, if the rest of the group members can recommend a tutor that is not on this group, please comment. Thank you😊.",["Date","2022-09-12T07:38:31.000Z"],{"text":160,"timestamp":161,"topicId":5,"sentiment":12,"topicConfidence":26,"sentimentConfidence":109},"Hey, this has probably been asked a million times here, but I'd like to improve my Estonian speaking skills. Is anyone aware of a group or a club, where I could practice in a group? Native or non-native, it really doesn't matter. I already have an Estonian teacher, so I'm not really looking for one-to-one lessons or formal classes for that matter.",["Date","2022-09-12T07:21:35.000Z"],{"text":163,"timestamp":164,"topicId":5,"sentiment":6,"topicConfidence":165,"sentimentConfidence":42},"Can anyone recommend an Estonian teacher who also works with Töötukassa? Thanks for ay recs!",["Date","2022-09-11T19:02:42.000Z"],0.97,{"text":167,"timestamp":168,"topicId":5,"sentiment":6,"topicConfidence":117,"sentimentConfidence":55},"Hi there! If any expats, remote workers or anyone else here are interested in improving their or learning Estonian, Russian or another language then you can do so with us at WebTeachers. We are a language, content creation and social media management service provider company from Riga, Latvia and also offer our clients free online language lessons as cooperation benefits. The lessons are with experienced teachers and can be taken at your most preferred times. If you are interested to try then let us know on: info@webteachers.eu May you have a good rest of the week.",["Date","2022-09-08T10:50:12.000Z"],{"text":170,"timestamp":171,"topicId":5,"sentiment":172,"topicConfidence":42,"sentimentConfidence":173},"Hey!  Is there any Language Courses available for people who don't have the e-ID? All the courses I see that take applications require some form of ID. Essentially, people on D-Visa's can't enter into language education?  Or is there something I am missing. I'd like to study part time but it looks like the only way is to self study with free resources which doesn't seem as effective. Thank you!",["Date","2022-09-07T11:40:51.000Z"],"Negative",0.44,{"text":175,"timestamp":176,"topicId":5,"sentiment":6,"topicConfidence":38,"sentimentConfidence":51},"Hi there! If any expats or anyone else here are interested in improving or learning Estonian, Russian or another language then you can do so with us at WebTeachers. We are a language, content creation and social media management service provider company from Riga, Latvia and provide online language lessons with experienced teachers that can be taken at your most suitable times. Free online language lessons are also our cooperation benefits. If you are interested to try then let us know on: info@webteachers.eu May you have a good week.",["Date","2022-09-05T20:50:43.000Z"],{"text":178,"timestamp":179,"topicId":5,"sentiment":6,"topicConfidence":26,"sentimentConfidence":180},"We are looking for a tutor to begin ASAP a few hours a week for our daughter, mostly to help her with her high school geometry (but maybe a little bit with her other classes as needed). If you’re interested, please send me a private message! Thank you!",["Date","2022-09-02T12:09:47.000Z"],0.79,{"text":182,"timestamp":183,"topicId":5,"sentiment":6,"topicConfidence":26,"sentimentConfidence":43},"The University of Tartu has just put out an Android app to help us learn\u002Fimprove Estonian pronunciation!",["Date","2022-08-31T10:18:42.000Z"],{"text":185,"timestamp":186,"topicId":5,"sentiment":6,"topicConfidence":42,"sentimentConfidence":141},"Hi everyone,  a friend of mine is having problems with her laptop can anyone recommend a place to have it looked at? She just moved here to study so money is a bit tight right now, somewhere cheap and cheerful would be great! She's from Ukraine and speaks perfect English. Thanks for your time :)",["Date","2022-08-30T05:34:19.000Z"],{"text":188,"timestamp":189,"topicId":5,"sentiment":6,"topicConfidence":14,"sentimentConfidence":42},"Hello everyone! My husband is a certified teacher of English as a Second Language with 20 years' experience. He offers lessons in all levels and all ages, from 3 year olds to 80 year olds. He can teach Business English, and Test Courses such as IELTS, CAE, PET and others. He charges 15 Eur per 45 mins \u002F academic hour. Each block should be 90 mins, 2 or 3 times per week. If it's only once a week then the price is 20 Eur per academic hour. He also has ample experience teaching Spanish to foreigners, from True beginners to Advanced conversational Spanish Lessons of Spanish are 20 Eur per academic hour. Any amount of times per week.",["Date","2022-08-28T08:23:12.000Z"],{"text":191,"timestamp":192,"topicId":5,"sentiment":12,"topicConfidence":165,"sentimentConfidence":34},"Where can I get free Estonian lessons",["Date","2022-08-23T18:33:20.000Z"],{"text":194,"timestamp":195,"topicId":5,"sentiment":6,"topicConfidence":26,"sentimentConfidence":100},"I think the easiest way to learn a new language is either by getting yourself a girlfriend\u002F boyfriend or learn from watching movies 😁 Since I can't get a new girlfriend now because my wife Chris Smile will kill me 😂 So I would like to ask for good movies or even cartoons in Estonian language, any recommendations? Aitäh 🙌🤗",["Date","2022-08-23T17:09:02.000Z"],{"text":197,"timestamp":198,"topicId":5,"sentiment":6,"topicConfidence":26,"sentimentConfidence":33},"Hi Everyone, I'm a Belgian flight instructor, working at Nordic Aviation Academy in Tallinn. If you ever dreamed of becoming a pilot, and fly for fun or pursue a carreer in aviation, then this might be your chance to turn your dreams into reality. If you would be interested in our PPL (private pilot) course, then come to our open days on Thursday . The theoretical lessons are given in English, Estonian or Russian, and our instructor team speaks several languages, so everyone is welcome. Sebastien",["Date","2022-08-23T05:28:17.000Z"],{"text":200,"timestamp":201,"topicId":5,"sentiment":12,"topicConfidence":26,"sentimentConfidence":7},"Hi guys, I'm looking for a private Estonian Language teacher to prepare for A1.  Any ideas? Thx",["Date","2022-08-20T10:09:06.000Z"],{"text":203,"timestamp":204,"topicId":5,"sentiment":12,"topicConfidence":33,"sentimentConfidence":205},"Does anyone have recommendations for Estonian language classes? I’d prefer a group setting, and I cannot do most weeknights so morning or weekends would be best. Anybody heard of anything like that?",["Date","2022-08-20T08:08:34.000Z"],0.61,{"text":207,"timestamp":208,"topicId":5,"sentiment":6,"topicConfidence":26,"sentimentConfidence":92},"Hello everyone! My name is Ariel, and I will be going to Estonia next year. If anyone is interested to have Online english lessons, please feel free to send me a message! I teach both kids and adults. Thank you! 😄",["Date","2022-08-19T08:20:16.000Z"],{"text":210,"timestamp":211,"topicId":5,"sentiment":6,"topicConfidence":26,"sentimentConfidence":55},"Hello guys! Could you please recommend me full-time Estonian Language courses? Preferably not online, huge thanks in advance :)",["Date","2022-08-18T11:29:44.000Z"],{"text":213,"timestamp":214,"topicId":5,"sentiment":6,"topicConfidence":42,"sentimentConfidence":215},"Hola! I'm a certified and native Spanish teacher with 4 years of experience teaching Spanish online and face-to-face. During the last years I've helped more than a 100 students reach their goals in a matter of months. I've given Spanish tutoring to professionals that need to reach certain level of Spanish for work, high school students, people that want to improve their communication with their loved ones and, those that just enjoy learning a new language. Why learning a language with the support of a  certified tutor when I can just do Duolingo for free? Firstly, Duolingo and other language apps are GREAT and I'm all in when it comes to using technology to support learning.  However, it is… More",["Date","2022-08-14T10:30:54.000Z"],0.95,{"text":217,"timestamp":218,"topicId":5,"sentiment":6,"topicConfidence":219,"sentimentConfidence":63},"For those learning Russian. It's hard to do on your own, come to see others doing the same :)",["Date","2022-08-12T11:10:34.000Z"],0.73,{"text":221,"timestamp":222,"topicId":5,"sentiment":6,"topicConfidence":26,"sentimentConfidence":223},"Hey Legends! ❤️ If you are learning Estonian or use the SPEAKLY app. You can use code EV100 on the 12 MONTH plan to get it for FREE. Not sure if it works for other languages but I know it works for Estonian. Edit: The code might be out of uses at this stage.",["Date","2022-08-10T17:19:34.000Z"],0.82,{"text":225,"timestamp":226,"topicId":5,"sentiment":6,"topicConfidence":142,"sentimentConfidence":34},"Hello 😊 I am a french speaking girl in Tallinn and I would like to give some french classes or lessons next to my job. If you are interested let me know :))",["Date","2022-08-09T18:22:37.000Z"],{"text":228,"timestamp":229,"topicId":5,"sentiment":6,"topicConfidence":34,"sentimentConfidence":230},"I’m looking for English-speaking tutors for my middle school and high school age kids. Math especially, also French. Any ideas where to look? Thanks 🙏",["Date","2022-08-09T10:34:31.000Z"],0.51,{"text":232,"timestamp":233,"topicId":5,"sentiment":12,"topicConfidence":104,"sentimentConfidence":223},"Dear all,  the European School is looking for a new French speaking, primary class teacher for the upcoming school year. You'll find more details and can eventually apply here: https:\u002F\u002Fwww.facebook.com\u002F129210050596963\u002Fposts\u002F2033025150215434\u002F?sfnsn=mo",["Date","2022-08-08T17:47:39.000Z"],{"text":235,"timestamp":236,"topicId":5,"sentiment":12,"topicConfidence":26,"sentimentConfidence":137},"I need friends with whome I can speak and practice  my Estonian language for fast learning.  Any groups or places where it wll be possible . Need suggestions plyz.",["Date","2022-08-02T22:14:42.000Z"],{"text":238,"timestamp":239,"topicId":5,"sentiment":6,"topicConfidence":26,"sentimentConfidence":180},"Hello! Tere! Want to learn Estonian? Are you an English speaker who wishes to get some basic Estonian language lessons (A1) and conversational practice? I have a solution. I am an experienced teacher with my own method that gets you started with no pressure and with a good feeling. One-on-one lessons via Skype, with a vocabulary tailor-made for you. Some slots still available in August and later. Booking on a first come, first served basis. PM for more info.",["Date","2022-07-27T06:54:05.000Z"],{"text":241,"timestamp":242,"topicId":5,"sentiment":6,"topicConfidence":215,"sentimentConfidence":59},"Hi all, quick question for those learning Estonian language (A2). Have you been to any “language cafe”? Do you think it has helped somehow? I’ve been thinking about going, but my anxiety kicks in all the time…  Thanks :)",["Date","2022-07-23T16:05:14.000Z"],{"text":244,"timestamp":245,"topicId":5,"sentiment":12,"topicConfidence":215,"sentimentConfidence":109},"Hi all. I'm an English language teacher from Ireland. I'm celta qualified with 7 years experience. I'm considering moving to Estonia. Could I get some advice?: How much should I expect to earn from a full-time contract? What are the best employers to work for? (Preferably teaching adults) Are there agents who can help me find a job? Do employers tend to provide accommodation? Thanks in advance 😊",["Date","2022-07-16T23:06:13.000Z"],{"text":247,"timestamp":248,"topicId":5,"sentiment":12,"topicConfidence":51,"sentimentConfidence":249},"Hello everyone! Does anyone know a good conversational Russian language class or a private tutor? (A2 level) PS: I don't need any advice or political commentary please.",["Date","2022-07-16T05:31:50.000Z"],0.64,{"text":251,"timestamp":252,"topicId":5,"sentiment":12,"topicConfidence":43,"sentimentConfidence":79},"Hi there, I'll be in Estonia for approx. A month and looking for a russian tutor either one to one or in a group. Please get in touch if you know anyone or can recommend a school? Thanks Natalia",["Date","2022-07-13T15:08:43.000Z"],{"text":254,"timestamp":255,"topicId":5,"sentiment":12,"topicConfidence":26,"sentimentConfidence":142},"Hello all .  For those who’ve been in Estonia for a while, could you please recommend a place and institute near Kalamaja to take proper in-person Estonia language classes ?  🙏 🙏 🙏",["Date","2022-07-03T07:27:35.000Z"],{"text":257,"timestamp":258,"topicId":5,"sentiment":6,"topicConfidence":75,"sentimentConfidence":259},"In case someone is interested! 😊 \"Estonian Studies is a unique MA programme, teaching Estonian language, culture, history, societal and political topics using English.\"",["Date","2022-06-29T09:28:05.000Z"],0.85,{"text":261,"timestamp":262,"topicId":5,"sentiment":12,"topicConfidence":47,"sentimentConfidence":263},"International School of Tallinn is looking for new colleagues.  Join our team as a French language teacher (all grades) or a Primary Classroom teacher, starting on August 2022.",["Date","2022-06-20T10:08:02.000Z"],0.68,{"text":265,"timestamp":266,"topicId":5,"sentiment":12,"topicConfidence":26,"sentimentConfidence":75},"What's your Estonian language level? https:\u002F\u002Fen.m.wikipedia.org\u002Fwiki\u002FCommon_European_Framework_of_Reference_for_Languages",["Date","2022-06-16T21:06:11.000Z"],{"text":268,"timestamp":269,"topicId":5,"sentiment":12,"topicConfidence":26,"sentimentConfidence":270},"Hi! Dear friends, maybe somebody gives Estonian language lessons online?",["Date","2022-06-14T21:32:52.000Z"],0.75,{"text":272,"timestamp":273,"topicId":5,"sentiment":6,"topicConfidence":26,"sentimentConfidence":8},"Hi! I'm looking for an Estonian tutor for a 6year old boy. Any recommendation would higly appreciated.",["Date","2022-06-11T08:15:20.000Z"],{"text":275,"timestamp":276,"topicId":5,"sentiment":12,"topicConfidence":26,"sentimentConfidence":277},"Dear All, I'm looking for support people to work with students on one-o-one. If you have experience or training in Special Education, or tutor or support person, please contact me. Best Regards",["Date","2022-06-01T07:26:54.000Z"],0.65,{"text":279,"timestamp":280,"topicId":5,"sentiment":12,"topicConfidence":26,"sentimentConfidence":71},"Tere everyone! I was wondering where a person could advertise their language teaching skills here in Estonia for more niche languages? I have taught Latin and Ancient Greek in the U.S. While I don’t think there would be a big demand here, I would still be curious to see if there is any at all. Thanks for any help.",["Date","2022-05-27T12:52:44.000Z"],{"text":282,"timestamp":283,"topicId":5,"sentiment":6,"topicConfidence":79,"sentimentConfidence":104},"Looking for an Estonian teacher. Any recommendations? Thank you",["Date","2022-05-26T14:03:07.000Z"],{"text":285,"timestamp":286,"topicId":5,"sentiment":12,"topicConfidence":26,"sentimentConfidence":137},"Tere! I am moving to Estonia in a week and was wondering if anyone had any recommendations for a language teacher? I’ve been doing the Drops vocabulary every day for 5 months, but it doesn’t really teach things like sentences. Thank you for any suggestions!",["Date","2022-05-24T07:21:38.000Z"],{"text":288,"timestamp":289,"topicId":5,"sentiment":6,"topicConfidence":91,"sentimentConfidence":92},"Good morning, Quick question: How many of you have learned Estonian on the base of English? We would like to know, if it is possible to create evening group in september (A1, A2, B1) We are partners of Eesti Töötukassa. Thank you :)",["Date","2022-05-19T08:01:11.000Z"],{"text":291,"timestamp":292,"topicId":5,"sentiment":6,"topicConfidence":249,"sentimentConfidence":43},"Hello.   You are welcome to Pilates training at Kadri Heinloo Pilates Stuudio. I'm a comprehensive teacher of Pilates techniques and have been working in Pilates techniques since 2006. The Studio uses Pilates machines and small equipment. To achieve the best results, we train in the Studio in private lessons and duo lessons. The price of a private lesson is 50 EUR and duo class is 25 EUR per person.  Studio is situated near beach of Pirita and nice forest area just 20 minutes from the center of Tallinn. You can before or after Pilates class enjoy the walk at the beach or take time for a little run in the forest. I teach classes in Estonian, English and French. I also speak Russian and Finnish. If you are interested in Pilates training, please contact Kadri Heinloo Pilates Stuudio FB website or at kadri.heinloo@mail.ee",["Date","2022-05-18T20:18:10.000Z"],{"text":294,"timestamp":295,"topicId":5,"sentiment":6,"topicConfidence":51,"sentimentConfidence":215},"Hey hey beautiful people, I am currently looking for a affordable language school for learning Estonian 😉. Does anyone have recommendation? I want to do intensive B1 level! Thanks in advance. 😍",["Date","2022-05-16T19:07:11.000Z"],{"text":297,"timestamp":298,"topicId":5,"sentiment":6,"topicConfidence":165,"sentimentConfidence":117},"Please suggest a good app to self learn Estonian 🇪🇪",["Date","2022-05-15T05:58:17.000Z"],{"text":300,"timestamp":301,"topicId":5,"sentiment":6,"topicConfidence":26,"sentimentConfidence":42},"Dear fellow expats, I am looking for a junior mathematician who can work part-time remotely. Preferably with some knowledge in programming. Please PM me if interested. Thanks!",["Date","2022-05-08T03:17:53.000Z"],{"text":303,"timestamp":304,"topicId":5,"sentiment":172,"topicConfidence":142,"sentimentConfidence":59},"I saw a nice tongue twister for those who like to learn estonian language. 😃 “Extremely big amount of shit was carried to extremely inappropriate place.” In estonian: “Sittakanti sitta kanti sitta kanti.”",["Date","2022-05-07T18:07:05.000Z"],{"text":306,"timestamp":307,"topicId":5,"sentiment":12,"topicConfidence":215,"sentimentConfidence":117},"I would like to hear some of your experiences. If a foreign kid (grade 1) goes to public school, the school offers extra Estonian class for the kid. Is that enough for the kid? Or they need private tutoring? How long (in average) does it takes for the kid to be able to catch the language? without private tutoring.",["Date","2022-05-05T12:21:28.000Z"],{"text":309,"timestamp":310,"topicId":5,"sentiment":12,"topicConfidence":47,"sentimentConfidence":142},"Hello everyone ! I am looking for Estonian language study group, A1-A2 level.  I have some prior knowledge, but still need more practice.",["Date","2022-05-04T12:56:40.000Z"],{"text":312,"timestamp":313,"topicId":5,"sentiment":6,"topicConfidence":26,"sentimentConfidence":215},"Anyone who wants to practise or improve your English level, you are welcome to visit my English classes🇬🇧. I am an experienced English tutor and have a proper qualification🎓. Teach online or offline (Kristiine district). Work with children and adults. 10 euros per class. I will be happy to see you among my students ❤️",["Date","2022-04-26T09:32:13.000Z"],{"text":315,"timestamp":316,"topicId":5,"sentiment":12,"topicConfidence":259,"sentimentConfidence":270},"https:\u002F\u002Fvm.tiktok.com\u002FZMLq3Annk\u002F We are launching our online international high school curriculum and qualifications. Come to our webinar on Saturday 10am GMT to find out more:  Register here for the webinar link: https:\u002F\u002Fivlv.me\u002FyBFyI",["Date","2022-04-19T17:56:51.000Z"],{"text":318,"timestamp":319,"topicId":5,"sentiment":12,"topicConfidence":215,"sentimentConfidence":263},"We are launching our online international high school curriculum and qualifications. Come to our webinar on Saturday 10am GMT to find out more:  Register here for the webinar link: https:\u002F\u002Fivlv.me\u002FyBFyI",["Date","2022-04-18T19:32:24.000Z"],{"text":321,"timestamp":322,"topicId":5,"sentiment":6,"topicConfidence":51,"sentimentConfidence":91},"Any TEFL teachers around? Would have few questions☺️Have a great Monday everyone!",["Date","2022-04-18T10:12:47.000Z"],{"text":324,"timestamp":325,"topicId":5,"sentiment":12,"topicConfidence":92,"sentimentConfidence":59},"Hi, my name is Johanna Charlotte Jeltsch. I graduated from high school last year and am now providing extra tuition for pre-college students. My focus is on mathematics and natural sciences, but I won‘t rule out anything else in advance. I am fluent in English, German and Estonian and am willing to teach in any of those languages. If you are interested or want further details, please contact me under johanna@jeltsch.info or send me a PM.",["Date","2022-04-11T12:12:50.000Z"],{"text":327,"timestamp":328,"topicId":5,"sentiment":6,"topicConfidence":26,"sentimentConfidence":277},"Some useful links for studying Estonian for beginners to any level",["Date","2022-04-11T08:44:39.000Z"],{"text":330,"timestamp":331,"topicId":5,"sentiment":6,"topicConfidence":259,"sentimentConfidence":259},"Hey 👋 lovely spring outside 🥶 anyone knows where can I study Arabic in Estonia…tried few language centers but nothing active there😞 Thank you in advance!",["Date","2022-04-06T12:44:10.000Z"],{"text":333,"timestamp":334,"topicId":5,"sentiment":6,"topicConfidence":141,"sentimentConfidence":270},"This is, hands down, the best and most dedicated Estonian language teacher in Tallinn. I have studied with her from level 0 to now preparing for the B-2 exam. Feel free to contact me with any questions. And let me know if you have also studied with her!:      :: EESTI KEEL A1 KRISTELIGA ::      :          Esmaspäev ja kolmapäev            Понедельник и среда                    16.00-17.30          Aeg:   28.03-6.07.22       ::Время     Klassis:      60 tundi            ::В классе Kodutöö:      40 tundi            ::Домашки  Õpetaja:   Kristel Toomel      ::Учитель        Kool:     KeeleLabor        ::Школа       Koht:   Laki 11b, Tallinn   ::Место KeeleLabor партнёр Кассы по безработицы. KeeleLabor on Eesti Töötukassa koolituskaardi koostööpartner https:\u002F\u002Fwww.tootukassa.ee\u002Fet\u002Fkoolitused\u002F247289ЮЮ Tel: 5538599 E-post: info@keelelabor.ee: :: ESTONIAN LANGUAGE WITH A1 KRISTEL :: : Monday and Wednesday Monday and Wednesday                    16.00-17.30  Aeg: 28.03-6.07.22 :: Time In class: 60 hours ::In class Homework: 40 hours :: Homework Teacher: Kristel Toomel :: petaител ja Kool : KeeleLabor :: School Location: Laki 11b, Tallinn :: City KeeleLabor is a partner of the unemployment fund. KeeleLabor is a partner of the Estonian Unemployment Fund training card https:\u002F\u002Fwww.tootukassa.ee\u002Fet\u002Fkoolitused\u002F247289ЮЮ Tel: 5538599 E-post: info@keelelabor.ee",["Date","2022-03-27T11:34:14.000Z"],{"text":336,"timestamp":337,"topicId":5,"sentiment":6,"topicConfidence":91,"sentimentConfidence":75},"Dear expats,  If you know a Ukrainian 🇺🇦 in need of some small extra income, who would be interested in giving private classes of Ukrainian language - let me know! Preferably someone with teaching experience. Thanks a lot!",["Date","2022-03-26T18:00:43.000Z"],{"text":339,"timestamp":340,"topicId":5,"sentiment":12,"topicConfidence":259,"sentimentConfidence":38},"🇪🇪📢 I'm looking for professional translators, teachers or people with advanced knowledge of Estonian language to teach estonian language to english speakers after working hours. Please comment on this post if you are interested in knowing more information or send a private message.",["Date","2022-03-22T20:51:51.000Z"],{"text":342,"timestamp":343,"topicId":5,"sentiment":6,"topicConfidence":141,"sentimentConfidence":344},"Our colleagues at Imagine OIE are launching their  online international high school curriculum and qualifications. Come to the webinar to find out more:  https:\u002F\u002Fivlv.me\u002FyBFyI",["Date","2022-03-22T05:06:16.000Z"],0.58,{"text":346,"timestamp":347,"topicId":5,"sentiment":6,"topicConfidence":26,"sentimentConfidence":348},"Hi, everyone. Are there any free (or not pricey) online courses for teens to start learning Estonian? They are 10 and 14, speak ukrainian, russian and little english. Thanks in advance",["Date","2022-03-19T13:20:12.000Z"],0.57,{"text":350,"timestamp":351,"topicId":5,"sentiment":12,"topicConfidence":26,"sentimentConfidence":141},"Репетитор по математике онлайн.  Предлагаю свои услуги по подготовке к экзаменам (ОГЭ, ЕГЭ, ВПР), контрольным, тестам до высшего балла, домашним заданиям, повышаю уровень знаний. Закрываю любые пробелы. Занимаюсь с учениками любого уровня подготовки, с 1 по 11 классы. Знаком со всеми школьными программами. Преподаю математику в режиме онлайн уже 2 года. Готовлю к сдаче экзаменов в ВУЗы, даю правильный психологический настрой перед тестами, контрольными, экзаменами. Также, провожу пробное занятие.  По всем вопросам пишите в личные сообщения.maths tutor on line. I offer my services in preparation for exams (GE, EXAM, VPR), controls, high score tests, homework, improving the level of knowledge. Fill in any gaps n the spaces. I work with students of any level of preparation, from grades 1 to 11. Familiar with all the school programs. I have been teaching math online for 2 years. Preparing for taking exams in universities, giving the right psychological attitude before tests, tests, exams. Also, running a trial class. For all questions, write in private messages.",["Date","2022-03-18T08:34:41.000Z"],{"text":353,"timestamp":354,"topicId":5,"sentiment":12,"topicConfidence":259,"sentimentConfidence":100},"Any german language learning active online platform in Tallinn? Please be kind to inform.",["Date","2022-03-15T09:30:35.000Z"],{"text":356,"timestamp":357,"topicId":5,"sentiment":12,"topicConfidence":263,"sentimentConfidence":358},"What’s your Mother thongue? And how many people speak it in the whole World?  Estonia celebrates its native language day today or Emakeelepäev as we say. Under 1 million people in the whole wide world speak Estonian. Estonian language is strongly influenced by German, but in its closest to Finnish and Hungarian languages (Finno-Ugric language). Estonian is also considered to be one of the hardest languages to learn due to its 14 noun cases. First Estonian language book was printed in 1535 an it was Wanradt-Kiel Catechism.",["Date","2022-03-14T09:10:16.000Z"],0.56,{"text":360,"timestamp":361,"topicId":5,"sentiment":6,"topicConfidence":26,"sentimentConfidence":263},"Hi I am writing on behalf of the Teachers Education Academy(Tallinn), which organizes international teacher professional development courses. I would like to cooperate with associations, NGOs, all public or private institutions and organizations operating in the field of education. I am waiting for those who are interested to send their introductory messages to the e-mail address below. eduteacher2021@gmail.com",["Date","2022-03-13T14:17:17.000Z"],{"text":363,"timestamp":364,"topicId":5,"sentiment":6,"topicConfidence":104,"sentimentConfidence":34},"Tere päevast! 👋🏼 Täna on naistepäev! Head naistepäeva Eesti naised! 🥰😘 (You guessed it; I had an Estonian language class today. Gotta show off! 🤦🏼‍♀️🤣😜)",["Date","2022-03-08T10:29:34.000Z"],{"text":366,"timestamp":367,"topicId":5,"sentiment":6,"topicConfidence":26,"sentimentConfidence":75},"Hey everyone ! Hola! 🇪🇸 My name is Olga and I’m from Ukraine but I had been living in Spain for 5 years. I’m a Spanish teacher and I’m completely new to Tallinn. For the last 3 years I’ve been teaching Spanish online. Learning online is super comfortable but didn’t we have ENOUGH OF ONLINE LIFE for the las 2 years ? It’s time to socialise more! let’s make new friends learning a new language!🤝 I want to offer Spanish classes in the group of 4-6 people. I have a lot of experience teaching people from all over the world. The quality for me is the most important thing so no matter how many people there will be, I’ll have different groups depending on your mother tongue. - Spanish will be your… More",["Date","2022-03-07T13:06:25.000Z"],{"text":369,"timestamp":370,"topicId":5,"sentiment":6,"topicConfidence":141,"sentimentConfidence":34},"Is there any YouTubers in this group? I just started my channel for teaching Chinese. Please have a look if you are interested, also,  feel free to share with your friends who want to or are learning Chinese. And I would love to get to know other Youtubers based in Tallinn as well.",["Date","2022-03-07T12:19:38.000Z"],{"text":372,"timestamp":373,"topicId":5,"sentiment":12,"topicConfidence":223,"sentimentConfidence":223},"In between the war news, life goes on and kids go to school. Looking for a German tutor for a teenager, a couple times a week, for online lessons. PM if interested.",["Date","2022-03-06T10:12:05.000Z"],{"text":375,"timestamp":376,"topicId":5,"sentiment":12,"topicConfidence":26,"sentimentConfidence":34},"Any schools\u002Fprivate clients looking for English teachers? (Or any tips on how to use TEFL here!)",["Date","2022-03-04T21:21:59.000Z"],{"text":378,"timestamp":379,"topicId":5,"sentiment":12,"topicConfidence":42,"sentimentConfidence":55},"Hi, guys. Does anyone know whether there is an Estonian studybook to practice Estonian that is organised in a way similar to Ryamond Murphy's book: grammar is explained on the left page and exercises - on the right?",["Date","2022-03-02T15:47:31.000Z"],{"text":381,"timestamp":382,"topicId":5,"sentiment":12,"topicConfidence":100,"sentimentConfidence":55},"Hi, guys. Does anyone know whether there is an Estonian studybook to practice Estonian that is organised in a way similar to Ryamond Murphy's book: grammar is explained on the left page and exercises are on the right?",["Date","2022-03-02T15:45:26.000Z"],{"text":384,"timestamp":385,"topicId":5,"sentiment":6,"topicConfidence":92,"sentimentConfidence":51},"Hello, everyone! Looking for English language mentor for improving my knowledges from B1 to C level in a maximum short period of time. Thank you!",["Date","2022-02-28T18:50:25.000Z"],{"text":387,"timestamp":388,"topicId":5,"sentiment":6,"topicConfidence":389,"sentimentConfidence":142},"Hi, expats!  Totally not about the war or corona - I know, boring, right! 😉 I have a few spots available in a Pilates class, that is taught in English.  Time: Wednesdays at 20:00 Location: Tõnismägi 3a, Tallinn Group: A small group of max 5 people, level suitable for those who have practiced Pilates before. Message me, if this is exactly what you've been looking for! Also message me, if you have been looking for an awesome Pilates instructor\u002Fphysiotherapist for private classes.",["Date","2022-02-27T19:54:58.000Z"],0.69,{"text":391,"timestamp":392,"topicId":5,"sentiment":12,"topicConfidence":26,"sentimentConfidence":59},"Anyone looking for Estonian language tutor? Here to help you on your journey and get your conversations going!  https:\u002F\u002Fm.facebook.com\u002FEstoniantutoringwithKris\u002F",["Date","2022-02-23T09:09:09.000Z"],{"text":394,"timestamp":395,"topicId":5,"sentiment":12,"topicConfidence":26,"sentimentConfidence":219},"Hello,  I am looking for a school or preferably a repetitor that can teach me the Estonian language and prepare me for state language exams. Do you have any suggestions for me ? Thanks in advance",["Date","2022-02-21T18:54:12.000Z"],{"text":397,"timestamp":398,"topicId":5,"sentiment":12,"topicConfidence":26,"sentimentConfidence":55},"Morning, folks! Does anyone have experience with Estonian language course from Vasilyev's school  (https:\u002F\u002Fvikool.ee\u002Feesti-pamjat-b1)? Would you recommend it?",["Date","2022-02-21T07:41:08.000Z"],{"text":400,"timestamp":401,"topicId":5,"sentiment":6,"topicConfidence":26,"sentimentConfidence":63},"As a company,(www.teacherseducationacademy.com) we want to cooperate with local training centers that provide digital skills training for adults. Interested can send a private message.",["Date","2022-02-19T19:06:52.000Z"],{"text":403,"timestamp":404,"topicId":5,"sentiment":12,"topicConfidence":205,"sentimentConfidence":137},"People! Any English speaker expert in marriage counseling that you can recommend? Please help! 😃",["Date","2022-02-18T08:35:50.000Z"],{"text":406,"timestamp":407,"topicId":5,"sentiment":12,"topicConfidence":26,"sentimentConfidence":67},"Hi all, can anyone recommend any Estonian language teachers? I'm looking to find a teacher who is able to come to my apartment in Kassisaba for a weekly lesson on a week night for a small group (2-3) of Estonian beginners.  I know there are free classes available but we're looking for more focused time with a teacher in the small group environment.  Apologies if this is not the correct place to post this and thanks for any suggestions 😄",["Date","2022-02-18T06:47:29.000Z"],{"text":409,"timestamp":410,"topicId":5,"sentiment":6,"topicConfidence":26,"sentimentConfidence":230},"Hi,  my name is Johanna Charlotte Jeltsch. I graduated from high school last year and am now providing extra tuition for pre-college students.  My focus is on mathematics and natural sciences, but I won‘t rule out  anything else in advance. I am fluent in English, German and Estonian  and am willing to teach in any of those languages. If you are interested  or want further details, please contact me under johanna@jeltsch.info.",["Date","2022-02-17T12:12:07.000Z"],{"text":412,"timestamp":413,"topicId":5,"sentiment":12,"topicConfidence":26,"sentimentConfidence":270},"In search of a tutor. I am looking for a female tutor to help my girls with their distance learning. I’m looking for in person help from 4-10 hours per week.  We are in Kadriorg close to Sadama.  Must be fluent in English. Please pm me if interested.",["Date","2022-02-14T03:31:27.000Z"],{"text":415,"timestamp":416,"topicId":5,"sentiment":6,"topicConfidence":47,"sentimentConfidence":92},"Good evening everyone! Can anyone recommend me a good Estonian teacher, who can teach A1 level? If there is one thing I want to do, it's to learn the beautiful language 😃",["Date","2022-02-07T16:00:29.000Z"],{"text":418,"timestamp":419,"topicId":5,"sentiment":6,"topicConfidence":105,"sentimentConfidence":165},"Good morning!☀️ I have just made a group for everyone who loves the Estonian language and culture. In this group we talk about Estonia-related topics. Feel free to join!☺️",["Date","2022-02-07T07:47:53.000Z"],{"text":421,"timestamp":422,"topicId":5,"sentiment":6,"topicConfidence":26,"sentimentConfidence":215},"My new online Estonian for beginners course starts very soon. Welcome!🤗",["Date","2022-02-06T14:42:07.000Z"],{"text":424,"timestamp":425,"topicId":5,"sentiment":12,"topicConfidence":219,"sentimentConfidence":205},"Hi guys, do you have any references for good Esti learning resources? At least how to read the characters and basic conversations. Thanks",["Date","2022-02-05T11:01:12.000Z"],{"text":427,"timestamp":428,"topicId":5,"sentiment":6,"topicConfidence":26,"sentimentConfidence":249},"Good morning! Are there any expats with a teaching degree\u002Fcertificate and some time on their hands? I am looking for a tutor for my girls. They are in second grade and need one on one help.  Thanks in advance",["Date","2022-02-03T02:26:32.000Z"],{"text":430,"timestamp":431,"topicId":5,"sentiment":6,"topicConfidence":26,"sentimentConfidence":180},"Hi everyone 🙂   my name is Natalie, I am an English teacher, with more than 5 years of experience abroad 👩🏻‍🏫🇬🇧  🔸Study English with me to speak it better, prepare for an exam or for a job interview  🔸Big discounts 💰✅  🔸I issue a free certificate at the end of each course 📃🗞   All lessons are private, ONLINE on Skype 🗣   ✔️ all levels from Beginner to Advanced    ✔️ study materials are provided by me 📚 no need to buy anything  For further details please send me a private message 📩   I will answer to everyone 👍🏻 Thank you for your attention 🙂",["Date","2022-01-31T03:28:32.000Z"],{"text":433,"timestamp":434,"topicId":5,"sentiment":6,"topicConfidence":219,"sentimentConfidence":259},"Hello! Does anyone know people\u002Forganisations who provide Spanish language lessons with English as the medium of instruction? Would appreciate the info. Thank you 🙏",["Date","2022-01-27T04:38:21.000Z"],{"text":436,"timestamp":437,"topicId":5,"sentiment":12,"topicConfidence":165,"sentimentConfidence":14},"Hi lovely people! Have you ever tried to learn the Estonian language? What are\u002Fwere the main roadblocks? If you haven't yet, but thinking about doing so, how, what, and under what conditions exactly would you like to learn ideally? Any specific areas of interest?",["Date","2022-01-26T16:40:45.000Z"],{"text":439,"timestamp":440,"topicId":5,"sentiment":6,"topicConfidence":26,"sentimentConfidence":71},"Dear Expats, Looking for English-speaking Estonian Language Tutor recommendations for my 9-year-old daughter who started a public Estonian school. Although school is supportive in her language learning but we wanted someone who can help, guide & provide personalised language learning path to embrace her classes\u002Fschool. Please DM if you are a tutor or tag here in a comment if you want to recommend. Thanks in advance. PS: I have seen many times asked before in the group but wanted to post so I get the present tutor availability.",["Date","2022-01-23T10:32:43.000Z"],{"text":442,"timestamp":443,"topicId":5,"sentiment":12,"topicConfidence":117,"sentimentConfidence":344},"Hi all, what do you think about the Estonian mindset, regarding this diagram? :)",["Date","2022-01-19T07:41:18.000Z"],{"text":445,"timestamp":446,"topicId":5,"sentiment":12,"topicConfidence":109,"sentimentConfidence":14},"Hey guys, we just launched a Chinese course for beginners in City Language School. The classes will be taught at the center which located in  Tartu mnt 14 - 5, Tallinn. You can get more information from here https:\u002F\u002Fcity keeltekool.eu\u002F or  by calling 56 64 17 48 or info@citykeeltekool.ee",["Date","2022-01-14T20:40:05.000Z"],{"text":448,"timestamp":449,"topicId":5,"sentiment":6,"topicConfidence":121,"sentimentConfidence":33},"My online Estonian courses start next week.☺️ Tere tulemast! \u002F Welcome!🌟",["Date","2022-01-14T13:26:48.000Z"],{"text":451,"timestamp":452,"topicId":5,"sentiment":12,"topicConfidence":109,"sentimentConfidence":155},"International School of Tallinn is hiring a full-time Teacher of Human and Social Sciences.  Please feel free to apply or share.",["Date","2022-01-12T11:22:29.000Z"],{"text":454,"timestamp":455,"topicId":5,"sentiment":12,"topicConfidence":38,"sentimentConfidence":71},"Hello everybody.  On line french courses.  Teacher of french, specialist in methods of teaching French as a foreign language, 21 years of experience.  Offers.  French courses for adults and students in international schools.  For more details inbox me please. 😁",["Date","2022-01-11T06:55:19.000Z"],{"text":457,"timestamp":458,"topicId":5,"sentiment":12,"topicConfidence":26,"sentimentConfidence":14},"Hello, I am Marika and I teach #estonian. Levels: A1,A2,B1,B2.Lessons start 10 January. Please write me in private message  in case of interest  and we shall discuss all the details.",["Date","2022-01-09T09:40:25.000Z"],{"text":460,"timestamp":461,"topicId":5,"sentiment":12,"topicConfidence":42,"sentimentConfidence":34},"Would you like to try Padel?  Next beginners basic class on Tuesday the 11th of January. Open for registration now.",["Date","2022-01-07T14:32:30.000Z"],{"text":463,"timestamp":464,"topicId":5,"sentiment":6,"topicConfidence":38,"sentimentConfidence":51},"Hello Friends! My friends and I teach a free Russian Class every Thurday evening here in Tallinn. We are also learning Russian and thought it would be a good opportunity to practice and learn together. If you are interested in joining or have any questions message me!",["Date","2022-01-06T13:01:27.000Z"],{"text":466,"timestamp":467,"topicId":5,"sentiment":6,"topicConfidence":26,"sentimentConfidence":33},"Hi everyone. I have started learning Estonian using Speakly. It is a great app and I feel I am learning a lot. However, it involves a lot of guessing on my part about the mechanics of the language, so I would also like to have a student's book. Not an e-book or another app or google search. A good old fashioned book, with verb conjugations, pronouns, prepositions, rules etc., where I can see everything, highlight, keep notes etc. Have you used any such book that you can recommend? (I know there have been other posts about this, but I mostly see e-books and pdf, plus I would like the most up to date information on this). Thank you:).",["Date","2022-01-04T08:18:33.000Z"],{"text":469,"timestamp":470,"topicId":5,"sentiment":12,"topicConfidence":42,"sentimentConfidence":219},"International School of Tallinn (IST) is looking for a Teacher of Human and Social Sciences.  Please feel free to apply or share.",["Date","2022-01-03T08:29:26.000Z"],{"text":472,"timestamp":473,"topicId":5,"sentiment":12,"topicConfidence":26,"sentimentConfidence":38},"ESTONIAN LANGUAGE LESSONS for A1 and A2 level in group of 5-6 people from January in Tallinn Old Town office or join in Zoom. Send PM to join!",["Date","2022-01-01T21:52:57.000Z"],{"id":5,"label":475,"color":476},"language, teacher, tutor","#ff9da7",[478,481,484,487,489,492,494,496,498,500],[479,480],"language",120,[482,483],"teacher",100,[485,486],"tutor",80,[488,486],"learning",[490,491],"lesson",60,[493,491],"estonian",[495,491],"school",[497,491],"teach",[499,491],"pilate",[501,491],"teaching"],"uses":{"params":["topic_id"]}}]}
