{"type":"data","nodes":[null,{"type":"data","data":[{"posts":1,"topic":287,"representativeWords":290},[2,9,15,20,25,30,34,39,44,49,54,58,62,67,71,76,80,84,87,91,95,100,105,110,114,117,121,125,129,133,138,141,145,149,153,158,161,166,171,174,177,181,186,190,194,199,203,206,210,213,218,221,225,228,231,235,238,242,245,250,253,256,259,262,265,269,272,276,281,284],{"text":3,"timestamp":4,"topicId":5,"sentiment":6,"topicConfidence":7,"sentimentConfidence":8},"Hi guys I’d like to start English speaking fitness classes in Kristiine district and make a little marketing research. Workout classes are aimed: - mobility & flexibility - pain relief class (back, neck, shoulder, knee pain) The question is (if you’d be my potential client): 1) is it suitable for you to attend class at 10-11 am? 2) is it suitable to attend at 8-9 am? Actually what time is better in your opinion? 3) do you find Kristiine keskus area easy reachable for you? 4) is it ok for you if a fitness studio doesn’t have a shower?",["Date","2022-12-31T11:12:33.000Z"],17,"Neutral",0.39,0.77,{"text":10,"timestamp":11,"topicId":5,"sentiment":12,"topicConfidence":13,"sentimentConfidence":14},"Hi everybody! If you are interested in self-defense then Gracie Jiu-Jitsu Tallinn is the place to be! 🥋 All classes are in the English language as there are already many expats doing training! :D You can do a 10-day Free Trial to see if it is for you or rather not!?SUPER DEAL !!! 🥋 This offer will run until the end of January only!  Try 10 days FREE of charge before deciding...  www.sobukai-estonia.com",["Date","2022-12-27T16:03:53.000Z"],"Positive",0.16,0.84,{"text":16,"timestamp":17,"topicId":5,"sentiment":12,"topicConfidence":18,"sentimentConfidence":19},"Getting in a good shape is not a sprint but a marathon,  I would be more than happy to  hold your hand in this race. Contact me: Instagram: Omid_imany66",["Date","2022-12-19T09:57:20.000Z"],0.79,0.96,{"text":21,"timestamp":22,"topicId":5,"sentiment":6,"topicConfidence":23,"sentimentConfidence":24},"Hi! Any recommendations for gym and PT in Tallinn? Preferably around Kesklinn or Kristiine. Thanks!",["Date","2022-12-18T17:11:17.000Z"],0.26,0.5,{"text":26,"timestamp":27,"topicId":5,"sentiment":12,"topicConfidence":28,"sentimentConfidence":29},"I'm Omid and myfitness personal trainer. A one hour workout is 4% of your day.  If you want to say goodbye to your fat and have a good shape I would be more than happy help to you.🔥🔥 WhatsApp: +372 5784 4597 Instagram: Omid_Imany66",["Date","2022-12-07T10:36:11.000Z"],0.55,0.91,{"text":31,"timestamp":32,"topicId":5,"sentiment":6,"topicConfidence":13,"sentimentConfidence":33},"Hello,  To all those interested, I am selling a 24\u002F7 gym subscription that is valid until June \u002F2023. The contract is 20 euros per month and can be used at any 24\u002F7 fitness gym location in Tallinn. For more information, please contact me.",["Date","2022-12-03T18:14:59.000Z"],0.74,{"text":35,"timestamp":36,"topicId":5,"sentiment":12,"topicConfidence":37,"sentimentConfidence":38},"Hey! My name is Nora and i've just opened new oriental dance club in Tallinn💃  Come try bellydance with a fitness training on Sundays! Previous dancing skills NOT needed, just come enjoy the music and let your body learn some new moves🕺 The first lesson is for free and just for you to have some fun (come with friends) and try something different✨  Happy to answer any questions 💌 PM for details📨 Training is only for women❣️ More information about SharqîFit workouts: sharqifit.eu",["Date","2022-11-27T20:58:06.000Z"],0.29,0.93,{"text":40,"timestamp":41,"topicId":5,"sentiment":6,"topicConfidence":42,"sentimentConfidence":43},"Friends, has anyone taken a CrossFit group class at MyFitness, and if so, did you enjoy it? I want to resume my workouts after a long break, but all the CrossFit clubs are quite far away from me (practically in different parts of the city), the nearest thing is MyFitness Rävala.",["Date","2022-11-25T19:17:19.000Z"],0.47,0.61,{"text":45,"timestamp":46,"topicId":5,"sentiment":12,"topicConfidence":47,"sentimentConfidence":48},"Hello there!  If anyone need to see a fitness professional to get expertise on how to go about your fitness, I am here for you. ☺️ I help people to understand weight loss strategies, build sustainable and progressive fitness routines, finding suitable ways of eating and most importantly, I help people to improve postures, prevent or imporve injuries, and improve imbalances in the muscles suffering from daily movement patterns.  Currently I am able to give 30 min Free Fitness Consultations for those in need☺️ To apply for one all you need to do to fill the form so I can contact you 🙌🏻  Form: https:\u002F\u002Fwww.kristinamasionyte.com\u002Ffree-consultation-form If you want to get to know me before booking, I am daily apprearing on my IG @masionytek  Looking forwards to e-meet you☺️",["Date","2022-11-24T10:08:03.000Z"],1,0.87,{"text":50,"timestamp":51,"topicId":5,"sentiment":12,"topicConfidence":52,"sentimentConfidence":53},"At least the AI feedback loop must have learned something new :p",["Date","2022-11-04T21:58:29.000Z"],0.23,0.59,{"text":55,"timestamp":56,"topicId":5,"sentiment":6,"topicConfidence":57,"sentimentConfidence":38},"Hello everyone. Can anyone recommend me MMA school in Tallinn?",["Date","2022-10-24T10:37:35.000Z"],0.22,{"text":59,"timestamp":60,"topicId":5,"sentiment":6,"topicConfidence":61,"sentimentConfidence":43},"Hello! Anybody interested to join a muay thai group for training twice a week? We need to add 1 extra person to start. PM me if interested, thx!",["Date","2022-10-20T11:34:44.000Z"],0.27,{"text":63,"timestamp":64,"topicId":5,"sentiment":6,"topicConfidence":65,"sentimentConfidence":66},"Is here any reasonable gyms in Tallinn without membership condition.  I want to join for 15 days only . Plyz",["Date","2022-10-17T14:44:59.000Z"],0.15,0.8,{"text":68,"timestamp":69,"topicId":5,"sentiment":70,"topicConfidence":47,"sentimentConfidence":43},"Can I enter 24\u002F7 fitness 2x in one day?  Can’t find anything on their site but seem to have been told that once  Forgot something in the changing room",["Date","2022-10-16T19:46:55.000Z"],"Negative",{"text":72,"timestamp":73,"topicId":5,"sentiment":12,"topicConfidence":74,"sentimentConfidence":75},"Hello! I was wondering if anyone has any recommendations for a martial art school with english speaking class\u002Fgroup for beginners. Preferably for MMA or muay thai. Thank you all for your help!",["Date","2022-10-15T15:53:16.000Z"],0.25,0.85,{"text":77,"timestamp":78,"topicId":5,"sentiment":12,"topicConfidence":47,"sentimentConfidence":79},"Hello everyone,  my name is Doroty and I work as a personal trainer, rehabilitation trainer and a health coach with 6 years of experience. I am passionate about to make people getting in their best physical and mental shape or to help with their individual nutrion if they feel lost. If you need help with your health then check my website or send me a PM. 😊 www.eisendori.com",["Date","2022-10-14T18:44:39.000Z"],0.86,{"text":81,"timestamp":82,"topicId":5,"sentiment":12,"topicConfidence":47,"sentimentConfidence":83},"Find your better self💙!  The best cardio training is what you like 💪🥊 because you get the best result because you do it with love🍓❤️🤸‍♀️ Come to training and don't miss the opportunity to say \"Weak\" about yourself!!! 🙏  ✍️ 👍Personal training in a private gym 🤸‍♀️Bodyweight exercise 🏋️Weight training 🤸‍♀️Cardio 🦵TRX - training 🥊Boxing ❤️We will make the training fun for you ✍️Contact:messenger Personaaltreener Gea Talmre Whatsapp :+372 56453837",["Date","2022-10-05T20:25:24.000Z"],0.95,{"text":85,"timestamp":86,"topicId":5,"sentiment":12,"topicConfidence":74,"sentimentConfidence":38},"Hey everyone! Are there Women Boxing coaches and\u002For clubs here in Tallinn? Interested in level 0 (or -1 if that's possible )💪🤏👌😅 Would be grateful for recommendations and referrals!  Let's gain some strength coming our way! (my first winter here, 😱😶‍🌫️)",["Date","2022-10-05T09:56:46.000Z"],{"text":88,"timestamp":89,"topicId":5,"sentiment":12,"topicConfidence":90,"sentimentConfidence":83},"Hey everyone!  I work for a sports company and we are in search for personal trainers who have work experience in training people and who are fluent in speaking english. This is a payed job and if you are interested then shoot me a message and I will send you additional information.  Have a great day!",["Date","2022-10-04T08:11:50.000Z"],0.44,{"text":92,"timestamp":93,"topicId":5,"sentiment":12,"topicConfidence":47,"sentimentConfidence":94},"Hey everyone! I'm in search for a gym partner that we can train together and help each other out to meet our fitness goals (Goal set to be reached by mid april 2023). I've trained in previous years by myself most times and it's great. This time i'm looking for accountability - someone to keep me in check while I could provide the same to them if they wish so, because recently and on different occasions, I found myself diving in my work and studies very often  and dismissed the allocated time to train.  Here's the catch - I'm training at 4.30 am at Gym! Vanalinn. Won't find many people in the gym at that time. And the afternoon - evening can be verypacked.  On that note, anyone interested by any chance?",["Date","2022-10-03T16:37:56.000Z"],0.62,{"text":96,"timestamp":97,"topicId":5,"sentiment":12,"topicConfidence":98,"sentimentConfidence":99},"Tere! I'm looking for a sport coach, to go to myfitness raväla with me, if you know a good one, who can speak english or french (it would be awesome), feel free to contact me! 😁",["Date","2022-09-30T07:34:33.000Z"],0.14,0.94,{"text":101,"timestamp":102,"topicId":5,"sentiment":6,"topicConfidence":103,"sentimentConfidence":104},"Anyone have any luck finding affordable home exercise equipment?",["Date","2022-09-26T09:27:00.000Z"],0.2,0.9,{"text":106,"timestamp":107,"topicId":5,"sentiment":6,"topicConfidence":108,"sentimentConfidence":109},"The Healthy Body Support Group in Tallinn Starting on October 5th  - Do you want to lose weight? - Are you stuck with your diet? - Do you have food cravings? - Do you have skin problems? - Are you an emotional eater? - Do you want to boost your immune system? If you have answered “yes” to at least one of these questions you are more then welcome to join THE HEALTHY BODY SUPPORT GROUP You will get: + Access to a support group  meeting once a week in Tallinn + Professional help of a Health Coach + One-on-one online consultation (60 mins) + Personal nutrition strategy* * based on blood analysis that you will have to make (we will check you gut health status) This will make you: ✨ Learn new… More",["Date","2022-09-21T09:45:16.000Z"],0.51,0.52,{"text":111,"timestamp":112,"topicId":5,"sentiment":6,"topicConfidence":53,"sentimentConfidence":113},"If you are a complete beginner in the fitness world , youve probably noticed how much conflicting workout and diet information there is out there.... Its a nightmare .it confuses you , lead you to make mistakes and could cause unnecessary issues you didnt have to deal with . You just want to know what works best for your body that will make you feel the best version of your self . If you want  :  build muscle 🔥  Lose weight \u002Ffat 🔥  Improve your stamina 🔥  Personal specific or doctor given goals🔥  Improve your balance and flexibility 🔥  Improve your immune system 🔥  Establishing healthy habit 🔥 I wll have you crushing your daily gym and diet goal before you know it ! Also do virtual training  we talk through video about your goals and plan  Hit me up here on facebook or instagram (uniquetimmy) Whatsapp 58101220 Thanks",["Date","2022-09-21T09:30:55.000Z"],0.49,{"text":115,"timestamp":116,"topicId":5,"sentiment":6,"topicConfidence":47,"sentimentConfidence":33},"Dear expat family.  Are you overweight?  Do you want to run a marathon?  Maybe you just want to stay healthy and be tight.  Maybe your dream is to become an ironman. I'm AliRiza.  I'm an Olympic athlete, Ironman, and World 3rd rower and adventure racer. My family and I live in Tallinn and I give lessons to my students -1-to-1 or group workout. If you have a target, contact me through DM.  1-to-1 Personal training : 35 Euro  Group Lessons: (Minimum 2 people)   2 times a week (monthly 8 lessons) 110 Euro per month\u002F per person 3 times a week (monthly 12 lessons) 150 Euro month\u002F per person   Whats app: +90 5333263676 Instagram: @alirizabilal Www.arbcoaching.org",["Date","2022-09-19T12:46:10.000Z"],{"text":118,"timestamp":119,"topicId":5,"sentiment":6,"topicConfidence":19,"sentimentConfidence":120},"Dear expat family. Are you overweight?  Do you want to run a marathon?  Maybe you just want to stay healthy and be tight.  Maybe your dream is to become an ironman. I'm AliRiza.  I'm an Olympic athlete, Ironman, and World 3rd rower and adventure racer. My family and I live in Tallinn and I give lessons to my students -1-to-1 or group workout.  If you have a target, contact me through DM. 35Euro  personal (1to 1) Group Lessons: (Minimum 2 people) 2 times a week (monthly 8 lessons) 110 Euro per month\u002F per person 3 times a week (monthly 12 lessons) 150 Euro month\u002F per person Instagram: @alirizabilal Www.arbcoaching.org 53905304 -whats app",["Date","2022-09-19T12:43:46.000Z"],0.73,{"text":122,"timestamp":123,"topicId":5,"sentiment":12,"topicConfidence":124,"sentimentConfidence":99},"Hi I just stay in tallin for a couple of months and I love rollerblades. I have looked on marketplace to buy some but if anyone has some that I can borrow sometimes, it could be much better. And if some People are practicing, we could meet.",["Date","2022-09-18T09:01:39.000Z"],0.37,{"text":126,"timestamp":127,"topicId":5,"sentiment":12,"topicConfidence":47,"sentimentConfidence":128},"Dear women, I'm a certified personal trainer in 24\u002F7 Fitness.   I offer one-on-one sessions for women: - who don't have any experience with training and don't know where to start from; - whose training program doesn't bring results; - who feel shy and uncomfortable in the gym; - they are over 50 and want to stay fit without harming their health. My sessions will help you: - to grasp the correct exercise technique; - to understand what you should focus on and what you shouldn't waste your time on; -to accelerate your progress; -to become confident in yourself and in the gym; -to learn new things about your body and how to feel it during your trainings. I speak English, Estonian, Italian and Russian. Prices: 1 Individual session for 1person-30€ 1 session for 2 persons-45€ 3 sessions x week (monthly package 12 trainings) 1 person-360€-10%=324€(save 36€) 2 persons-540€-10%=486€(save 54€) Location: Mustamäe tee 4, Tõnismägi 11a, Küti tee 4, Vabaduse pst. 174b) Don't forget to check my instagram @xshape.fit.tallinn Come to train if you want to be sexy 🍑 and make it a lifestyle!",["Date","2022-09-13T18:25:38.000Z"],0.6,{"text":130,"timestamp":131,"topicId":5,"sentiment":6,"topicConfidence":74,"sentimentConfidence":132},"Hey!  I’m looking for a  boxing trainer\u002Fgym that teaches in English. Any recommendations? Thanks",["Date","2022-09-07T15:42:16.000Z"],0.76,{"text":134,"timestamp":135,"topicId":5,"sentiment":6,"topicConfidence":136,"sentimentConfidence":137},"Hello everybody, This year I am organising Yoga&Stretch tour in Malta and we are missing 2 participants. When: 28.09-05.10 direct flights from and to Tallinn. Price: 650€ (includes flight tickets, trainings, hotel, pool beach club entrance for all the days). You will spend 7 night, 6 days, have 8 trainings (begginers friendly) and 2 days off (without training)🤩 If you wish to registered let me know and I am going to send you all necessary information🙌🏻",["Date","2022-09-07T05:55:22.000Z"],0.12,0.57,{"text":139,"timestamp":140,"topicId":5,"sentiment":12,"topicConfidence":47,"sentimentConfidence":79},"Tere 👋  I’m looking for a personal trainer to help me to create a workout plan for me. Do you have any recommendations?  I would love to hear more about your experience and how you were able to achieve your goals?  Thanks I’m advance",["Date","2022-09-01T17:13:17.000Z"],{"text":142,"timestamp":143,"topicId":5,"sentiment":12,"topicConfidence":144,"sentimentConfidence":79},"Spend only 1-2h of your week with me and you will have better health for upcoming life and your productivity at work will increase. What ever your goal is - we will achieve it together. Don't believe me? I think you already do, but you are afraid to take that step. So now you know what you SHOULD do- contact me and book personal training in Gym! clubs (Vanalinn, Ülemiste, Rotermanni). Available times: Mornings (7-8), Lunch Time ( Vanalinn 12-13 or 13-14) and After Work ( 17.30-...)   You are only one step away - choose your road and let's start!",["Date","2022-08-30T11:16:04.000Z"],0.66,{"text":146,"timestamp":147,"topicId":5,"sentiment":12,"topicConfidence":74,"sentimentConfidence":148},"Hello all I moved to Tallinn about 7 months ago from the US and I’ve been a certified personal trainer for over 19 years. If there is anyone interested in personal training, please reach out to me. Thank you",["Date","2022-08-28T08:42:55.000Z"],0.67,{"text":150,"timestamp":151,"topicId":5,"sentiment":12,"topicConfidence":52,"sentimentConfidence":152},"Hi, dear expats I am looking for trainings or place for calisthenics, I am doing it alone but I need to improve and learn new techniques, so I think, coach or specific environment can help me.  Thanks in advance",["Date","2022-08-28T07:40:43.000Z"],0.69,{"text":154,"timestamp":155,"topicId":5,"sentiment":6,"topicConfidence":156,"sentimentConfidence":157},"Hey! any suggestion of a gym with pool that you can do pay as you go or a month membership?  Or suggestions for gym only that do same or pool only that do similar?  Also (last question I promise!) any groups that go for a wee daily dip in the sea? I’m over in September for the month and may bring my togs!",["Date","2022-08-16T16:19:17.000Z"],0.11,0.71,{"text":159,"timestamp":160,"topicId":5,"sentiment":6,"topicConfidence":74,"sentimentConfidence":33},"Hello, guys! Does anyone know any squash trainers in Tallinn? I am just a beginner in squash and looking for partners and a coach to improve my skills.",["Date","2022-08-14T10:07:11.000Z"],{"text":162,"timestamp":163,"topicId":5,"sentiment":6,"topicConfidence":164,"sentimentConfidence":165},"Are there indoor swimming pools here where we can get a membership for regular use? (If you do know of a place, can you please also mention the membership costs)? TIA!",["Date","2022-08-11T08:36:21.000Z"],0.09,0.88,{"text":167,"timestamp":168,"topicId":5,"sentiment":12,"topicConfidence":169,"sentimentConfidence":170},"Hey folks. Does anyone here practice Wing Chun Kung Fu? Would love to meet up and practice every now and again. I haven't been able to, with anyone for a few years, but before I trained for 5 years in the UK.",["Date","2022-08-09T20:46:42.000Z"],0.13,0.56,{"text":172,"timestamp":173,"topicId":5,"sentiment":6,"topicConfidence":18,"sentimentConfidence":157},"Hey, Any recommendations for a personal trainer in Kristiine area? Possibly nearby areas as well or city centre (kristiine is preferred)",["Date","2022-07-05T18:37:01.000Z"],{"text":175,"timestamp":176,"topicId":5,"sentiment":6,"topicConfidence":98,"sentimentConfidence":79},"Hi guys, I have a question, is anybody here has a knowledge where I can find some gym in the woods (outdoor) maybe with some public beach nearby?",["Date","2022-06-22T11:36:21.000Z"],{"text":178,"timestamp":179,"topicId":5,"sentiment":12,"topicConfidence":144,"sentimentConfidence":180},"Looking for anyone interested in road cycling.   Specifically I would like to find people interested in joining me to improve their cycling fitness and enjoy a bit of camaraderie.  I am just getting back into it to prepare for a triathlon.  Currently just doing 25k to 50k rides.   If you are interested….let me know.",["Date","2022-06-22T07:14:27.000Z"],0.81,{"text":182,"timestamp":183,"topicId":5,"sentiment":12,"topicConfidence":184,"sentimentConfidence":185},"Hey! I'll be staying in Tallin for 3.5 months in august,  just wondering if there are any rock climbing gyms around? :)",["Date","2022-06-09T11:32:49.000Z"],0.43,0.75,{"text":187,"timestamp":188,"topicId":5,"sentiment":12,"topicConfidence":189,"sentimentConfidence":99},"The sun is out and there is still time to come and try a new sport, 5 free training sessions with a world cup winning coach!  Come and discover what rugby is all about!",["Date","2022-06-07T11:23:23.000Z"],0.24,{"text":191,"timestamp":192,"topicId":5,"sentiment":12,"topicConfidence":193,"sentimentConfidence":165},"Hello everyone , my name is Karim and i am Personal trainer and nutritionist at myfitness Currently i am looking for 5 people who would like to make transformation in the next 90 days. I only work with people who are willing to have commitment and also to invest in their health. Also i work in corrective exercises and dealing with various types of post injuries rehabilitation. Trainings can be done at various myfitness branches and exclusively even if you are not myfitness member i can provide you with free access in training sessions. Complete training program + Nutrition plan will be included and Access to mobile app to track your progress . Note : this program is not for free  If you are interested send me a message and i will send you details Have a great day  ✌🏽",["Date","2022-06-07T07:57:37.000Z"],0.92,{"text":195,"timestamp":196,"topicId":5,"sentiment":12,"topicConfidence":197,"sentimentConfidence":198},"Спорт – отличный способ сохранить душевное равновесие и самочувствие. Занимайтесь спортом и заводите новых друзей благодаря проекту «Here We Are»! Большинство мероприятий бесплатны!   __________     Sport is a great way to maintain mental balance and well-being. Do sports and make new friends through the \"Here We Are\" project! Most of our events are free!Thank you every body who helped us to make this great video alive! Here we are! 😃 Feel free to share it on your Facebook and to your friends and family!",["Date","2022-06-01T12:40:35.000Z"],0.18,0.97,{"text":200,"timestamp":201,"topicId":5,"sentiment":6,"topicConfidence":202,"sentimentConfidence":38},"Hi everyone, are there any (english speaking) martials arts training groups\u002Fstudios you can recommend in Tallinn?",["Date","2022-05-31T11:20:43.000Z"],0.19,{"text":204,"timestamp":205,"topicId":5,"sentiment":12,"topicConfidence":202,"sentimentConfidence":193},"Hi Everyone  As I'm new to Estonia, I would like to introduce myself.  My name is Nicholas and I'm from Melbourne Australia, I am a life coach, wellness presenter and personal trainer now operating my business in Tallinn. I have an exciting opportunity for you all, Im putting together a group training class in snelli park athletics track every Monday, Wednesday and Fridays at 7pm. This class will combine all the areas that I have studied over my 20 year journey in the wellness industry.  *Strength and conditioning *General health and fitness *Posture correction *Flexibility *QiGong *Breath work *Energy healing Everyone gets a FREE first training session, I will attach a link below to the Facebook group page. I look forward to meeting you. 🙂  Registration form here👇 https:\u002F\u002Fform.jotform.com\u002F221181061799357 Kind Regards Nicholas www.nicholasmicalizzi.com https:\u002F\u002Fwww.facebook.com\u002Fgroups\u002F521745769661636\u002F?ref=share",["Date","2022-05-29T11:24:23.000Z"],{"text":207,"timestamp":208,"topicId":5,"sentiment":12,"topicConfidence":169,"sentimentConfidence":209},"Hello! I'm an Italian living in Barcelona and I'll be in Tallinn for the whole month of July and wanted to ask if maybe someone who's not there in July wants to sell me their gym membership for the month? Thanks!",["Date","2022-05-28T15:45:23.000Z"],0.54,{"text":211,"timestamp":212,"topicId":5,"sentiment":12,"topicConfidence":103,"sentimentConfidence":198},"You are looking for new sport with nice people and a lot of fun? Come to the training and try Ultimate Frisbee!! 🥏",["Date","2022-05-28T13:21:09.000Z"],{"text":214,"timestamp":215,"topicId":5,"sentiment":70,"topicConfidence":216,"sentimentConfidence":217},"Tere! Can anyone recommend me an affordable personal gym trainer who has experience with lower back and shoulder pain issues?  I have been suffering from both these issues for the last 2 years 😟 I saw the prices per session in myfitness and tbh it was very expensive to afford as a student. Hoping to get some answers 😀",["Date","2022-05-24T19:37:32.000Z"],0.65,0.7,{"text":219,"timestamp":220,"topicId":5,"sentiment":6,"topicConfidence":189,"sentimentConfidence":99},"Do we have any kickboxing or MMA training centers in #tallinn ?",["Date","2022-05-22T03:53:43.000Z"],{"text":222,"timestamp":223,"topicId":5,"sentiment":6,"topicConfidence":202,"sentimentConfidence":224},"Hey,  I want to get whey protein products for workout. Where can I find them in Tallinn? Some stores where you can find them for decent prices?",["Date","2022-05-17T18:34:31.000Z"],0.83,{"text":226,"timestamp":227,"topicId":5,"sentiment":12,"topicConfidence":193,"sentimentConfidence":48},"Hello! If anyone is interested then tonight in MyFitness Rävala at 19.15-20.15 we have a panel discussion in English with 3 awesome personal trainers about training, nutrition, fitness and you can ask questions of course. DM me if you would like to join us tonight and I will share more information! 🙂 https:\u002F\u002Ffb.me\u002Fe\u002F3mfKqTvZC",["Date","2022-05-17T05:07:34.000Z"],{"text":229,"timestamp":230,"topicId":5,"sentiment":12,"topicConfidence":37,"sentimentConfidence":224},"Can you suggest me a sports trainer who does real change in peoples lives ? Personally experienced peoples suggestions are very much appreciated.",["Date","2022-05-06T08:36:24.000Z"],{"text":232,"timestamp":233,"topicId":5,"sentiment":12,"topicConfidence":124,"sentimentConfidence":234},"Can you suggest me a sports trainer who does real change in peoples lives ? Personally experienced peoples suggestions are very much appreciated. Edit: Found the person. But for future reference you can still comment here for other people.",["Date","2022-05-06T08:33:50.000Z"],0.82,{"text":236,"timestamp":237,"topicId":5,"sentiment":12,"topicConfidence":74,"sentimentConfidence":43},"I'm looking for a sports group\u002Fclub where people train together once or twice a week ⛹️🤸🧗🤼 Any recommendations? Open for different kind of sports. Thanks!",["Date","2022-03-30T09:47:58.000Z"],{"text":239,"timestamp":240,"topicId":5,"sentiment":6,"topicConfidence":241,"sentimentConfidence":144},"I'm looking for a sports group\u002Fclub where people train together once or twice a week ⛹️🤸🧗🤼 Any recommendations? Open for different kind of sports. Thanks! Edit: I'm looking for a group where it's more or less the same group of people every week and not a gym class where people join randomly",["Date","2022-03-30T09:47:17.000Z"],0.28,{"text":243,"timestamp":244,"topicId":5,"sentiment":6,"topicConfidence":47,"sentimentConfidence":180},"Time to load yourself with gym energy!  Do you know what and how to train there? Or would like to ask some questions from gym trainer? Register here: https:\u002F\u002Fforms.gle\u002FfediwfyJ2BJKoVhT7",["Date","2022-03-29T16:51:04.000Z"],{"text":246,"timestamp":247,"topicId":5,"sentiment":12,"topicConfidence":248,"sentimentConfidence":249},"Hello people eager to increase their self-awareness using coaching.  I am happy to invite a few coachees (clients) to use me as a “tool” in finding ways to achieve their goals. I am in the learning process and it will be free of charge. Please send me a personal message and I take it from there. Grateful 😍",["Date","2022-03-26T19:43:38.000Z"],0.17,0.98,{"text":251,"timestamp":252,"topicId":5,"sentiment":6,"topicConfidence":209,"sentimentConfidence":234},"РУССКИЙ см. НИЖЕ, EESTI KEELES vt ALL ENG Do you know how to train in gym? How to use all the equipment what they offer there or how its reasonable and most effective way to train? If you want to find out, then join with us to our next event! RU Cнаете ли вы, как правильно тренироваться в тренажерном зале и какова ваша рациональная тренировочная нагрузка? Хотите спросить тренера о чем-то? Если это так, мы с нетерпением ждем встречи с вами на нашем следующем мероприятии. Бесплатное мероприятие! EST Kas sa tead, kuidas jõusaalis õigesti treenida või milline on ratsionaalne treeningkoormus just sulle? Tahaksid küsida midagi treenerilt? Kui jah, siis ootame sind meie järgmisele sündmusele.",["Date","2022-03-25T07:31:18.000Z"],{"text":254,"timestamp":255,"topicId":5,"sentiment":12,"topicConfidence":47,"sentimentConfidence":170},"Any recommendations for a personal trainer? I am currently signed up with MyFitness, but wouldn’t mind changing for the right trainer.  I’m looking to put on weight and would prefer early morning sessions.  Cheers!",["Date","2022-03-23T14:39:52.000Z"],{"text":257,"timestamp":258,"topicId":5,"sentiment":12,"topicConfidence":65,"sentimentConfidence":99},"Hey guys and gals, do any of you know some good martial arts school in Tallinn that would accept English speakers?  I’m not exactly trying to become Bruce Lee but I would love to do something physical. I think it will be fun. 😁",["Date","2022-02-20T16:43:13.000Z"],{"text":260,"timestamp":261,"topicId":5,"sentiment":12,"topicConfidence":47,"sentimentConfidence":185},"For those interested in personal training. Call to arms. Firstly, thanks to all who already closed deals. We got a good thing going! For the rest, I am offering a chance to get acquainted with personal training in Tallinn with modest costs. There are few places in my calendar that could still be filled with exercise!  I'm enrolled on a Scandinavian FAF-PT course. I look for several people to train along Feb-Apr at gym or outside. We can also discuss nutrition and weight control. If you have spark to get in shape before the beautiful Estonian summer sets in drop me a few lines in private and we'll see what we can do. At the moment, I am asking for reimbursement of my own gym costs and my weekly fish catch. You can contact me in English, Finnish or Estonian. In the future I am looking for a few regulars to engage on a more long-term life change plan and in building a better you.",["Date","2022-02-18T12:19:50.000Z"],{"text":263,"timestamp":264,"topicId":5,"sentiment":6,"topicConfidence":216,"sentimentConfidence":148},"For those interested in personal training. I am offering a chance to get acquainted with personal training in Tallinn with modest costs. I'm enrolled on a Scandinavian FAF-PT course. I look for several people to train along Feb-Apr at gym or outside. We can also discuss nutrition and weight control.  My background is in professional kitchen and cultural studies. Gastronomy and exercise have been a regular part of my life for nearly two decades. My understanding of gastronomy ranges from Middle-Eastern delicacies to Scandinavian rye. Exercise I have been conducting from the Himalayas to the deep murky waters of Finnish lakes. You can be either a person with already some experience on training… More",["Date","2022-02-14T08:19:55.000Z"],{"text":266,"timestamp":267,"topicId":5,"sentiment":6,"topicConfidence":268,"sentimentConfidence":94},"Hi! I'm looking for a gym partner\u002Fspotter\u002Fmotivational speaker that goes to Gym in Vanalinn. I need someone to help me put in practice all that youtube knowledge",["Date","2022-02-13T11:38:05.000Z"],0.33,{"text":270,"timestamp":271,"topicId":5,"sentiment":6,"topicConfidence":103,"sentimentConfidence":137},"I want to start learning martial arts . so does anybody aware of a place here in Tallinn where I can learn martial arts, any kind of martial arts .maybe kickboxing or just boxing. and for sure have english speaking coaches otherwise it will be impossible",["Date","2022-02-05T11:35:04.000Z"],{"text":273,"timestamp":274,"topicId":5,"sentiment":6,"topicConfidence":275,"sentimentConfidence":209},"Tere!  I will be arriving in Tallinn next week and wanted to inquire about the workout scene in the city. What gyms do you guys recommend for expats\u002Fforeigners (i.e where there's more diversity)? I don't really care about too much except that the gym should be clean, have a decent powerlifting rack\u002Fweights, dedicated bench presses, lockers and be closer to the city center\u002FKadriorg.  Also any unspoken rules I should be aware of? For example, here in the US it's heavily frowned upon to take up a rack if you're on your phone for a majority of the time, not racking your weights after you're done etc.  Thanks!",["Date","2022-01-26T17:56:05.000Z"],0.4,{"text":277,"timestamp":278,"topicId":5,"sentiment":6,"topicConfidence":279,"sentimentConfidence":280},"🧗 the social sport you should choose on 2022!",["Date","2022-01-17T15:48:29.000Z"],0.21,0.58,{"text":282,"timestamp":283,"topicId":5,"sentiment":6,"topicConfidence":241,"sentimentConfidence":104},"Calling out to all the gym experts here. Can someone give me the whole run down what is the typical gear when you go to the gyms? What do people usually wear? How do you decide what gym is the best fit for you?",["Date","2022-01-16T00:43:30.000Z"],{"text":285,"timestamp":286,"topicId":5,"sentiment":12,"topicConfidence":279,"sentimentConfidence":8},"Hey people, can anyone recommend a boxing course for beginners (ideally in english) in tallinn?  Thank you!",["Date","2022-01-07T14:07:21.000Z"],{"id":5,"label":288,"color":289},"gym, training, trainer","#ff9da7",[291,294,297,300,303,305,308,310,312,314],[292,293],"gym",140,[295,296],"training",120,[298,299],"trainer",100,[301,302],"personal",80,[304,302],"fitness",[306,307],"myfitness",60,[309,307],"workout",[311,307],"coach",[313,307],"sport",[315,316],"weight",40],"uses":{"params":["topic_id"]}}]}
