{"type":"data","nodes":[null,{"type":"data","data":[{"posts":1,"topic":670,"representativeWords":673},[2,9,15,20,25,30,35,38,43,48,52,57,62,66,71,75,80,85,89,93,97,102,106,111,114,117,120,123,127,130,133,138,142,146,151,155,159,162,166,169,172,175,178,181,184,187,191,194,198,202,205,209,213,216,220,223,226,230,233,236,239,242,246,249,253,256,259,262,266,270,274,277,280,283,286,290,293,296,299,302,305,308,312,316,319,322,326,330,333,336,339,343,346,350,353,356,359,362,365,369,373,376,379,383,386,389,392,395,398,401,404,407,410,413,416,419,422,425,428,431,434,437,440,443,446,449,452,455,458,461,464,467,470,473,476,479,482,485,488,491,494,497,500,503,506,509,512,515,518,522,525,528,531,534,537,540,543,546,549,552,555,558,561,564,567,570,573,576,579,582,585,588,591,594,597,600,603,606,609,612,616,619,622,625,628,631,634,637,640,643,646,649,652,655,658,661,664,667],{"text":3,"timestamp":4,"topicId":5,"sentiment":6,"topicConfidence":7,"sentimentConfidence":8},"Many people have told me that job application works better here when supported by internal referals. In that sense it would be nice to have a directory of the companies people in the group are working at.  Maybe this can be compiled in an internal document if you do not mind sharing this kind of information: simply the contact name and the name of the company. Just and idea.",["Date","2022-12-29T13:48:39.000Z"],1,"Positive",0.32,0.65,{"text":10,"timestamp":11,"topicId":5,"sentiment":12,"topicConfidence":13,"sentimentConfidence":14},"Are there any other sources for job search besides the traditional ones (cv.ee, cv keskus, work in estonia, meet frank, linkedin, indeed or applying directly at the website of companies)? Thanks",["Date","2022-12-26T10:29:31.000Z"],"Neutral",0.38,0.87,{"text":16,"timestamp":17,"topicId":5,"sentiment":6,"topicConfidence":18,"sentimentConfidence":19},"Dear Friends,  Members  :)  Let me please share with you something. My father Viktor Lomunov is in IT Field, has Doctor degree in IT and long experience working in IT. He is also now looking for a new job. Would really appreciate if you can take a look or please share with friends or IT companies. He speaks good English,  Estonian,  Ruasian.  Main competences: Programming of Industrial Microcontrollers: -Mitsubishi,  -Siemens, - Beckhoff,  -Honneywell Please email viktor.lomunov@gmail.com  Please share.",["Date","2022-12-24T17:27:49.000Z"],0.7,0.91,{"text":21,"timestamp":22,"topicId":5,"sentiment":12,"topicConfidence":23,"sentimentConfidence":24},"We are Hiring for our Whiskey Bar and Cigar Lounges the following positions Manager Full-Time Part-Time if you are interested or know a perfect candidate please contact me @  Luke@dboiss.com",["Date","2022-12-19T10:01:23.000Z"],0.44,0.56,{"text":26,"timestamp":27,"topicId":5,"sentiment":6,"topicConfidence":28,"sentimentConfidence":29},"👋 Hello Lovely Bunch Of Guys & Gals & Everyone-in-between. Are there people in this group in leadership positions at work who identify as introverts? ☺️(Asking in relation to my own work project). If you don't mind, could you please get in touch with me, for a few questions? If you do mind - that's ok, too, you still can contact me. :-)",["Date","2022-12-16T13:39:23.000Z"],0.36,0.84,{"text":31,"timestamp":32,"topicId":5,"sentiment":12,"topicConfidence":33,"sentimentConfidence":34},"Hello everyone   As someone new who just moved i did not have much luck finding a job. I have experience in tourism and hospitality industry for over 7 years working at different positions. My last job was as a general manager of a food chain restaurant.i have checked few websites but no luck as i speak english and turkish only.  Any suggestions would be appreciated .. Thanks in advance🙂",["Date","2022-12-13T18:10:12.000Z"],0.42,0.5,{"text":36,"timestamp":37,"topicId":5,"sentiment":12,"topicConfidence":5,"sentimentConfidence":34},"Hey lovely folks, Is there an option to start a career in IT without prior knowledge? Have some companies here a training program that helps you to get a foot in?  I have some little coding experience from university and interest to take part in a training program. Unfortunately, I am more a getting taught - practice type person and not someone who could teach himself everything from A to B. My background is mostly in logistic. So companies in E-Commerce would be interesting. Let me know",["Date","2022-12-13T13:44:15.000Z"],{"text":39,"timestamp":40,"topicId":5,"sentiment":12,"topicConfidence":41,"sentimentConfidence":42},"I can add archaeologists to the skills in my CV now.",["Date","2022-12-13T11:30:52.000Z"],0.35,0.63,{"text":44,"timestamp":45,"topicId":5,"sentiment":6,"topicConfidence":46,"sentimentConfidence":47},"Sharing this position, Tallinn based selling to UK, fluent English a must have, great working environment with flexibility. https:\u002F\u002Fm.facebook.com\u002Fstory.php?story_fbid=513010937513834&id=100064147951105",["Date","2022-12-07T04:00:53.000Z"],0.4,0.85,{"text":49,"timestamp":50,"topicId":5,"sentiment":12,"topicConfidence":41,"sentimentConfidence":51},"Would you support the theory that as you gain more professional experience in a specific field competition gets higher and thus the job market gets tighter? I wish everybody had the chance to be well qualified so everybody could have access to good jobs.",["Date","2022-12-05T17:33:29.000Z"],0.53,{"text":53,"timestamp":54,"topicId":5,"sentiment":6,"topicConfidence":55,"sentimentConfidence":56},"🌟 JOB OFFER 🌟 Hi there,  If you speak #Danish and are looking for a job, where you have a chance to develop your career then we have a perfect match for you.  ⚡ Join with Linde Gas customer support team as Agent Support Representative.  More information and application form can be found here: https:\u002F\u002Fwork.brandem.ee\u002Flinde-agent-support-representative\u002F",["Date","2022-11-25T12:13:16.000Z"],0.75,0.88,{"text":58,"timestamp":59,"topicId":5,"sentiment":12,"topicConfidence":60,"sentimentConfidence":61},"Hie everyone. I wanted to find out that if you’re a nurse from a country that is not within the EU is it possible to get a nursing job here in Tallinn and what is the process like?",["Date","2022-11-24T16:15:25.000Z"],0.33,0.81,{"text":63,"timestamp":64,"topicId":5,"sentiment":6,"topicConfidence":65,"sentimentConfidence":19},"Hi everybody!  I'm searching on behalf of my boyfriend a night job He's 25 years old from Italy,speaks good English and Italian and had experience as a pizza maker in a pizzeria in North Italy and he had experience many years with welding in metal-mechanic industries.  He's very committed to work,respects the schedules, is a fast learner and good listener, knows how to work in team and how to proceed independently if needed. He's searching for a job mainly during evening\u002Fnights as during the day he studies, he's open also to online job offers. Please PM me if you have any offer and I will direct you to him. Thank you🙏",["Date","2022-11-24T15:07:16.000Z"],0.62,{"text":67,"timestamp":68,"topicId":5,"sentiment":6,"topicConfidence":69,"sentimentConfidence":70},"Hello, We are hiring! Please send your details and your recent portfolio to: kiba@spaceage.agency 📷✉️",["Date","2022-11-22T11:45:34.000Z"],0.76,0.54,{"text":72,"timestamp":73,"topicId":5,"sentiment":6,"topicConfidence":28,"sentimentConfidence":74},"Happy to help if you need to improve your CV or LinkedIn profile to win more interviews 😊",["Date","2022-11-18T13:53:53.000Z"],0.94,{"text":76,"timestamp":77,"topicId":5,"sentiment":12,"topicConfidence":78,"sentimentConfidence":79},"Due to the active geographical expansion of sales, we are looking for active, experienced and ambitious managers to join our team. 🔎 Position: REGIONAL SALES MANAGER 🟥What are your responsibilities as a REGIONAL SALES MANAGER? -Active sales of electrical equipment as well as offering complete --tailored solutions -Active search of new clients -Establishing relationships with new clients -Carrying out meetings, presentations and negotiations with clients -Management of Sales Projects -Preparation of quotations and the coordination of equipment supplies -Participating in international exhibitions -Business trips -Preparing reports and providing market analysis’ -Participating in market… More",["Date","2022-11-18T10:58:37.000Z"],0.46,0.55,{"text":81,"timestamp":82,"topicId":5,"sentiment":12,"topicConfidence":83,"sentimentConfidence":84},"Looking for a job,  can anyone help me out to get job???please inbox me",["Date","2022-11-15T19:21:16.000Z"],0.39,0.74,{"text":86,"timestamp":87,"topicId":5,"sentiment":6,"topicConfidence":83,"sentimentConfidence":88},"Hello! I am a 21 year old who has just graduated from the University of Malta where I've acquired an undergraduate degree BA (hons) in Youth and Community Studies. I specialise in non-formal and informal education thence I would like to ask if there's any available vacancies  for english speakers  within the educational or social sector, I'm also interested to work within the tourism sector. Pls contact me pm if you have any opening calls for english speakers, thanks in advance :)",["Date","2022-11-14T20:32:40.000Z"],0.78,{"text":90,"timestamp":91,"topicId":5,"sentiment":6,"topicConfidence":79,"sentimentConfidence":92},"🙋‍♀️ Looking for an active and sociable SALES ASSISTANT with fluent English in speaking\u002Fwriting. Online work and preferably in the CET time zone. Previous experience in architecture or real estate is helpful, as well as basic knowledge of CAD drawings. ☎️ WhatsApp +3725510000",["Date","2022-11-14T18:18:33.000Z"],0.71,{"text":94,"timestamp":95,"topicId":5,"sentiment":6,"topicConfidence":13,"sentimentConfidence":96},"Hey there! I'm new in the group, it's a pleassure foreigners ☺️, with My girlfriend we are planning to move to Estonia looking for a place with better oportunities, She's 26 and i'm 24, she has plenty experiences off diferent types like administrative work, HR positions, and customer services. I'm also have different experiences as administrative work, customer service, retail , operative duties and video editing. We both are looking for to grow as a person and in all aspects, we will aprecciate any help and of course the possitive messages. We are from Argentina and we both speak native spañish and fluent English, we would like to know also if there is a possibility of moving to study Estonian. Thanks for the space and good day everyone 😊🙌🏻",["Date","2022-11-14T01:03:19.000Z"],0.9,{"text":98,"timestamp":99,"topicId":5,"sentiment":6,"topicConfidence":100,"sentimentConfidence":101},"Heii!  For a university research on leadership and management styles I'm urgently looking for 2 managers who wouldn't mind answering to some questions on their Management's experience 😊 I'm especially looking for somebody who has at least some years' experience in Estonia , if you're interested in being interviewed or know somebody who would, please PM me 😊 Thank you!🙏",["Date","2022-11-12T14:44:24.000Z"],0.43,0.83,{"text":103,"timestamp":104,"topicId":5,"sentiment":6,"topicConfidence":55,"sentimentConfidence":105},"We are looking for active, experienced and ambitious assistant to our team.  🔍 SALES DEPARTMENT ASSISTANT JOB DESCRIPTION ✏️Creation and maintenance of client database. ✏️Assisting during meetings and presentations.  ✏️Management of Sales Projects. ✏️Preparation of quotations and coordination of equipment supplies. ✏️Preparing reports. ✏️Participating in international exhibitions. ✏️Working with documents.  REQUIRED SKILLS 🔸Proficiency in Russian & English languages. Additional language skills are a plus. 🔸Technical education or experience in a technical field. 🔸Excellent communication skills. 🔸Ability to express your thoughts correctly in the professional manner. 🔸Good ability to organize… More",["Date","2022-11-10T12:29:33.000Z"],0.8,{"text":107,"timestamp":108,"topicId":5,"sentiment":6,"topicConfidence":109,"sentimentConfidence":110},"Hello. Maybe someone here may be interested in this role. if interested, please dm or send an email for more information.  Thanks))",["Date","2022-11-09T21:26:40.000Z"],0.31,0.82,{"text":112,"timestamp":113,"topicId":5,"sentiment":6,"topicConfidence":61,"sentimentConfidence":74},"Hello guys I hope everyone is doing well. Im a fluent Arabic and English Speaker based in Tallinn looking for a job opportunity. I have graduated with a computer science degree and currently im self studying web development. Im interested to work in any field. I am hardworking, a team player and I can perform well under pressure. I love to take on new challenges and learn new things and do stand alone jobs. Im ambitious about developing my self and becoming successful.  Would you be able to help me to find a job opportunity? Im actively looking on Cvkeskus, LinkedIn as well.  Kind regards.",["Date","2022-11-09T15:44:49.000Z"],{"text":115,"timestamp":116,"topicId":5,"sentiment":6,"topicConfidence":79,"sentimentConfidence":61},"Good early morning! Where would one look to find a young woman who might be interested in a paid marketing\u002Fpromotion gig? Someone who is good at social media, doesn't mind talking on camera and who can speak English. A female friend of mine is looking to hire someone between the ages of 18 - 25. Has to be good with apps likes Instagram, tiktok, Facebook, Twitter and maybe even Reddit. An already established social media presence\u002Ffollowing would be a big plus, but is not required. Any ideas where I could find interested applicants? When I was in university I knew a few such people, but I'm not a student anymore nor can I just loiter around at universities. 😅",["Date","2022-10-30T03:19:17.000Z"],{"text":118,"timestamp":119,"topicId":5,"sentiment":6,"topicConfidence":28,"sentimentConfidence":74},"Hi, I’m writing university bachelor thesis about the credibility factors of influencer marketing in the Baltic states. I created a survey to collect the data and I really need to reach some respondents from Estonia. I’d be very grateful for your help if you could fill it in or even post it on your story!💗 thank you",["Date","2022-10-28T08:58:14.000Z"],{"text":121,"timestamp":122,"topicId":5,"sentiment":12,"topicConfidence":46,"sentimentConfidence":42},"Hi all I have recently relocated to Tallinn from South Africa to join my family. I am currently looking for work but I can only speak English. If anyone knows of places hiring English speakers please let me know. Thanks",["Date","2022-10-26T08:34:00.000Z"],{"text":124,"timestamp":125,"topicId":5,"sentiment":12,"topicConfidence":13,"sentimentConfidence":126},"Any Finnish speakers who are looking for a job? Please DM me if this is you",["Date","2022-10-20T18:35:38.000Z"],0.92,{"text":128,"timestamp":129,"topicId":5,"sentiment":12,"topicConfidence":78,"sentimentConfidence":70},"We are Hiring for our Whiskey, Gin, Rum Bars and Cigar Lounge  if you are interested or know a perfect candidate please contact me @  53079880 Luke@dboiss.com",["Date","2022-10-19T09:07:55.000Z"],{"text":131,"timestamp":132,"topicId":5,"sentiment":12,"topicConfidence":70,"sentimentConfidence":65},"Hello everyone, I have been living in Tallinn since April, trying to find a job on my field but so far nothing. I am now looking for any job I can handle with English, if anyone has any suggestion pls dm me. I have a lot of experience in customer service but I am open for other roles too. Loosing my mind indoors :x",["Date","2022-10-17T14:11:57.000Z"],{"text":134,"timestamp":135,"topicId":5,"sentiment":6,"topicConfidence":136,"sentimentConfidence":137},"Hello, I am a foreigner, I am currently looking for a job, it Doesn't matter what kind of job I don't speak Estonian.  I speak English, I learn quickly and have a sense of responsibility. If anyone have anything, please send me a message",["Date","2022-10-15T15:18:31.000Z"],0.47,0.51,{"text":139,"timestamp":140,"topicId":5,"sentiment":6,"topicConfidence":33,"sentimentConfidence":141},"If you are looking for a great job in the most active area in industry, please apply below!",["Date","2022-10-15T13:53:43.000Z"],0.93,{"text":143,"timestamp":144,"topicId":5,"sentiment":12,"topicConfidence":145,"sentimentConfidence":47},"Hey!  Any SEO expert freelance here?",["Date","2022-10-15T09:02:50.000Z"],0.3,{"text":147,"timestamp":148,"topicId":5,"sentiment":6,"topicConfidence":149,"sentimentConfidence":150},"Hello guys, just wanted to share with you a cool company ,focused on skin analysis SaaS product, named Haut.AI is looking for candidates. If you are JavaScript Engineers , Data Analysts, Marketing specialist or Customer Success specialist, please take a look and give it a chance, you won’t regret it 😉  https:\u002F\u002Fhaut.ai\u002F#wearehiring  Let me know if interested, either in comments or DM! 🙂",["Date","2022-10-14T16:56:38.000Z"],0.61,0.96,{"text":152,"timestamp":153,"topicId":5,"sentiment":6,"topicConfidence":83,"sentimentConfidence":154},"RESEARCH ASSISTANT NEEDED Tere kõigile! My colleague Dr Sofia Gavrilova (based at the Leibnitz Institute for Regional Geography) is looking for a research assistant - the tasks are listed below. You will need to have excellent knowledge of Estonian, and knowledge of Russian might also be useful. Ideally, the tasks would be completed by the end of 2022, but this is negotiable. If you are interested in the post, please comment or DM me so I can share Dr Gavrilova's contact information with you. I do not know the salary but will update when I have it. She is looking to hire someone very quickly, so please don't delay to get in touch! Also, if anyone knows a listserv or similar for Estonian… More",["Date","2022-10-14T13:39:53.000Z"],0.59,{"text":156,"timestamp":157,"topicId":5,"sentiment":12,"topicConfidence":24,"sentimentConfidence":158},"I know job sites have probably been shared in previous posts. But does anyone have any advice on finding English speaking jobs? Ive applied for like every “English required” jobs on cv keskus (which I rarely get responses on) and a few jobs with Wise (keep getting declined, but will keep trying). I have like 6\u002F7 years experience in customer service and also food industry, about a year in security and a degree in Game Development",["Date","2022-10-14T11:17:57.000Z"],0.66,{"text":160,"timestamp":161,"topicId":5,"sentiment":6,"topicConfidence":158,"sentimentConfidence":61},"Good day  I hope you are safe and healthy! With your permission I introduce myself, I'm Nurmukhamad Razzokov, 27 years old, MSc Mechatronics Engineering(robotics) at University of Debrecen, Hungary(Europe) as well as BS Technical Expert Marketer(Electrotechnics  and Electronics). I worked 3 years as a Electrical Installer, I'm junior technical assembler (installer), 3D graphics designer (product developer), I'm skilled carpenter and I can make architectural 3D interior design also .......etc  I have almost 5 languages: English, Russian, Uzbek, a little Turkish, Hungarian. At the moment I'm looking for a permanent (full time) job in Tallinn Estonia.  If you have serious job vocations, Can you suggest?  I can begin as a production worker: Assembling Electronics, warehouse assembling process, Electrical engine repairing and many types of engineering fields. You can send private message.  I'll send my official CV. Thank you!",["Date","2022-10-10T19:59:25.000Z"],{"text":163,"timestamp":164,"topicId":5,"sentiment":12,"topicConfidence":165,"sentimentConfidence":14},"Hi! Any Argentinians here? Hola que tal! What websites or apps one should use when searching for a job in Argentina? Apart from Linkedin.",["Date","2022-10-09T16:46:40.000Z"],0.86,{"text":167,"timestamp":168,"topicId":5,"sentiment":6,"topicConfidence":23,"sentimentConfidence":74},"Hi everyone!  I’m Georgian,🇬🇪 currently living in Estonia🇪🇪 I’m open for a job opportunities in Tallinn.  I have over 7 years of experience working in IT company as a Head of PR and brand communications. I have been organizing participation at conferences and exhibitions as well as represented our company at these industry events globally I love to take care of Marketing, PR & Communications. I am more than happy to help companies with: 👩‍💻Plan and organize marketing functions (Branding, Communications, etc) 🧑‍💼Generating leads  📢Design and coordinate promotional campaigns 🗓Organize Exhibitions, events and other activities. 🎨Graphic design – Ps\u002FAi I have a lot of contacts in Media & Entertainment industry in case this is your field of activity. In case of interest or questions don’t hesitate to contact me for CV and\u002For let’s meet up in Tallinn Thank you  Salome",["Date","2022-10-06T09:41:53.000Z"],{"text":170,"timestamp":171,"topicId":5,"sentiment":6,"topicConfidence":145,"sentimentConfidence":96},"Hello everyone, Have a friend looking for plumbing job in construction within Estonia. Any leads are much appreciated. Please do inbox. Thanks.",["Date","2022-10-05T20:00:19.000Z"],{"text":173,"timestamp":174,"topicId":5,"sentiment":6,"topicConfidence":33,"sentimentConfidence":96},"Hi there. I'm planning to apply as a Customer Service Associates in Wise which offers relocation sponsorship. I'm currently working in Kuala Lumpur with the same position for 2 years now and going 3 this coming January. I handle E-payment Global FinTech account ( competitor of PayPal ) which we cater email, chat and outbound support for our user.  Anyone here could help me or refer me to work in Wise? I knew the fact that there some Filipinos whos already hired there 😊😊😊. Thanks in advance. Bless y'all.",["Date","2022-10-05T19:20:49.000Z"],{"text":176,"timestamp":177,"topicId":5,"sentiment":12,"topicConfidence":145,"sentimentConfidence":78},"Hello, thanks for accepting me, my name is Ayrton, I am in Andorra and I would like to get to know Estonia, I am determined to travel.  Honestly, I don't have economic needs, but in my experience, the best way to get to know a new place is working there.  Do you have a small job that allows me to interact with your people?  economics is not important, I want to have a real experience of life in Estonia. I speak native Spanish and some English",["Date","2022-09-29T12:12:58.000Z"],{"text":179,"timestamp":180,"topicId":5,"sentiment":6,"topicConfidence":56,"sentimentConfidence":141},"Hi, everyone We are searching for new colleagues to join our Immigration Hub team in KPMG Tallinn. :)  If you are interested, please find more information below.  For Administrative role apply here: https:\u002F\u002Frecruitlab.co.uk\u002Fi\u002Fkpmg\u002Fjobs\u002F40\u002Fjoin-our-global-mobility-team For Global Mobility Coordinator role apply here: https:\u002F\u002Frecruitlab.co.uk\u002Fi\u002Fkpmg\u002Fjobs\u002F41\u002Fjoin-our-global-mobility-team Why KPMG? By joining KPMG, you will become a part of a global company where teamwork, professional development and meaningful work are valued. You will be working together with international colleagues, and you will gain a valuable experience in the field of global mobility. We offer an attractive motivational package to our employees which includes sports compensation, health days, fun events with your colleagues, and much more!",["Date","2022-09-22T12:47:06.000Z"],{"text":182,"timestamp":183,"topicId":5,"sentiment":6,"topicConfidence":42,"sentimentConfidence":96},"Hello, We have a job opportunity for Danish speakers. Come and join our customer support team for one of the biggest eCommerce stores in Europe - About You!",["Date","2022-09-19T11:48:11.000Z"],{"text":185,"timestamp":186,"topicId":5,"sentiment":6,"topicConfidence":137,"sentimentConfidence":96},"TWO OPEN JOBS IN TALLINN! We are looking for two charismatic and energetic live-stream hosts to join our team. The job is located in our office in the center of Tallinn. Remote work is also possible in special cases. We offer a full-time job for two women or men in the casino industry. We also consider part-time applicants. If necessary, we also train our employees for work, so you don't necessarily have to have previous experience in the field! We are already professionals in this field. We support and help you get started! Work would start immediately. We expect these qualities from you: -Discussion opener -Happy and positive character -A team player who also knows how to show direction to… More",["Date","2022-09-18T22:55:13.000Z"],{"text":188,"timestamp":189,"topicId":5,"sentiment":6,"topicConfidence":190,"sentimentConfidence":34},"Heya! I'll share a post about freelancing and how to be creative when choosing a career 🌿 Hope it adds some inspiration to your day 🌞I’ve always wanted to study law and see if the myths about it are true. Do lawyers really simplify disputes? Do they stand for ethics and fairness? And do they all wear suits? During my studies, I attended as many internships as possible. I got an overview of the whole legal system through different institutions. I wrote articles, participated in legal organizations and worked at a law office. After graduating, many of my coursemates put on ties, switched to serious-looking profile photos and found the most comfortable desks in big corporations at their 9 to 5 jobs. I was hesitating. I enjoyed law, but couldn’t find a place where I could work in coherence with my personal values and inner… More",["Date","2022-09-16T11:44:38.000Z"],0.34,{"text":192,"timestamp":193,"topicId":5,"sentiment":12,"topicConfidence":8,"sentimentConfidence":8},"Hello! I'm a sound engineer that just moved in from Portugal. I'm looking for opportunities. Does anyone have any information about this field?  Kind regards!",["Date","2022-09-16T09:02:01.000Z"],{"text":195,"timestamp":196,"topicId":5,"sentiment":6,"topicConfidence":70,"sentimentConfidence":197},"How to attract and develop digital talent? How to make technology your competitiive advantage? Our friends at EIT and Taltech are hosting a conference INNOVEIT Tallinn that takes place already next week, 21 September at Mektory, Taltech. Register here by THIS FRIDAY for a FREE ticket (lunch included) !",["Date","2022-09-14T21:19:21.000Z"],0.68,{"text":199,"timestamp":200,"topicId":5,"sentiment":6,"topicConfidence":79,"sentimentConfidence":201},"How to attract and develop digital talent? How to make technology your competitiive advantage? Our friends at EIT and Taltech are hosting a conference INNOVEIT Tallinn that takes place already next week, 21 September at Mektory, Taltech. Register by THIS FRIDAY for a free ticket(lunch included) !",["Date","2022-09-14T21:08:04.000Z"],0.69,{"text":203,"timestamp":204,"topicId":5,"sentiment":6,"topicConfidence":83,"sentimentConfidence":201},"Hello! I'm CEO of Estonian trading company. We are looking for Turkish native speakers with experience in trading and offer opportunity to work remotely in suitable time! Write to PM for details!",["Date","2022-09-14T14:17:31.000Z"],{"text":206,"timestamp":207,"topicId":5,"sentiment":6,"topicConfidence":208,"sentimentConfidence":197},"Hi! My husband is looking for a job, if anyone can help please contact via ramazankarimovjudo@gmail.com or via comments. He is experienced in landscaping, construction, cooking. Physically fit and can do physical jobs that require strength. Speaks fluent English and basic Russian. Thanks.",["Date","2022-09-13T14:22:11.000Z"],0.49,{"text":210,"timestamp":211,"topicId":5,"sentiment":6,"topicConfidence":212,"sentimentConfidence":42},"Hi everyone! Could you tell me if there is any Web3\u002FBlockchain community in Estonia? I'm interested in connecting with people who are interested in Web3 Technology and Blockchain Technology My LinkedIn: https:\u002F\u002Fwww.linkedin.com\u002Fin\u002Faldo-matus117\u002F",["Date","2022-09-09T22:12:32.000Z"],0.41,{"text":214,"timestamp":215,"topicId":5,"sentiment":12,"topicConfidence":46,"sentimentConfidence":79},"Hey everyone!  This is kind of urgent: i have a friend who had his TRP based on a job permit. Now he is unemployed and was looking for a job for a while. He needs a job that offers the residency based on work otherwise he will be forced to go back very soon.  Does anyone have any opportunities or knows about where to look \u002F has tips on how to deal with it.  Thank you 🙏 Edit: Thank you all for your answers. He did try wise but they were very strict in the selection that he didn’t get a role.  For now, any job would do really. He has experience in waitering (was a manager for customer relations and booking for one restaurant), and photography\u002Fvideography.  He has a degree in philosophy but I highly doubt that would get him anywhere on the job market in such a short notice.  If anyone thinks they have an opportunity for him, let me know and i will send you a PM with his linkedin profile",["Date","2022-09-08T13:00:50.000Z"],{"text":217,"timestamp":218,"topicId":5,"sentiment":12,"topicConfidence":56,"sentimentConfidence":219},"Hello! Pingu's English Viimsi is hiring!",["Date","2022-09-06T18:59:13.000Z"],0.6,{"text":221,"timestamp":222,"topicId":5,"sentiment":6,"topicConfidence":28,"sentimentConfidence":150},"Happy to help you with your new CV\u002FResume and LinkedIn profile 😊",["Date","2022-09-04T08:57:13.000Z"],{"text":224,"timestamp":225,"topicId":5,"sentiment":6,"topicConfidence":84,"sentimentConfidence":219},"Job opportunity as a school assistant for 11yrs old boy with moving dissability. Full time job from about 8am -4pm. Suitable for sporty and kind person with English ability, preferably for male or strong lady. Pls. send private messages for more details.",["Date","2022-08-30T10:14:56.000Z"],{"text":227,"timestamp":228,"topicId":5,"sentiment":12,"topicConfidence":212,"sentimentConfidence":229},"Hello friends, Looking for a mechanical engineer capable to do drawings and 3d models in SolidWorks (basic to medium level). This is a payable role in a small Estonian company. If you are a refugee or expect looking for a job don't hesitate to contact me. More details in PM.",["Date","2022-08-24T18:13:21.000Z"],0.67,{"text":231,"timestamp":232,"topicId":5,"sentiment":6,"topicConfidence":47,"sentimentConfidence":61},"Good morning! Any Finnish-speaking expats here who may be looking for a new job opportunity abroad? I work with an international recruitment company here in Tallinn and we are currently looking Finnish speakers to work for one of our biggest clients in Lisbon as content moderators for a well-known social media platform! The job is suitable for youthful social media-savvy Finnish-speakers who would like to live and work in Portugal and who are ready to work in shifts (8h shifts rotating 24\u002F7) The flights to Lisbon are paid for by the company and your accommodation for the entire working period can also be provided in company apartments. Starting dates are in September and October and we are looking for several people so feel free to apply with a friend or share my contacts if you know someone who might be interested! For more info, send me your English CV to Maris@nordicjobsworldwide.com or PM me over here :)",["Date","2022-08-23T05:46:27.000Z"],{"text":234,"timestamp":235,"topicId":5,"sentiment":6,"topicConfidence":110,"sentimentConfidence":61},"Good morning! Any Finnish-speaking expats here who may be looking for a new job opportunity abroad?  I work with an international recruitment company here in Tallinn and I am currently recruiting Finnish speakers to work for one of our biggest clients in Lisbon as content moderators for a well-known social media platform! The job is suitable for youthful social media-savvy Finnish-speakers who would like to live and work in Portugal and who are ready to work in shifts (8h shifts rotating 24\u002F7) The flights to Lisbon are paid for by the company and your accommodation for the entire working period can also be provided in company apartments. Starting dates are in September and October and we are looking for several people so feel free to apply with a friend or share my contacts if you know someone who might be interested! For more info, send me your English CV to Maris@nordicjobsworldwide.com or PM me over here :)",["Date","2022-08-23T05:44:48.000Z"],{"text":237,"timestamp":238,"topicId":5,"sentiment":6,"topicConfidence":83,"sentimentConfidence":69},"Job offer 😉",["Date","2022-08-15T13:31:22.000Z"],{"text":240,"timestamp":241,"topicId":5,"sentiment":6,"topicConfidence":5,"sentimentConfidence":65},"Hello Guys, There is an opening for students to intern with Menaget.com Menaget is a tech support company providing the required remote talent for organizations around the world. For organizations that require remote, skilled and vetted tech talents; Menaget is able to help navigate the hiring of an individual or full dev team. When it comes to Product Development, ether from scratch, at any stage of development, Menaget can work with Product Owners to build and deliver the solutions they are looking for  Since the role is related to business development, student who want to intern should have educational background related to business or management. Interested students can contact sales@menaget.com to apply.",["Date","2022-08-13T21:53:25.000Z"],{"text":243,"timestamp":244,"topicId":5,"sentiment":6,"topicConfidence":245,"sentimentConfidence":8},"📢 We are #hiring for Part-time jobs! TELUS International AI-Data Solutions works in our proprietary AI training platform handling all data types (text, images, audio, video and geo) across 500+ languages and dialects. We offer flexible work-from-home opportunities for people with passion for languages. The jobs are part-time, and there is no fixed schedule. Whoever you are, wherever you come from, come join our global AI community. We are looking for individuals who are living in #Estonia and who are fluent in Russian and English. Check our job opening and apply! Estonia Personalized Internet Assessor (Russian Language): https:\u002F\u002Fwww.telusinternational.ai\u002Fcmp\u002Fcontributor\u002Fjobs\u002Favailable\u002F193… More",["Date","2022-08-10T08:57:31.000Z"],0.64,{"text":247,"timestamp":248,"topicId":5,"sentiment":12,"topicConfidence":56,"sentimentConfidence":65},"Hello job seekers! Do you have nordic language skills? I work as an international recruiter and am now looking for people with anything from a B1 to C2 level, for my clients here in Tallinn. If you have an interest in starting or developing your career in either media, content, insurance support, or customer support, id like to have a chat! Please reach out to me by DM or by email at anie@nordicjobsworldwide.com for more information.",["Date","2022-08-08T08:42:42.000Z"],{"text":250,"timestamp":251,"topicId":5,"sentiment":6,"topicConfidence":100,"sentimentConfidence":252},"Hi everyone! Glia 🦄 is looking for a person who loves to communicate with different people and companies (and is extremely good at noticing their needs) and sparking their interest in our product which changes the world of digital customer service. If you are interested to join us to do something revolutionary - apply for this job! As a bonus - a lot of benefits, crazy amount of office snacks, cute office dogs aaand of course - best international colleagues ever! Please note that for this position you shouldn't be studying.",["Date","2022-08-02T07:43:15.000Z"],0.98,{"text":254,"timestamp":255,"topicId":5,"sentiment":12,"topicConfidence":5,"sentimentConfidence":158},"Hello everyone! If anyone is looking for a job in IT and\u002For Marketing, or you know someone who is, Lingvist is hiring for the following positions: iOS Developer Backend Developer Growth Marketing Manager Take a look at all the openings here:",["Date","2022-07-26T11:04:03.000Z"],{"text":257,"timestamp":258,"topicId":5,"sentiment":6,"topicConfidence":92,"sentimentConfidence":51},"Dear group members, My name is Irina, I am Head of People Operations of Creditstar Group.😀 Creditstar is rapidly growing international consumer finance company, headquartered in Tallinn, Estonia and operating in multiple European markets. We are looking for native speakers for our Danish market for position of Country Manager and Loan Administrator.🇩🇰 If you are interested or know someone who could be interested in, please check job ads below and feel free to apply 😊 Country Manager for Denmark, https:\u002F\u002Fcreditstar.bamboohr.com\u002Fjobs\u002Fview.php?id=156&source=aWQ9Mw%3D%3D  Danish Speaking Loan Administrator, https:\u002F\u002Fcreditstar.bamboohr.com\u002Fjobs\u002Fview.php?id=158&source=aWQ9Mw%3D%3D",["Date","2022-07-22T08:01:47.000Z"],{"text":260,"timestamp":261,"topicId":5,"sentiment":6,"topicConfidence":46,"sentimentConfidence":29},"Hi guys! I'm looking for someone with strong knowledge and experience with Shopify. I need help with my website. Please dm me! Thanks!🙂",["Date","2022-07-21T16:08:39.000Z"],{"text":263,"timestamp":264,"topicId":5,"sentiment":12,"topicConfidence":149,"sentimentConfidence":265},"Any Polish-speaking people here looking for customer support type of work? Just trying my luck here. 🇵🇱🤞 Estonian startup Rendin is hiring a Customer Support Specialist for Poland's market. What's Rendin anyway? – A solution for renting (out) homes and signing secure rental agreements. Questions and applications: Martin Altmets \u002F martin@rendin.co About the company: https:\u002F\u002Frendin.ee\u002Fen\u002Fabout-rendin #hiring #jobs #startup",["Date","2022-07-20T11:14:37.000Z"],0.77,{"text":267,"timestamp":268,"topicId":5,"sentiment":6,"topicConfidence":208,"sentimentConfidence":269},"Hello expat friends, My fiancé and I are preparing to move to Tallinn and are looking for jobs. Would anyone be so kind to share their job-seeking experience? What online platform would you recommend? What obstacles did you find on your way? Was it hard to find a job without speaking Estonian? We're looking for jobs in corporations or start-ups or even translation offices, so if anyone works in these settings I'd be thankful to hear your thoughts. Thank you and have a wonderful day 🌟",["Date","2022-07-19T14:10:02.000Z"],0.95,{"text":271,"timestamp":272,"topicId":5,"sentiment":12,"topicConfidence":78,"sentimentConfidence":273},"Dear Expats, we will be searching for helping hands during the next years for RunProperty.com. I would ask if anyone here knows an Italian in Estonia with at least masters degree, who has worked at a research institute (e.g. University) for 2 years during the last 5 years. We have a research grant until summer 2023, but our researcher had to change projects. Now  In search for an Italian speaking researcher",["Date","2022-07-17T11:41:02.000Z"],0.79,{"text":275,"timestamp":276,"topicId":5,"sentiment":12,"topicConfidence":41,"sentimentConfidence":149},"Hello Guys what are some quick jobs you can easily start with when you arrive in Estonia ? Any jobs  Cleaning everything is possible anyone who can recommend anything ? Or know some sources where I can start quickly ? I Am planning to relocate to Estonia  And wouldn’t want to risqué being without an income once I start there  Kindly Fatih",["Date","2022-07-17T10:33:56.000Z"],{"text":278,"timestamp":279,"topicId":5,"sentiment":12,"topicConfidence":46,"sentimentConfidence":29},"Watch till the end 🤔😳 what’s your experience with job interviews in Estonia 🇪🇪?Job interview",["Date","2022-07-17T09:30:23.000Z"],{"text":281,"timestamp":282,"topicId":5,"sentiment":6,"topicConfidence":78,"sentimentConfidence":150},"Hello Here! Anyone enrolling for a one-year MBA program at EBS this semester? Would love to connect. Thanks in advance! 🙏",["Date","2022-07-16T13:06:46.000Z"],{"text":284,"timestamp":285,"topicId":5,"sentiment":6,"topicConfidence":13,"sentimentConfidence":29},"Hi All, I’m a Srilankan and planning to join my husband who has already moved to Estonia for his job.  Im also looking for a job related to my field of expertise in Estonia.  I have graduated in Chemistry and currently working as a Senior Food Technologist with 7+ years of experience in Research and Development and Quality Assurance in a well reputed F&B manufacturing organization in Srilanka.  How are the opportunities in Estonia for my field? Really appteciare your help in this regard  Thank you",["Date","2022-07-15T08:22:49.000Z"],{"text":287,"timestamp":288,"topicId":5,"sentiment":6,"topicConfidence":110,"sentimentConfidence":289},"Dear Expat and Local friends,  we hope you are having a wonderful summer. We have a great news that we are hiring.  If you know someone interested please share this. We thruly appreciate your help 🙏❤️",["Date","2022-07-11T18:34:11.000Z"],0.99,{"text":291,"timestamp":292,"topicId":5,"sentiment":12,"topicConfidence":60,"sentimentConfidence":69},"Hi! Im looking for native english speaking woman (preferably US english) to do some voice overs in centre of Tallinn this week! If you are intrested please contact me here or mari@orbital.ee for more details",["Date","2022-07-11T12:25:16.000Z"],{"text":294,"timestamp":295,"topicId":5,"sentiment":6,"topicConfidence":208,"sentimentConfidence":55},"Hi, job seekers in Estonia! I work in international recruitment, and I wanted to introduce myself and reach out to people who might be interested in work. Do you live in Estonia and have nordic language skills? I would like to talk to you! I am looking for someone with a financial or service-related background, and who has some knowledge of either Swedish, Danish, or Norwegian. Do you also appreciate learning opportunities, flexibility in terms of home office, and great working culture? Read on! Is this you, or do you know someone who is interested in a new job? Please reach out to me at anie@nordicjobsworldwide.com or Facebook messenger, and let's have a chat! :)",["Date","2022-07-11T07:27:37.000Z"],{"text":297,"timestamp":298,"topicId":5,"sentiment":6,"topicConfidence":23,"sentimentConfidence":126},"Are you looking for a job in a cosy international capital where public transport is free? We're searching for Finnish-speakers to start a new international career path in beautiful Tallinn. Yes, you would be working in a modern office, but you'd also have access to the historic Old Town, the vibrant culture and nightlife and all the natural beauty of four distinct seasons. Our client supports you with relocating and remember - home is just a short ferry ride away. We have multiple positions open starting in September. Ready for a new exciting challenge in Estonia? Speak another Nordic language and live in Tallinn? Reach out to me today! 😊",["Date","2022-07-08T13:23:55.000Z"],{"text":300,"timestamp":301,"topicId":5,"sentiment":6,"topicConfidence":136,"sentimentConfidence":56},"? Denmark 🇩🇰 ? Hey 👋 my son was accepted as a student in the Nedherlands and Denmark 🇩🇰. Maybe 🤔 some people here who know Denmark (Kopenhagen) well and would like to talk with him or share some materials re. topics: accommodation, costs of living, job market, immigration, jobs for students etc. Thank you 🙏 in advance.",["Date","2022-07-06T16:56:22.000Z"],{"text":303,"timestamp":304,"topicId":5,"sentiment":12,"topicConfidence":56,"sentimentConfidence":219},"Job announcement for Danish speaking people living in\u002Fconsidering moving to Estonia.  Positions in Norwegian, Swedish and Finnish are also available, however language lever requirements might slightly vary, so contact me for details. We are looking for people who would like to work for one of the major Scandinavian banks in its Estonian brack as credit data specialists. Your job will consist of gathering and arranging data about clients. Your qualifications: - Ability to communicate in English. This will be your primary language in the team - Understanding Danish. You will read a lot of documents - No prior experience in the field required - No Danish language on spoken\u002Fwritten level required - Good team player - Target and detail oriented If you know someone who will be a good fit, tell them to get in touch.  This position hasn't been announced yet and I'll help you bypass normal process and get you in touch with the team leader directly.",["Date","2022-07-06T07:38:28.000Z"],{"text":306,"timestamp":307,"topicId":5,"sentiment":12,"topicConfidence":56,"sentimentConfidence":245},"Hello, Expats Community.  Not a Rimi post this time.  The company where I work Monestro.com.  Has two open positions. One is for a German speaker to take care of our German customers. The other one is for Marketing to someone who has advanced Excel skills, and Google ads experience if you are one of the candidates we are looking for, feel free to send me a DM, and I will give you more details.",["Date","2022-07-04T06:27:29.000Z"],{"text":309,"timestamp":310,"topicId":5,"sentiment":12,"topicConfidence":34,"sentimentConfidence":311},"We have made a whatsapp group for the new students who got admitted in International business administration In bachelors for the year 2022\u002F2023 .  Any one who got admitted in this course do join this group as we discuss the information regarding studies !",["Date","2022-06-30T21:15:27.000Z"],0.72,{"text":313,"timestamp":314,"topicId":5,"sentiment":6,"topicConfidence":315,"sentimentConfidence":273},"Hi everyone! Looking for a sales\u002Fnew business manager , preferably native speaker of English or German, with background in B2B, to join the international marketing\u002Fcommunications team. Happy to receive some recommendations from you, if you happen to know anybody. More details could be provided in PM.",["Date","2022-06-28T06:50:21.000Z"],0.73,{"text":317,"timestamp":318,"topicId":5,"sentiment":12,"topicConfidence":56,"sentimentConfidence":24},"Job opportunity! MTÜ Mondo is looking for a part or full time (75-100%) country coordinator for Mondo’s activities in Uganda, whose task is to manage the team working in Kampala from a distance, to carry out ongoing programs and to drive new and innovative funding partnerships. Uganda country coordinator will be based in Mondo’s office in Tallinn, with field trips to Uganda. More information (also in English):",["Date","2022-06-26T14:24:24.000Z"],{"text":320,"timestamp":321,"topicId":5,"sentiment":6,"topicConfidence":13,"sentimentConfidence":311},"Are you looking for a job in Estonia? You can find 17 open positions on our expat job platform! Have a look and apply for a job fast and easy on our leading European job platform 👉 https:\u002F\u002Fwww.europelanguagejobs.com\u002Fcandidates\u002Ffind-a-job-in-Europe\u002FSM?utm_source=Social+Media&utm_medium=Stefani+&utm_campaign=Facebook",["Date","2022-06-21T14:33:10.000Z"],{"text":323,"timestamp":324,"topicId":5,"sentiment":6,"topicConfidence":273,"sentimentConfidence":325},"Can you beat financial crime with words? Join Salv to create powerful narratives and give Salv's AML Platform the spotlight it deserves. 💙 Salv is a growing Estonian regtech with offices in Tallinn and Tartu. Our staff of 50+ includes financial crime-fighters, anti-money laundering (AML) and technology experts. Apply for this role, if you are good at 💫 Juggling: you can juggle multiple projects and keep attention to detail. 💫 Acrobatics: you can walk the rope between the product, marketing, and sales team. 💫 Stilt walking: you can get a complete view of our customers across channels, and maintain a consistent message. 💫 Wheel of death: you are good at balancing the workload! I know it escalated quickly, but fear not. Go ahead and apply here: https:\u002F\u002Fsalv.com\u002Fjobs\u002Fproduct-marketer-and-content-specialist\u002F #productmarketing #hiring #hiringnow",["Date","2022-06-21T13:44:01.000Z"],0.48,{"text":327,"timestamp":328,"topicId":5,"sentiment":6,"topicConfidence":105,"sentimentConfidence":329},"Hiring: Junior Dev! reply to the ad and\u002For HMU if you have any questions :)",["Date","2022-06-16T11:35:16.000Z"],0.57,{"text":331,"timestamp":332,"topicId":5,"sentiment":6,"topicConfidence":229,"sentimentConfidence":65},"Hi all! Wondering if you have any leads or suggestions on where to look for my 18 year old son who is looking for his first job. He knows English and Italian and is open to anything.",["Date","2022-06-14T07:54:44.000Z"],{"text":334,"timestamp":335,"topicId":5,"sentiment":12,"topicConfidence":109,"sentimentConfidence":88},"Job offer service in smaller restaurant near center Tallinn tomorrow,cash after work. Possible for longer time.. Message now with your contact nr.english  language requirement...plus...",["Date","2022-06-13T18:43:43.000Z"],{"text":337,"timestamp":338,"topicId":5,"sentiment":6,"topicConfidence":23,"sentimentConfidence":150},"Only one week left until the application deadline for the summer courses of the University of Tartu in 2022! ⌛️You can choose among 20 fascinating courses ranging from semiotics, digital product management, political studies, and folkloristics to clinical medicine. 😎 Why get into one of the thrilling programmes: 🧑‍🏫High-quality education (lectures, visits, workshops) ‍🎓Award of ECTS credits upon successful completion 🥳 Fun and interesting cultural programme 🌐 International education atmosphere & new connections What are you waiting for?😀Find more below👇and apply now!",["Date","2022-06-13T16:21:20.000Z"],{"text":340,"timestamp":341,"topicId":5,"sentiment":6,"topicConfidence":342,"sentimentConfidence":110},"Hi) My name is Katy and I am in Tallinn now. I am searching a workplace for myself. My English is B2, Ukrainian and Russian-free. I am easily can do work with computer, apps and social media. I am 31. Maybe you have some work in office, restaurant or hotel?  I really appreciate if you will leave some useful comments)",["Date","2022-06-08T08:30:40.000Z"],0.37,{"text":344,"timestamp":345,"topicId":5,"sentiment":12,"topicConfidence":46,"sentimentConfidence":329},"We are urgently hiring Estonian iGAMING WRITERS, join our global team! Copywriters are responsible for producing texts based on the outline provided by the Editor. Their duties include: Necessary research to write the text Follow SEO guidelines Fact-checking Proofreading for accuracy and quality You don’t have to be Hemmingway but you should be able to at least spell check (Grammarly) your text before sending it to your editor.  #hiring2022 #remotework #remotejobs #writerscommunity #writer #gambling #casinoonline",["Date","2022-06-07T14:45:55.000Z"],{"text":347,"timestamp":348,"topicId":5,"sentiment":6,"topicConfidence":349,"sentimentConfidence":84},"#hiring #marketing #Tallinn  Hi Friends!  My name is Mary. I work in the Canadian international company Coral Club Int.  The company was founded 24 years ago. And now we are growing more and looking for Regional Senior Marketing Specialist What you will do: - Prepare marketing action plan (1year) with a Global Responsible Manager - Implement, track and lead marketing communication programs such as email, social media, digital campaigns, events, promotions, new product launches - Adapt marketing materials, coordinate translations or writing, proofreading and edit creative content across different mediums  Your qualifications: - Native Estonian language - Very good command of English\u002FRussian -… More",["Date","2022-06-02T11:29:20.000Z"],0.52,{"text":351,"timestamp":352,"topicId":5,"sentiment":12,"topicConfidence":137,"sentimentConfidence":349},"Looking for someone on here with experience with plastic welding. Wanting to repair a plastic (heavy duty) fuel tank. If anyone has experience or knows of a company that would take a small job, the info would be appreciated!",["Date","2022-06-01T17:26:35.000Z"],{"text":354,"timestamp":355,"topicId":5,"sentiment":6,"topicConfidence":55,"sentimentConfidence":158},"Hello everyone! Any Italian-speakers here looking for work? I am recruiting Italian-speakers for an international BPO company in Tallinn or Tartu ! • Job: Customer Service Advisor with Italian language for a surprise gift service (phone, email) • Full time job, Monday-Friday between 10AM – 6PM • Solid base salary & monthly performance bonuses • Monthly expenses compensation (phone, internet etc) • International Work Environment • Opportunities for professional growth For more info and applying for the job, send your English CV to Maris@Nordicjobsworldwide.com",["Date","2022-06-01T04:27:19.000Z"],{"text":357,"timestamp":358,"topicId":5,"sentiment":6,"topicConfidence":273,"sentimentConfidence":197},"Hello everyone! I am looking for Italian-speakers to work in customer support for an international BPO company in Tallinn or Tartu ! • Job: Customer Service Advisor with Italian language for a surprise gift service (phone, email) • Full time job, Monday-Friday between 10AM – 6PM • Solid base salary & monthly performance bonuses • Monthly expenses compensation (phone, internet etc) • International Work Environment • Opportunities for professional growth For more info and applying for the job, send your English CV to Maris@Nordicjobsworldwide.com Feel free to share!",["Date","2022-06-01T04:25:59.000Z"],{"text":360,"timestamp":361,"topicId":5,"sentiment":6,"topicConfidence":5,"sentimentConfidence":79},"Looking for an experienced recruiter with \"Global\" experience headhunting senior technical talent across Europe and the United States (e.g. CTO, Directors). Great English is a must. If you know anyone in Tallinn who has such experience, please message me or send a CV.",["Date","2022-05-31T15:57:11.000Z"],{"text":363,"timestamp":364,"topicId":5,"sentiment":6,"topicConfidence":34,"sentimentConfidence":14},"If you know any Ukrainian language speaking friends that are based in Estonia and looking for a job, then feel free to send them the link below as Wise is offering jobs for Ukrainian language speakers. Feel free to drop a line if you have any question. All the best :))",["Date","2022-05-30T11:56:34.000Z"],{"text":366,"timestamp":367,"topicId":5,"sentiment":12,"topicConfidence":13,"sentimentConfidence":368},"Work offer job Cook for Asian restaurant One Service staff who speaks English plus other languages Pm inbox Work place center Tallinn",["Date","2022-05-28T08:20:21.000Z"],0.89,{"text":370,"timestamp":371,"topicId":5,"sentiment":12,"topicConfidence":56,"sentimentConfidence":372},"We have a part-time job for a student in our company which is based in Tallinn. The job can also be home based in Germany. German (native) and English language are a requirement. The position is sales and marketing work assisting our companies activities in the German and Austrian markets. The work will involve assisting us with the following brands: www.eklandstone.com www.positiveinteriors.com www.mozziwatch.com Feel free to drop your CV or ask any further questions at david@eklandstone.com",["Date","2022-05-27T06:36:44.000Z"],0.58,{"text":374,"timestamp":375,"topicId":5,"sentiment":6,"topicConfidence":33,"sentimentConfidence":165},"I welcome you to my new group for jobseekers and employers. In the beginning, Im posting our jobs for offer but everyone is free to post their vacancies.  https:\u002F\u002Fwww.facebook.com\u002Fgroups\u002Fwww.jobs4u.fi",["Date","2022-05-26T13:05:32.000Z"],{"text":377,"timestamp":378,"topicId":5,"sentiment":6,"topicConfidence":60,"sentimentConfidence":126},"Hey! My company is currently looking for a Financial Accountant to join our R2R team:) We are looking for a person with 2+ years of experience in Accounting and with good understanding of IFRS standards. No fluency in Estonian is required, the position is English based. It is a bigger Finnish company with well outlined internal structures and is generally a very nice place to be:)  If you're looking to be referred for the position and you feel like you're good match, you can contact me and I will be happy to recommend you to our HR.  You can read about the position in details here: https:\u002F\u002Fcareers.konecranes.com\u002FKonecranes\u002Fjob\u002FTallinn-Financial-Accountant\u002F791917401\u002FThank you. Mikhael",["Date","2022-05-26T09:37:40.000Z"],{"text":380,"timestamp":381,"topicId":5,"sentiment":6,"topicConfidence":212,"sentimentConfidence":382},"I wish you a warm welcome to my new group for jobseekers and those who seek to employ :-). https:\u002F\u002Fwww.facebook.com\u002Fgroups\u002Fwww.jobs4u.fi",["Date","2022-05-25T11:18:39.000Z"],0.97,{"text":384,"timestamp":385,"topicId":5,"sentiment":6,"topicConfidence":5,"sentimentConfidence":29},"Do you need help with recruitment? Look no further! www.jobs4u.fi can help you. We are specialised in the recruitment of IT, Tech, Medical, Management, and other highly skilled talents. Welcome to contact us for further discussion. Henrik G.S. Arvidsson. CEO.",["Date","2022-05-24T09:54:29.000Z"],{"text":387,"timestamp":388,"topicId":5,"sentiment":6,"topicConfidence":78,"sentimentConfidence":29},"Good evening. I am looking for someone who need a bit of extra hours of work office (students, unemployed…) It is mainly for Secretary tasks and can be made from home. Perfect knowledge of English (writing) and a bit of French would be appreciated. If interested, write me personally on Messenger!",["Date","2022-05-23T20:25:53.000Z"],{"text":390,"timestamp":391,"topicId":5,"sentiment":6,"topicConfidence":56,"sentimentConfidence":56},"For all the native Spanish speakers who are passionate about crypto and marketing, a global exchange ProBit is hiring a Regional Marketing Manager for Tallinn office. For more details, please check the job add and help spread out the word! Thank you.🌿",["Date","2022-05-23T20:22:12.000Z"],{"text":393,"timestamp":394,"topicId":5,"sentiment":6,"topicConfidence":7,"sentimentConfidence":110},"Dear all, maybe there are Norwegian speakers in this group, please have a look and spread the word, thank you. 💚",["Date","2022-05-23T12:08:24.000Z"],{"text":396,"timestamp":397,"topicId":5,"sentiment":6,"topicConfidence":33,"sentimentConfidence":101},"Dear all! I started a group for sharing jobs and applying for jobs. I started by posting our jobs but others are also welcome to post. Please join! https:\u002F\u002Fwww.facebook.com\u002Fgroups\u002F1364849790671602",["Date","2022-05-20T11:55:20.000Z"],{"text":399,"timestamp":400,"topicId":5,"sentiment":6,"topicConfidence":100,"sentimentConfidence":110},"Wise is offering a position for Hebrew language speakers as KYC agents. If you speak Hebrew and would like to use your language skills then feel free to apply for this one :)",["Date","2022-05-18T16:23:11.000Z"],{"text":402,"timestamp":403,"topicId":5,"sentiment":12,"topicConfidence":13,"sentimentConfidence":51},"Hi everyone. I look for work with relocation to Estonia (#Tartu) I'm Egyptian and currently live in Egypt. Short about me: i have a bachelor's degree in geochemistry, certificate of  safety officer, I have a driving license and  I'm Greco-Roman wrestler (two times African champion). I look for any work in any field I can work as: 1) geologist 2) chemist 3) science or geology teacher (2 years of practical experience) 4) driver 5) safety officer 6) Gym or wrestling trainer  I'm responsible and fast developed person who's looking for good opportunity. Please see my CV by the link https:\u002F\u002Fdrive.google.com\u002Ffile\u002Fd\u002F16shJA7ya2HV9uOdlHWAHDtWTfqQq_jcV\u002Fview?usp=drivesdk",["Date","2022-05-18T06:20:56.000Z"],{"text":405,"timestamp":406,"topicId":5,"sentiment":12,"topicConfidence":109,"sentimentConfidence":368},"We are still looking for a person to do stonework.. pm if you want a job in the Estonian summesun.. \u003C(\")",["Date","2022-05-15T14:31:39.000Z"],{"text":408,"timestamp":409,"topicId":5,"sentiment":12,"topicConfidence":190,"sentimentConfidence":349},"Hi!  I’m looking for an English Content Writer to work for a business here in the city. €32-36k p.a. depending on experience. Send me a pm for more info. Thanks!",["Date","2022-05-12T15:59:34.000Z"],{"text":411,"timestamp":412,"topicId":5,"sentiment":6,"topicConfidence":70,"sentimentConfidence":372},"Hey guys what's up. I have been doing some research into content creation especially when it comes to courses. If you are a developer with skills in either frontend or backend using  JS\u002FTS. If you do have any of the following under your belt. React\u002FNextJs\u002FAngular  NodeJs\u002FExpress\u002FNestJs Any database Please DM me for a proposal. Any recommendations are welcome.",["Date","2022-05-10T22:06:19.000Z"],{"text":414,"timestamp":415,"topicId":5,"sentiment":12,"topicConfidence":92,"sentimentConfidence":18},"We are hiring a full time JAVA \u002F Sping Boot developer. Contact elena@swagyourlife.com",["Date","2022-05-09T16:16:18.000Z"],{"text":417,"timestamp":418,"topicId":5,"sentiment":6,"topicConfidence":342,"sentimentConfidence":24},"Hello expats, I’m posting a lot of professional content related to Estonia on my LinkedIn.  Upcoming topics include:  1. Finding a job  2. Making a profile  3. Interview tips  4. Salary topics  If any of that resonates with you then you can follow me using link below.  https:\u002F\u002Fwww.linkedin.com\u002Fin\u002Fmanananwar",["Date","2022-04-27T17:55:25.000Z"],{"text":420,"timestamp":421,"topicId":5,"sentiment":12,"topicConfidence":83,"sentimentConfidence":329},"Hello! Our team is certified Google Analytics specialists. We can check your account against DAPS (Digital Analytics Performance Score) and tell you: - if the data is collected correctly and if a tracking code is  implemented properly; how the integration with other products is performed, such as Search Console or Google Ads) - how to organize the account effectively, how to conveniently use it in data analysis And we will send you results with recommendations for further configuration of the analytics system Please DM me",["Date","2022-04-26T18:37:00.000Z"],{"text":423,"timestamp":424,"topicId":5,"sentiment":12,"topicConfidence":109,"sentimentConfidence":47},"Does anyone have experience with creating Wikipedia pages?",["Date","2022-04-22T05:03:58.000Z"],{"text":426,"timestamp":427,"topicId":5,"sentiment":6,"topicConfidence":145,"sentimentConfidence":74},"Hello 🙂 is anyone looking for a professional web developer or designer? I'm a Pro web developer having experience and strong grip over latest techs and CMS like Wordpress, Shopify, PHP\u002FLaravel etc. if you are in need of a website, store, or web application or if there is any remote position then, don't hesitate to contact me. I would love to work for you 😊",["Date","2022-04-18T11:23:16.000Z"],{"text":429,"timestamp":430,"topicId":5,"sentiment":6,"topicConfidence":28,"sentimentConfidence":79},"Dear Respondent, My name is Adegboyega Babashola Oluwadayo I am an MBA Student of International Business Administration at the Estonian Entrepreneurship University of Applied Sciences This is an academic research Questionnaire on my Thesis for the purpose of acquiring information on the topic “EFFECTS OF ADVERTISEMENT ON CONSUMER PREFERENCE AND BEHAVIOR (A CASE STUDY OF EXPATS IN TALLINN, ESTONIA”. This thesis forms part of the requirements for the award of an MBA in International Business Administration Please kindly help in answering the questions below appropriately. Please be assured that all information supplied here will be treated with utmost confidentiality as such information will be used strictly for academic research purposes. Thank you for your valuable contribution.",["Date","2022-04-17T11:59:29.000Z"],{"text":432,"timestamp":433,"topicId":5,"sentiment":12,"topicConfidence":83,"sentimentConfidence":219},"Wonders why members in this group post stuff as a \"Group Member\" Also wonders if this post passes the admin test.",["Date","2022-04-16T13:12:15.000Z"],{"text":435,"timestamp":436,"topicId":5,"sentiment":6,"topicConfidence":79,"sentimentConfidence":74},"Hi everybody ! I’m looking for two\u002F three-month unpaid internships in the Baltic States in one of those fields : Web development\u002F Wordpress development. Students are from France and currently studying Informatics. Is a company willing to accept one of them? Thank you so much in advance and see you soon!",["Date","2022-04-15T21:22:28.000Z"],{"text":438,"timestamp":439,"topicId":5,"sentiment":12,"topicConfidence":28,"sentimentConfidence":154},"Hello everyone, My name is Uchechi Joshua Chiabuotu and I am a student of Creativity and Business Innovation at the Estonian Entrepreneurship University of Applied Sciences. I am carrying out a research on my thesis \"Language barrier and the challenges of foreigners in securing jobs in Tallinn, Estonia\". For the purpose of acquiring information for this, I am looking to interview some expats in Tallinn. This thesis forms part of the requirements for the award of Bachelors degree. Please send me a dm or indicate if you would like to be part of this.  Also, be rest assured that everything said during the interview will be used purely for academic purposes and nothing will be shared with anyone outside the purposes of my research.  Thank you",["Date","2022-04-15T07:05:50.000Z"],{"text":441,"timestamp":442,"topicId":5,"sentiment":6,"topicConfidence":83,"sentimentConfidence":74},"Hi fellow expats, does anyone here use LinkedIn as main tool their professional development, building professional network or even job-hunting? If yes, let's connect. I'm expanding my professional network in Tallinn and Estonia as a whole. Thank you!",["Date","2022-04-14T10:17:12.000Z"],{"text":444,"timestamp":445,"topicId":5,"sentiment":6,"topicConfidence":51,"sentimentConfidence":29},"Hi everyody ! I’m currently looking for a company that could welcome two first-year International Trade students for a two-month internship. Internship fields are prospecting\u002F Community Management\u002F Import-Export\u002F basically any field related to International Trade Internships are unpaid. Please send me a PM for more info. Thanks! :) Guilvic Le Daré",["Date","2022-04-08T12:53:18.000Z"],{"text":447,"timestamp":448,"topicId":5,"sentiment":6,"topicConfidence":158,"sentimentConfidence":96},"Hello Everybody \"Pathos\" is preparing for the summer season 2022. We are looking for young enthusiastic & energetic candidates (with or without experience) with various talents, creative, with vibrant & outgoing personality. \"Pathos” hires:  ENTERTAINERS (fitness, kids, sports, chiefs, all around animators), to join our teams and work in GREECE (Crete, Rhodes, Corfu, Zakynthos, Kefallonia, Thasos, Peloponnese, Xalkidiki, Kos) in some of the most beautiful places of the world for season 2022. If you are interested, send your CV to jobs@pathosgreece.gr",["Date","2022-04-07T11:01:18.000Z"],{"text":450,"timestamp":451,"topicId":5,"sentiment":6,"topicConfidence":46,"sentimentConfidence":201},"Hello! We are a Meta Business Partner. My team is Facebook Blueprint certified. If you have active advertising campaign in Facebook, we can help you improve your results and give recommendations on how to achieve KPI. Based on the results of the audit, we’ll show you problem areas and points for growth and an understandable road map of what you should do ahead.  Please DM me.",["Date","2022-04-06T11:24:43.000Z"],{"text":453,"timestamp":454,"topicId":5,"sentiment":6,"topicConfidence":229,"sentimentConfidence":47},"On this lovely spring day we are looking for language speakers to join customer support teams in Linde Gas.  If you speak fluently one of the following languages: Danish, Norwegian, Swedish, Finnish, Lithuanian), then send your resume to renata.keva@manpower.ee or apply directly through link below. Office is located in beautiful and trendy Ülemiste City! You can find more information regarding positions here: https:\u002F\u002Fhumanage.manpower.ee\u002F",["Date","2022-04-06T11:21:07.000Z"],{"text":456,"timestamp":457,"topicId":5,"sentiment":6,"topicConfidence":145,"sentimentConfidence":88},"Hello Everyone  I am an undergraduate student in Estonian Entrepreneurship University of Applied Sciences (EUAS) currently undertaking my B.Sc. research on ‘Impact of Ethical Marketing on Customer Decision-Making. A Study of Fast-Moving Consumer Goods Company in Estonia’. Fast moving goods company are companies that have big chains all over the world or in a particular country, popular brands, popular stores, companies etc. It is not limited to any particular brand or product. (E.g Prisma, Lidl, Primak, Rimi, Unilever, Nestle, Zara, Microsoft etc, Just to mention a few) To enable me to complete the research, you are invited to take part in a 5-minute survey. Kindly assist to fill the questionnaire to the best of your knowledge. Be rest assured that the responses you provide will be used strictly for academic purposes and will be treated with high confidentiality. I appreciate your participation.",["Date","2022-03-31T08:29:36.000Z"],{"text":459,"timestamp":460,"topicId":5,"sentiment":6,"topicConfidence":51,"sentimentConfidence":96},"Hello Fellow Expats. I am looking to hire a full time personal assistant in Tallinn. If anyone is looking for a position or knows someone they can recommend I would love to connect. I run a consulting business and need help with day to day operations and also need help with personal errands throughout the week as thing come up. Feel free to DM for full job description. If someone can recommend a good recruiter that would also be super helpful.",["Date","2022-03-31T01:26:00.000Z"],{"text":462,"timestamp":463,"topicId":5,"sentiment":12,"topicConfidence":78,"sentimentConfidence":219},"Hey Network,  you may know people speaking Georgian and Russian who can be interested in this job opportunity. I  haven't been very successful and trying to find out how to reach the Georgian community. This job can be done from Georgia too but it would require frequent travel between Georgia and Poland. Any hints are appreciated 😇",["Date","2022-03-27T20:52:42.000Z"],{"text":465,"timestamp":466,"topicId":5,"sentiment":6,"topicConfidence":60,"sentimentConfidence":382},"Hi everyone, my name is Hang Nguyen, a Vietnamese currently living in Oslo, Norway. I want to study Business\u002F entrepreneurship in Europe. I got accepted to the \"Digital Business\" program at the Norwegian Business School- BI and the \"Entrepreneurship in the digital era\" at the Estonian Business School- EBS. Does anyone have experience in either of the universities? I really appreciate it if you can share your opinions, advice, experience... related to studying, working and living in Tallinn. It would make my decision easier to choose between studying in Norway or Estonia. Thank you so much!",["Date","2022-03-26T07:18:08.000Z"],{"text":468,"timestamp":469,"topicId":5,"sentiment":6,"topicConfidence":33,"sentimentConfidence":349},"Possibly a lot of information has already been shared on this platform already. However in case there are any good leads: Does anyone have suggestions for  where to look\u002Fwho to contact for a Ukrainian lady (currently in Pärnu) looking for a job in Tallinn? She is a translator\u002Finterpreter (English Ukrainian, Russian and French). She also has several years of experience in office management.  (I don’t know her personally. She is a friend’s friends’s mom). So I may not be able to answer a lot of questions about her here. However, any leads on how to help her will be highly appreciated) 🙏🏽",["Date","2022-03-24T09:27:53.000Z"],{"text":471,"timestamp":472,"topicId":5,"sentiment":6,"topicConfidence":47,"sentimentConfidence":368},"Hello, I’m a second-year student at Tallinn University of Technology acquiring bachelor’s degree in International Business Administration with specialisation in finance. I’m looking for an internship in the department of finance (or accounting). Ideally, I’m searching for a part-time internship (in addition to my current work). I’ve contacted several Estonian start-ups but they either have extremely big number of emails in their inbox or just not looking for the candidates at this point. I do speak three languages fluently (Russian, Estonian, English) and have experience of working in different fields. As for my personal qualities, I consider myself as a very dynamic, motivated and reliable. I also think I'm very adaptable and enthusiastic when it comes to challenges and problems. I would be grateful if you could recommend a company or particular person (or maybe you are this person) willing to have free labour in their company for a month or two (I need 156 hours in total). It would also be a privilege to continue working for the company after the internship ends. Thank you! 🙂",["Date","2022-03-22T14:19:45.000Z"],{"text":474,"timestamp":475,"topicId":5,"sentiment":6,"topicConfidence":33,"sentimentConfidence":8},"Hello guys! Work from home! Full time\u002Fpart time translators needed.  Suitable for everyone who is looking for remote job or extra income. 10$\u002Fh paid every 2 weeks No previous experience needed as long as you speak the language and know basic computer skills.  Your main task is to translate websites from English to: Norwegian Swedish Danish Dutch Please DM if interested",["Date","2022-03-22T06:15:27.000Z"],{"text":477,"timestamp":478,"topicId":5,"sentiment":6,"topicConfidence":7,"sentimentConfidence":368},"Good Day Everyone, I am an undergraduate student in Estonian Entrepreneurship University of Applied Sciences (EUAS) currently undertaking my B.Sc. research on ‘Impact of Ethical Marketing on Customer Decision-Making. A Study of Fast-Moving Consumer Goods Company in Estonia’. To enable me to complete the research, you are invited to take part in a 5-minute survey. Kindly assist to fill the questionnaire to the best of your knowledge. Be rest assured that the responses you provide will be used strictly for academic purposes and will be treated with high confidentiality. I appreciate your participation.",["Date","2022-03-18T10:48:13.000Z"],{"text":480,"timestamp":481,"topicId":5,"sentiment":6,"topicConfidence":245,"sentimentConfidence":29},"Hello everyone, Hope my message get your attention .. Well how to start ... I'm free everyday starting 18h00, If someone need some help in his\u002Fher start-up company based on my experiences. You can reach me out: www.linkedin.com\u002Fin\u002Fissa-moussallem Aitäh ✌🏼",["Date","2022-03-16T15:19:36.000Z"],{"text":483,"timestamp":484,"topicId":5,"sentiment":6,"topicConfidence":136,"sentimentConfidence":126},"Hello Expats, Job opportunity in Tallinn for English-speakers. No previous experience required. Suitable also for studens.  The only requirements are: * Good knowledge of English  * Good sense of responsibility  Hope it will help to someone!",["Date","2022-03-15T19:00:05.000Z"],{"text":486,"timestamp":487,"topicId":5,"sentiment":6,"topicConfidence":5,"sentimentConfidence":150},"WE ARE GROWING ✨ Looking for ambitious career-oriented people to an international recruitment agency. Do you wish to be part of a young and successful recruitment team, that is on a journey of growth? Shall we begin with what is awesome about this? PERKS - On top of good basis salary, you have limitless bonus opportunities - Modern office location (in pictures) and light co-working space with limitless coffee and tea - Team and company that appreciates good team spirit and positivness, but are also having a hard-working attitude and passion for recruitment - International company: Over 15 languages spoken, 5 offices in Europe, and more coming! - Internal growth opportunities - Awards,… More",["Date","2022-03-15T14:25:01.000Z"],{"text":489,"timestamp":490,"topicId":5,"sentiment":6,"topicConfidence":109,"sentimentConfidence":65},"Come join us tomorrow for a seminar about how to find a job in Estonia!",["Date","2022-03-14T17:22:27.000Z"],{"text":492,"timestamp":493,"topicId":5,"sentiment":6,"topicConfidence":46,"sentimentConfidence":165},"Hi!  My friend is a refugee from Ukraine and is looking for a job in Estonia. Her fields of experience and expertise: - International tourism - Cosmetics distribution (B2C, B2B) She is friendly and creative, speaks English and also fits any administrative work, like office management or event organization. But is open for any kind of work that she is able to do. I’m helping her to find a job. Please DM me if have any suitable jobs.",["Date","2022-03-14T12:38:57.000Z"],{"text":495,"timestamp":496,"topicId":5,"sentiment":12,"topicConfidence":69,"sentimentConfidence":14},"Just forwarding one job offer for experienced IT girls\u002Fguys. Intro, contacts and description of the job are in this form: http:\u002F\u002Fkonceptform.com\u002FSenDev.pdf?fbclid=IwAR0GGZjAvKEvwl0Tv0npw7ui7iKBzpurUEnZu7Fg4YQ4ThUrzLuCgUkAd0U",["Date","2022-03-09T06:34:33.000Z"],{"text":498,"timestamp":499,"topicId":5,"sentiment":6,"topicConfidence":208,"sentimentConfidence":47},"For student expats. Our team at Evolution will be joining the Career Fair in Taltech on March 15, we hope to see you there. In case you will not be physically there, on the 16th, our Tech Lead will conduct an online seminar. You can join here, Thanks!",["Date","2022-03-07T11:06:04.000Z"],{"text":501,"timestamp":502,"topicId":5,"sentiment":6,"topicConfidence":92,"sentimentConfidence":92},"Hi everyone! We are hiring at our 𝗠𝗶𝗰𝗿𝗼𝘀𝗼𝗳𝘁 offices in Estonia and currently have 𝗼𝘃𝗲𝗿 𝟰𝟬 𝗼𝗽𝗲𝗻 𝗽𝗼𝘀𝗶𝘁𝗶𝗼𝗻𝘀 𝗮𝘃𝗮𝗶𝗹𝗮𝗯𝗹𝗲. Feel free to contact me if you are interested in any of these opportunities. I'd be more than happy to have a chat, provide more information or answer any questions you may have. https:\u002F\u002Fcareers.microsoft.com\u002Fus\u002Fen\u002Fsearch-results?rt=professional&keywords=estonia In my team we are for instance looking for 𝘀𝗼𝗳𝘁𝘄𝗮𝗿𝗲 𝗲𝗻𝗴𝗶𝗻𝗲𝗲𝗿𝘀 to work with us on 𝗶𝗻𝘁𝗲𝗹𝗹𝗶𝗴𝗲𝗻𝘁 𝗳𝗲𝗮𝘁𝘂𝗿𝗲𝘀 𝗳𝗼𝗿 𝗠𝗶𝗰𝗿𝗼𝘀𝗼𝗳𝘁 𝗧𝗲𝗮𝗺𝘀:  Principal Software Engineer – C++ \u002F Python \u002F Vision – Intelligent Features for Teams in Tallinn: … More",["Date","2022-03-06T17:10:33.000Z"],{"text":504,"timestamp":505,"topicId":5,"sentiment":6,"topicConfidence":83,"sentimentConfidence":201},"This is Ilona, who just arrived to Tallinn from Ukrain, she is looking for a job. Speaks Russian, Ukrainian, English & Chinese. If you can help please get in touch with her directly ♥️ ilonka13576@gmail.com",["Date","2022-03-06T09:01:21.000Z"],{"text":507,"timestamp":508,"topicId":5,"sentiment":6,"topicConfidence":5,"sentimentConfidence":74},"I believe every sector and individual can make an impact now.  This one for recruiters: hireforukraine.org Our company is already in touch with several extremely talented professionals. If you are currently hiring, consider this platform to create positive change for your organization AND talented Ukrainians looking for a job.",["Date","2022-03-04T12:37:40.000Z"],{"text":510,"timestamp":511,"topicId":5,"sentiment":12,"topicConfidence":65,"sentimentConfidence":29},"Job openings at Webhelp. Slovenian+Eng Or Finnish +Eng If you have questions, feel free to DM https:\u002F\u002Fcv.ee\u002Fet\u002Fvacancy\u002F761635\u002Fwebhelp-ou\u002Fcustomer-service-advisor-with-finnish-language-proficiency-reima?utm_source=email&utm_campaign=Job%20ads%20email%20notification%20EN%20NEW&utm_medium=email https:\u002F\u002Fcv.ee\u002Fet\u002Fvacancy\u002F761608\u002Fwebhelp-ou\u002Fcustomer-support-advisor-with-slovenian-skills?utm_source=email&utm_campaign=Job%20ads%20email%20notification%20EN%20NEW&utm_medium=email",["Date","2022-03-02T16:29:57.000Z"],{"text":513,"timestamp":514,"topicId":5,"sentiment":6,"topicConfidence":311,"sentimentConfidence":219},"Tere Please how can I apply for a job in Tallinn, currently In UAE, I have experience in Social media marketing and basic experience in graphic design. Willing to Learn and grow my skills with the company. Thanks",["Date","2022-03-02T07:32:17.000Z"],{"text":516,"timestamp":517,"topicId":5,"sentiment":6,"topicConfidence":197,"sentimentConfidence":29},"For any #Ukrainian speaking looking for a #job abroad! My name is Gabriella, and I’m working with international recruitment at Nordic Jobs Worldwide. We are really glad to announce that our client in #Lisbon have opened up new vacancies for #Ukrainian speakers to their office in Lisbon, Portugal. Due to the current situation, they will help applicants that needs help with work visa as well.  We are looking for Ukrainian Speaking Content Moderators for a world-famous social media application, where you will moderate content uploaded in the application in the Ukrainian speaking team. It is required to speak and write fluent Ukrainian and English., and preferably have an interest in pop-culture and social media.  You will be offered a full-time position, get help with any documentation needed, and a relocation package including flight + accommodation in company apartment. Sounds interesting? Send an email to Swe@nordicjobsworldwide.com and we will get back to you asap with more information and help you with your application.",["Date","2022-03-01T21:25:06.000Z"],{"text":519,"timestamp":520,"topicId":5,"sentiment":6,"topicConfidence":521,"sentimentConfidence":61},"Prisma is hiring!! If you are interested in working with flexible hours and easy job of putting out the goods then apply for jobs at Tallinn and Tartu Prisma stores!",["Date","2022-03-01T17:51:44.000Z"],0.45,{"text":523,"timestamp":524,"topicId":5,"sentiment":6,"topicConfidence":100,"sentimentConfidence":372},"🇺🇦 Hello, my name is Nastia and I have just arrived to Tallinn.  I left Ukraine couple weeks ago for personal reasons and the plan was to continue to work for Ukraine online but as it is evident I cannot do this now.  I have the place to stay but no job...  So if someone knows where I can look for, it would be great help.  In Ukraine I worked for French culture centre \"Alliance Française\" as a French teacher. I speak Russian, English and French.  Used to work with children before at French kindergartens in Kiev and Indianapolis, the USA And in general I worked in many different places and I have lots of experience in different spheres.  Any help will be highly appreciated!",["Date","2022-03-01T15:24:02.000Z"],{"text":526,"timestamp":527,"topicId":5,"sentiment":6,"topicConfidence":158,"sentimentConfidence":289},"Hello dears!⚡️ Spring is coming, sun is shining and I am glad to share with you the great job opportunity, don’t miss it!⏰ Regards, Eve  #softwaredeveloper #softwareengineer #java #angular #javascript",["Date","2022-03-01T10:56:47.000Z"],{"text":529,"timestamp":530,"topicId":5,"sentiment":6,"topicConfidence":109,"sentimentConfidence":126},"Nice job opportunity for Lithuanian speakers! https:\u002F\u002Feverypay.homerun.co\u002Flithuanian-speaking-customer-service-specialist?fbclid=IwAR1-1pSl4Tz2M9s3yO0KPJuN-B5jMZcGSS2l8oPTgKXbTNSL_dm1cVn9BKU",["Date","2022-02-28T12:00:02.000Z"],{"text":532,"timestamp":533,"topicId":5,"sentiment":6,"topicConfidence":190,"sentimentConfidence":56},"Nice job oppurtunity for Lithuanian speakers! https:\u002F\u002Feverypay.homerun.co\u002Flithuanian-speaking-customer-service-specialist?fbclid=IwAR1-1pSl4Tz2M9s3yO0KPJuN-B5jMZcGSS2l8oPTgKXbTNSL_dm1cVn9BKU",["Date","2022-02-28T11:58:28.000Z"],{"text":535,"timestamp":536,"topicId":5,"sentiment":12,"topicConfidence":342,"sentimentConfidence":101},"Eng. below Всім привіт. Мене звуть Олена, я співзасновник тех стартапу. Я українка, переїхала до Естонії в 2018. Наша команда організує пошук роботи для Українців що потрапили до Естонії і не можуть тепер повернутися, або для тих хто скоро опиниться тут. Будь ласка, заповнюйте файл за посиланням своїми даними на будь-якій мові. Ми будемо поширювати список серед власників бізнесу в Естонії. Не соромтеся та не зволікайте! https:\u002F\u002Fdocs.google.com\u002Fforms\u002Fd\u002F1G1wcXKcRYa9JyowBQarhlkPcm0s-xurFtEi1ovZaJco Hi, I'm Olena, co-founder of a tech startup. I'm a Ukrainian who lives in Estonia since 2018. We organize a job search for Ukrainians who are stuck or will come to Estonia in the nearest days. Please, fill in the details (no matter in what language) in the spreadsheet. We will spread to a wide range of business owners in Estonia. Don't be shy! Don't feel any doubt!  https:\u002F\u002Fdocs.google.com\u002Fforms\u002Fd\u002F1G1wcXKcRYa9JyowBQarhlkPcm0s-xurFtEi1ovZaJco",["Date","2022-02-26T13:37:24.000Z"],{"text":538,"timestamp":539,"topicId":5,"sentiment":6,"topicConfidence":74,"sentimentConfidence":141},"Hi, Backend PHP Developer Become an innovator in a 100 billion dollar industry! Bring your invaluable expertise to the e-learning industry and transform how employees across the continent learn and grow professionally.",["Date","2022-02-25T09:01:29.000Z"],{"text":541,"timestamp":542,"topicId":5,"sentiment":12,"topicConfidence":208,"sentimentConfidence":61},"Can anyone recommend an English-speaking-friendly moving company? 🚐 📦",["Date","2022-02-24T06:08:19.000Z"],{"text":544,"timestamp":545,"topicId":5,"sentiment":12,"topicConfidence":78,"sentimentConfidence":79},"Hello, my name is Hanyogo from Indonesia. Im looking for job opportunity in Estonia. If there are any possibilities for me to get a job and stay in Estonia? I used to live in Australia as a student and i had experience in bakery, pizza store as store manager back then for about 4 years. Now i stay in Indonesia because i had my visa expired. The reason im doing this because im having hard time to get job here in Indonesia and difficult to have a enough life because here you earn only $250 a month, i didnt mean to get good life just enough if i could go to Estonia and get a job make a better life. Im hoping if there is anyone willing to help i will take this action immedietly to get my documents ready.. please message me on facebook i will reply to your message as soon as possible.",["Date","2022-02-23T16:08:21.000Z"],{"text":547,"timestamp":548,"topicId":5,"sentiment":6,"topicConfidence":60,"sentimentConfidence":137},"Hello dear Expats ! Is there any IELTS specialist? I need some information about Genarel IELTS. If any one available please let me know by PM. Thanks alot. Paid task.",["Date","2022-02-23T06:48:52.000Z"],{"text":550,"timestamp":551,"topicId":5,"sentiment":6,"topicConfidence":190,"sentimentConfidence":24},"Hello dear Expats ! Is there any IELTS specialist? I need some information about Genarel IELTS. If any one available please let me know by PM. Thanks a lot. Paid task.",["Date","2022-02-23T06:26:25.000Z"],{"text":553,"timestamp":554,"topicId":5,"sentiment":6,"topicConfidence":100,"sentimentConfidence":92},"Hey, in case you know a good university student in Estonia who is looking for a Marketing internship.",["Date","2022-02-22T21:15:38.000Z"],{"text":556,"timestamp":557,"topicId":5,"sentiment":6,"topicConfidence":5,"sentimentConfidence":368},"Hi! I have a question especally from those who have experience in IT or software engineering. But anybody who has a recommendation is welcome to put in their two cents! besides some other subjects, i am especially considering studying IT in coming years. I do not have any background in information technology, but I have background in sciences and other subjects so do you recommend to start with a bachelor or a master in computer science or some other kind of vocational IT qualifications in Estonia? Secondly do you know of some online tests that can test if my personality, knowledge, skills, way of thinking is suitable for this career? I am not yet sure but definitely it is one of my considerations. Your help can make it easier to choose and I hope other people who are considering same thing as me can also benefit from this post! Thank you very much.",["Date","2022-02-16T19:08:45.000Z"],{"text":559,"timestamp":560,"topicId":5,"sentiment":6,"topicConfidence":69,"sentimentConfidence":154},"Hello, i'm looking for a 'closer' (sales representative) that will close pre-qualified leads, in english language on zoom or on the phone.  Leads will be from USA, India, England and Canada. Few hours per week can easily bring an additional income of 1000 to 3000€ per month (if you are skilled). You must be available to close leads as soon as they arrive.  If you speak french, you can learn from my closer working on the french market. His income is 100% from this business.   This opportunity will start in several months, and i'm taking applications right now.  You can send me a messenger text with your phone number, and your introduction. Please specify if you speak french.",["Date","2022-02-12T14:09:36.000Z"],{"text":562,"timestamp":563,"topicId":5,"sentiment":12,"topicConfidence":100,"sentimentConfidence":96},"Any Spanish speaker looking for a job? The company I am working is looking for Spanish speakers in Tallinn to start still in February, DM if u want to know about the position.",["Date","2022-02-11T11:47:42.000Z"],{"text":565,"timestamp":566,"topicId":5,"sentiment":12,"topicConfidence":96,"sentimentConfidence":137},"We offer distance internships for students at an international travel agency www.opatrip.com💻‼️. You can choose a language (English, Lithuanian) and field: 1. Management and administration 2. Customer service 3. Tourism and event organization 4. Copywriting, translation 5. IT, website administration 6. Creative tasks Minimum duration: 2 months. Flexible schedule🗓 In 2021 we are planning to hire people for sales manager and marketing manager positions. Our internship students are always on the top of the priority list.🤩 Please, pay attention that our company is 100% online. You do not have to come to Lithuania during the internship. If you are aiming to get a visa or permission to live in Europe- we are not the right company for you. Contact us: career@opatrip.com Subject: Internship More information: https:\u002F\u002Fyoutu.be\u002FTp7R5-336Ps",["Date","2022-02-09T20:04:03.000Z"],{"text":568,"timestamp":569,"topicId":5,"sentiment":12,"topicConfidence":5,"sentimentConfidence":79},"The e-Residency team is hiring a full-stack email marketing manager. Estonian language skills are not 100% necessary for this role, so I thought I would share it in this group.  If you have experience with Mailchimp (or another automation platform), understand what \"multivariate campaign\" means, and like to write good copy, apply below, and let's chat.",["Date","2022-02-09T15:24:13.000Z"],{"text":571,"timestamp":572,"topicId":5,"sentiment":6,"topicConfidence":24,"sentimentConfidence":110},"Hi guys, LandEx is hiring again, this time for a Business Developer. The position description is in the LinkedIn job post below. Please if you know anyone that might be interested, forward it to him :). An email with resume needs to be sent to kamel@landex.ai Thanks you!",["Date","2022-02-08T17:56:26.000Z"],{"text":574,"timestamp":575,"topicId":5,"sentiment":6,"topicConfidence":23,"sentimentConfidence":315},"🔥EASY JOB FOR EXPAT STUDENTS \u002F NEWCOMERS🔥 4.50-5.60 eur\u002Fhour, free transport from Tallinn and back, you can choose your schedule👇 PM me if interested",["Date","2022-02-08T09:47:16.000Z"],{"text":577,"timestamp":578,"topicId":5,"sentiment":6,"topicConfidence":521,"sentimentConfidence":47},"Edit:        Many thanks. Not  able to use all contacts. I haven’t expected such a high response. This group works well. I have a speaker for this time but I will keep all contacts. We never know 🙃🐝.                  Dear All,  I need a motivational speaker for the kick-off of a fast-growing company with HQ in Warsaw. The event takes place online on Feb. 17th at 3h15 Estonian time.  Someone who has business experience, charisma and can energize people and tell stories.  The subject is \"we grow, you grow\"  The company is quite a Polish and wants to become more international. People with an international background, experience, not typical 🙂 not ordinary 🙂 are welcome to contact me.  Do you know anyone? Can you recommend someone pls.?  Thank you a lot,  Anna",["Date","2022-02-07T21:56:01.000Z"],{"text":580,"timestamp":581,"topicId":5,"sentiment":6,"topicConfidence":325,"sentimentConfidence":74},"Hello everyone, I am currently completing my second year at EBS and majoring in \"Entrepreneurship in the Digital Era\". Meanwhile, I am also searching for a startup where I can put my knowledge to work and complete a 6 week internship in order to get in touch with the more practical side of this major. I would highly appreciate any referrals to startups that are taking interns. Thank you in advance for you help😊",["Date","2022-02-07T16:21:18.000Z"],{"text":583,"timestamp":584,"topicId":5,"sentiment":12,"topicConfidence":83,"sentimentConfidence":311},"Hi all,  Not sure if Job offers are allowed here, so if not, feel free to delete \u002F not post it. Our partner company AventoMT (Malta) is looking for a Head of Payments. In this position you will be responsible for the implementation of the company’s strategy and best practices for the payments policies and procedures. Full JD is here: https:\u002F\u002Faventogroup.bamboohr.com\u002Fjobs\u002Fview.php?id=106 NB! This vacancy is office based in Tallinn, Estonia. Previous experience in similar roles is required and knowledge of Russian is desirable. You can either apply through the link or send me a PM with addition questions etc.",["Date","2022-02-07T11:51:22.000Z"],{"text":586,"timestamp":587,"topicId":5,"sentiment":6,"topicConfidence":252,"sentimentConfidence":126},"Do you need help with recruitment? We are a recruitment company specialised jn IT and tech recruitment but we also find great talents in other areas. You are welcome to contact us, you will feel the difference.",["Date","2022-02-05T13:47:59.000Z"],{"text":589,"timestamp":590,"topicId":5,"sentiment":12,"topicConfidence":190,"sentimentConfidence":88},"Any start ups or Legal start ups hiring? I landed myself an IT based Job not related to my field of study or interest but I am always on the look for a job suiting my education and interests. I am Alexander. I am 24 and a Bachelor of Law (LLB) ⚖️ from Ljubljana, Slovenia currently living in Tallinn ✅🇪🇺 completed internships in the EU Parliament and in the EU Personnel Selection Office (EPSO) ✅ Traineeships and Paralegal positions in Law firms ✅ Traineeship at the Slovenian MFA ✅ Speak English, Russian, Slovene, Serbian and Farsi. Learning Estonian at A1 ✅ Have an interest in corporate, IT and Banking law",["Date","2022-02-04T00:51:51.000Z"],{"text":592,"timestamp":593,"topicId":5,"sentiment":6,"topicConfidence":46,"sentimentConfidence":126},"Hi everyone! I am looking for new amazing colleagues in Tallinn 😊 If you are looking for a job in Customer Support in an international IT company and are a confident German and English speaker, you can apply directly via Linkedin or message me if interested but you have no Linkedin profile",["Date","2022-02-02T20:00:46.000Z"],{"text":595,"timestamp":596,"topicId":5,"sentiment":6,"topicConfidence":5,"sentimentConfidence":150},"WE ARE GROWING ✨ Looking for ambitious career-oriented people, either for entry-level or leadership roles. Do you wish to be part of a young and successful recruitment team, that is on a journey of growth? Shall we begin with what is awesome about this? PERKS - On top of good basis salary, you have limitless bonus opportunities - Modern office location (in pictures) and light co-working space with limitless coffee and tea - Team and company that appreciates good team spirit and positivness, but are also having a hard-working attitude and passion for recruitment - International company: Over 15 languages spoken, 4 offices in Europe, and more coming! - Internal growth opportunities - Awards,… More",["Date","2022-02-01T12:53:46.000Z"],{"text":598,"timestamp":599,"topicId":5,"sentiment":6,"topicConfidence":325,"sentimentConfidence":289},"Hello everyone! I recently ended up in Tallinn and absolutely love it here. Can anyone recommend companies\u002Fjobs for English native speakers? I am a certified English second language teacher, speak Russian, and have experience in travel and people services too. Any help is greatly appreciated. Thank you!",["Date","2022-01-31T08:29:22.000Z"],{"text":601,"timestamp":602,"topicId":5,"sentiment":6,"topicConfidence":342,"sentimentConfidence":101},"Looking for an English to FINNISH translator\u002Feditor for tourism-related texts. Texts are very easy and a good sense of humor and creative writing style (along with correct grammar, naturally!) are more important than former experience in the field. The amount of writing is rather small so the job is suitable for a bonus income.",["Date","2022-01-28T14:39:20.000Z"],{"text":604,"timestamp":605,"topicId":5,"sentiment":6,"topicConfidence":92,"sentimentConfidence":368},"Personal Assistant\u002Foffice\u002Fadmin We are a exciting\u002F growing company based in Estonia. We offer competitive salary and working conditions. The role is ful-time job, based in Kalamaja. We well established food producer. The role of is for an Office assistant is to help with all incoming invoices and emails from clients. Organising the customer orders and making productions sheets for the factory. Help grow the business working with MGT team. Requirements  - Russian\u002FEstonian\u002FEnglish spoken and written. - Skills in Excel and MS Office - Good skills on social media application - Some travelling is required in the Baltic region. - Person who has a passion to succeed and learn new things. Please send PM to this post or : - E: info@dalskitchen.com",["Date","2022-01-28T13:27:52.000Z"],{"text":607,"timestamp":608,"topicId":5,"sentiment":6,"topicConfidence":273,"sentimentConfidence":150},"I hope this post is not against the group rules :) Dear fellow expats, if you are looking for a job, perhaps, this is for you: Customer Solutions Expert - only English language is required https:\u002F\u002Fbit.ly\u002F3IJd3jg Junior Customer Success Manager - German and English language required https:\u002F\u002Fbit.ly\u002F3u4QG3F Feel free to contact me directly in LinkedIn ⤵️ https:\u002F\u002Fwww.linkedin.com\u002Fin\u002Fgabriela-silva-970aab12b I hope this can be helpful for someone 😀 Wishing you all a nice day!",["Date","2022-01-28T08:59:10.000Z"],{"text":610,"timestamp":611,"topicId":5,"sentiment":6,"topicConfidence":41,"sentimentConfidence":126},"Good evening! Any medical students here willing to do a good deed and help a fella out? I would need some help next week for around 25 min. I'm doing a test task for a job I'm applying for and you'd need to aid me in testing an app. I only need one person. In return we could come up with something surely, I can do some paper proofreading (I almost have a PhD but not necessarily in your field) or give a language lesson (Russian, Slovak, Finnish, beginner Estonian or beginner German), draw you an ugly picture in MS Paint, tell some cool spots to visit in Estonia or honestly whatever you come up with. I'm sure we could make a barter :D  I would be so grateful! Requirements:  -Speaks English… More",["Date","2022-01-27T19:45:07.000Z"],{"text":613,"timestamp":614,"topicId":5,"sentiment":615,"topicConfidence":46,"sentimentConfidence":42},"How come it  is so difficult to get a Job in Tallinn..  Anyone have a customer support Job English speaking for my wife should reach out .. she is tired of staying home doing nothing .. all companies seems to be looking for someone speaking Estonian ...  Please if you have a customer service or customer support job to offer, or you know someone recruiting , let me know please",["Date","2022-01-27T14:24:03.000Z"],"Negative",{"text":617,"timestamp":618,"topicId":5,"sentiment":6,"topicConfidence":165,"sentimentConfidence":315},"We have an opportunity for a Full Stack Engineer to join our IT Operations team, which is focused to participate in product and platform development - working closely with the revolving credit product team to develop new features, frameworks, and detailed application designs.  https:\u002F\u002Fcreditstar.bamboohr.com\u002Fjobs\u002Fview.php?id=136&source=aWQ9Mw%3D%3D #hiringnow #Creditstar #fullstackdeveloper #informationtechnology",["Date","2022-01-26T18:11:56.000Z"],{"text":620,"timestamp":621,"topicId":5,"sentiment":12,"topicConfidence":149,"sentimentConfidence":70},"Hi everyone, looking to fill three roles for a technical writer, a data analyst, and a full-stack developer with react and javascript experience in Tallinn. All work will be remote and flexible. If you know someone who might be interested, please message me.",["Date","2022-01-25T11:59:13.000Z"],{"text":623,"timestamp":624,"topicId":5,"sentiment":6,"topicConfidence":342,"sentimentConfidence":88},"Do you strive for a future where every country in the world benefits from bigdata for the good of society? Do you want to work at the forefront of mobile positioning data-based statistics and data analytics?  Then you are the one we are looking! Join Positiums global-minded team and help Mobile Positioning Data enable smart decisions all over the word!  Open positions:  Marketing Manager  DevOps Engineer System Architect GIS Specialist Backend Developer Frontend Developer Find out more:",["Date","2022-01-25T10:30:25.000Z"],{"text":626,"timestamp":627,"topicId":5,"sentiment":6,"topicConfidence":51,"sentimentConfidence":150},"Hello!!! dear Expats. My name is Karina, I'm from the Dominican Republic, I work as a Psychologist in Tallinn. I'm sharing my job web page if someone is interesting. http:\u002F\u002Fservi.cc\u002Fee\u002Fk5S6QWRP  I'm very happy to join this group. Ins. @tallinntherapy  Email: karinazippilli@gmail.com",["Date","2022-01-24T10:46:55.000Z"],{"text":629,"timestamp":630,"topicId":5,"sentiment":6,"topicConfidence":7,"sentimentConfidence":149},"Could someone please compare Move On with Adduco moving companies?  Thanks for sharing your opinion and experience as I will be needing to call one of them soon!",["Date","2022-01-21T18:46:00.000Z"],{"text":632,"timestamp":633,"topicId":5,"sentiment":12,"topicConfidence":92,"sentimentConfidence":219},"Calling all data science \u002F AI professionals! https:\u002F\u002Fwww.meetup.com\u002Ftallinn-ai-data-science-professionals\u002Fevents\u002F283004297\u002F",["Date","2022-01-20T18:32:49.000Z"],{"text":635,"timestamp":636,"topicId":5,"sentiment":12,"topicConfidence":212,"sentimentConfidence":101},"Hello, any Eng\u002FItalian speaker looking for job in Tallinn? (If yeah, dm me)",["Date","2022-01-20T06:41:33.000Z"],{"text":638,"timestamp":639,"topicId":5,"sentiment":6,"topicConfidence":33,"sentimentConfidence":382},"Hi guys, My company is looking for an English speaking accountant to join our behalves. It's a full time position with standard employment terms, classic jam. The company has treat me very well so far and I would like to promote this position for you here to help us out. In case of your interest, I'd be happy to make a referral for you to increase your chances. You can read about the position here: https:\u002F\u002Fcareers.konecranes.com\u002FKonecranes\u002Fjob\u002FTallinn-Accountant\u002F757590101\u002F Shall you be interested, hit me up and I'll help you with application.  Have a great Saturday! ✌️",["Date","2022-01-15T11:38:16.000Z"],{"text":641,"timestamp":642,"topicId":5,"sentiment":6,"topicConfidence":219,"sentimentConfidence":150},"Swag is the company where talent and teamwork are among the most important qualities. We’re looking for the next amazing, innovative and fast moving person, to reach success all together. We’re growing quickly and our field is one of the most interesting in the globe: cryptocurrencies. At the moment we are looking for a FRONTEND DEVELOPER: Expert: at least 4-5 years of experience. Independent: responsibilities are part of you. Ambitious: you want to grow. That’s it. Creative: you have imagination, an analytic mind and problem solving skills. Incredible: you have a plus on others. What you’ll do: - Work with the best technologies:   Jquery \u002F bootstrap \u002F HTML5 \u002F CSS Typescript, React React… More",["Date","2022-01-12T07:52:42.000Z"],{"text":644,"timestamp":645,"topicId":5,"sentiment":6,"topicConfidence":154,"sentimentConfidence":150},"Swag is the company where talent and teamwork are among the most important qualities. We’re looking for the next amazing, innovative and fast moving person, to reach success all together. We’re growing quickly and our field is one of the most interesting in the globe: cryptocurrencies. At the moment we are looking for a FRONT END DEVELOPER: Expert: at least 4-5 years of experience. Independent: responsibilities are part of you. Ambitious: you want to grow. That’s it. Creative: you have imagination, an analytic mind and problem solving skills. Incredible: you have a plus on others. What you’ll do: - Work with the best technologies:   Jquery \u002F bootstrap \u002F HTML5 \u002F CSS Typescript, React React… More",["Date","2022-01-12T07:50:57.000Z"],{"text":647,"timestamp":648,"topicId":5,"sentiment":12,"topicConfidence":79,"sentimentConfidence":24},"Hi Everyone, We are hiring DevOps Engineer at Creditstar, Estonia🚀. (Hybrid role). Let me know if this is something anyone of you could be interested in or your friends who might be interested to apply. https:\u002F\u002Fcreditstar.bamboohr.com\u002Fjobs\u002Fview.php?id=141 #hiringnow #Creditstar #fintech #techjobs #estonia #hybridworking",["Date","2022-01-11T14:09:25.000Z"],{"text":650,"timestamp":651,"topicId":5,"sentiment":6,"topicConfidence":126,"sentimentConfidence":315},"Hi everyone!!! We are looking for Senior Software Developers and Data Engineers in Estonia, Serbia and Romania! #softwaredeveloper #SeniorSoftwareDeveloper #estonia #romania #fullstackdeveloper #backenddeveloper #Dataengineer Requirements for Senior Software Developers: - Experience with web technologies; C# and PowerShell - Willing and able to learn new technology and open-source components to find the right tool for the job - Full-stack or back-end development experience - Self-motivated, collaborative, clear communicator - Passion for developer experiences which enable effective end-user experiences - 3 to 5 years of software development experience required - Bachelor's degree in Computer… More",["Date","2022-01-06T08:18:10.000Z"],{"text":653,"timestamp":654,"topicId":5,"sentiment":6,"topicConfidence":56,"sentimentConfidence":92},"Job opportunities for German speakers!  We are hiring a Knowledge Base Manager and Voice of Customer Insights Expert for our team. Check out more from the ads: Knowledge Base Manager - https:\u002F\u002Famplerbikes.bamboohr.com\u002Fjobs\u002Fview.php?id=102 Voice of Customer Insights Expert - https:\u002F\u002Famplerbikes.bamboohr.com\u002Fjobs\u002Fview.php?id=108 Although the ads are focusing on Berlin, then you could work also in Estonia as we have offices here as well 🙂  #hiring #jobs",["Date","2022-01-05T10:20:17.000Z"],{"text":656,"timestamp":657,"topicId":5,"sentiment":6,"topicConfidence":110,"sentimentConfidence":19},"Do you need help with IT\u002FICT recruitment? We help our clients find talents that make their business reach new levels. How about setting up a meeting where we can discuss how we can help you. The future begins at www.jobs4u.fi . Welcome!",["Date","2022-01-04T17:33:37.000Z"],{"text":659,"timestamp":660,"topicId":5,"sentiment":6,"topicConfidence":88,"sentimentConfidence":368},"HIRING BERLIN - French \u002F German \u002F Dutch \u002F Hebrew \u002F Czech \u002F Slovak \u002F Slovenian speakers Do you want to start a career Social Media? Are you searching for a new professional challenge? Do you speak French or German or Dutch or Hebrew or Czech or Slovak or Slovenian in a fluent level? This is the opportunity for you!! We are hiring Social Media Advisors for the most famous social media platform! We offer relocation package, training, a competitive salary, immediate start and many more benefits! To apply please send your CV to carolina@spotonconnections.com",["Date","2022-01-03T18:02:45.000Z"],{"text":662,"timestamp":663,"topicId":5,"sentiment":6,"topicConfidence":208,"sentimentConfidence":368},"Good evening!  Recently, I started doing my internship with Madsbay. Madsbay is all about #sustainablefashion.  My internship is mainly related building the company's marketing strategy. This month I am focusing on creating #buyerpersona of the company.  I would like to ask if anyone would be willing to have a short online interview with me regarding the #sustainablefashion. I would appriacte your support very much. 🙂 From here you can check the website.⬇️",["Date","2022-01-02T17:57:22.000Z"],{"text":665,"timestamp":666,"topicId":5,"sentiment":6,"topicConfidence":208,"sentimentConfidence":96},"Good evening!  Recently, I started doing my internship with Madsbay. Madsbay is all about #sustainablefashion.  My internship is mainly related building the company's marketing strategy. This month I am focusing on creating #buyerpersona of the company.  I would like to ask if anyone would be willing to have a short online interview with me regarding the #sustainablefashion. I would appriacte your support very much. :) From here you can check the website:",["Date","2022-01-02T17:50:05.000Z"],{"text":668,"timestamp":669,"topicId":5,"sentiment":6,"topicConfidence":18,"sentimentConfidence":61},"Hello dear Expats, the company where I work is looking for a candidate who owns the skills below. Please DM me your CV if you are interested to this position so I will make you the referral.  (Please note that in order to apply for this position, you need to have a good knowledge of Windows, that means you are aware of what Windows registry, Command prompt ecc... are.) Right to work in EU 2-4 years’ experience in a technical product support role  Customer Focus  Effective communication  Strong understanding of technical software products  Team and Collaborative Working Excellent verbal and written English  Proficiency with Microsoft Office Dependable time management skills  Excellent attention to detail  Quick learner  Excellent interpersonal skills  Ability to maintain a positive attitude in a fast paced work environment",["Date","2022-01-02T12:29:38.000Z"],{"id":5,"label":671,"color":672},"job, position, company","#f28e2c",[674,677,680,682,684,686,688,690,692,694],[675,676],"job",80,[678,679],"position",40,[681,679],"company",[683,679],"customer",[685,679],"hiring",[687,679],"marketing",[689,679],"team",[691,679],"speaker",[693,679],"field",[695,679],"experience"],"uses":{"params":["topic_id"]}}]}
