{"type":"data","nodes":[null,{"type":"data","data":[{"posts":1,"topic":252,"representativeWords":255},[2,9,15,18,23,28,33,37,41,45,50,54,58,62,66,70,74,78,81,85,89,93,97,101,104,107,110,114,119,124,127,131,134,137,142,145,148,151,155,159,162,165,169,172,175,179,182,185,188,192,195,199,202,205,209,213,216,219,222,225,228,231,235,238,241,244,247],{"text":3,"timestamp":4,"topicId":5,"sentiment":6,"topicConfidence":7,"sentimentConfidence":8},"Hello everyone😊  I offer the services of a sushi chef.  A great opportunity for you to put together personal sets for the holidays according to your preferences with a variety of types of nori,  lactose free products, fitness menu, baked, tempura. 🍣 I will take into mind all your wishes, it all depends on your imagination.🤤 Feel free to write in private messages  and we will prepare a festive table for you with a delicious Christmas discount.🤩🎉",["Date","2022-12-24T22:37:43.000Z"],18,"Positive",0.62,0.96,{"text":10,"timestamp":11,"topicId":5,"sentiment":12,"topicConfidence":13,"sentimentConfidence":14},"Does anyone know where to find English Muffins ( American breakfast biscuits??) In Tallinn?",["Date","2022-12-21T22:02:49.000Z"],"Neutral",0.53,0.93,{"text":16,"timestamp":17,"topicId":5,"sentiment":6,"topicConfidence":7,"sentimentConfidence":8},"Hello everyone😊 I offer the services of a sushi chef. A great opportunity for you to put together personal sets for the holidays according to your preferences with a variety of types of nori,  lactose free products, fitness menu, baked, tempura. 🍣 I will take into mind all your wishes, it all depends on your imagination.🤤 Feel free to write in private messages  and we will prepare a festive table for you with a delicious Christmas discount.🤩🎉",["Date","2022-12-21T20:12:30.000Z"],{"text":19,"timestamp":20,"topicId":5,"sentiment":6,"topicConfidence":21,"sentimentConfidence":22},"🥳 LAST CALL - some delicious traditional homemade sweet mince pies are available to order before Christmas 🥧 😋 for quantities and prices please send me inquiry. Pick-up is in Kristiine Tallinn or with Smartpost anywhere in Estonia.",["Date","2022-12-21T12:10:11.000Z"],0.52,0.92,{"text":24,"timestamp":25,"topicId":5,"sentiment":12,"topicConfidence":26,"sentimentConfidence":27},"Quick question, is there anyway I can find Medovik (Honey Cake) layers already prepared? I have to make one today, don't want to start from the scratch! 😅",["Date","2022-12-20T11:41:13.000Z"],0.69,0.54,{"text":29,"timestamp":30,"topicId":5,"sentiment":6,"topicConfidence":31,"sentimentConfidence":32},"Let the winter holidays be sweet - 2 ❤️ 🎄 Three jams of your choice ❄️ Clementine jam ❄️ Pine cone jelly 50 ml cell-shaped jar 5 € ❄️ Mulled wine jelly (Cabernet-Sauvignon) has a nice red color and can be used as a Christmas tree decoration. 40 ml round jar 5 € All jams are very good with cheese, coffee, ice cream or whatever you prefer. DM for order.",["Date","2022-12-16T10:42:23.000Z"],0.67,0.98,{"text":34,"timestamp":35,"topicId":5,"sentiment":6,"topicConfidence":36,"sentimentConfidence":14},"Hi, group❤️ I wish your Christmas be merry and sweet. Have fun with your friends and families, and taste my Christmas cakes. - A traditional one - heavy, dense, stuffed with nuts and candied fruit. - Another one -  beery, buttery and dark. No nuts, only fruits, and also a spelt flour. Both are made beforehand, and have been maturing and fed with an orange liqueur. They can stay fresh for at least 3 months. DM for order. Description and details are below in my comment. One 0.5 kg cake 23 € 40 € for 2 cakes.",["Date","2022-12-16T10:31:41.000Z"],0.72,{"text":38,"timestamp":39,"topicId":5,"sentiment":6,"topicConfidence":40,"sentimentConfidence":32},"Hello! Has anyone seen any frozen artichoke hearts being sold around the city ?  Would really love to incorporate them into my diet for various reasons 🥲😍 Something like this",["Date","2022-12-15T11:52:21.000Z"],0.47,{"text":42,"timestamp":43,"topicId":5,"sentiment":6,"topicConfidence":36,"sentimentConfidence":44},"Hello expats, I make cupcakes. If you want for some special occasion you can write me for more details. Always previous order.  This one is Christmas inspiration ⛄gingerbread muffin with vanilla buttercream.",["Date","2022-12-11T22:13:05.000Z"],0.57,{"text":46,"timestamp":47,"topicId":5,"sentiment":6,"topicConfidence":48,"sentimentConfidence":49},"Hello! Does anyone know if there is a bakery that sells dough or starter for these bad boys: ? They're a must have during Christmas time. 🤤",["Date","2022-12-06T09:12:46.000Z"],0.59,0.77,{"text":51,"timestamp":52,"topicId":5,"sentiment":6,"topicConfidence":53,"sentimentConfidence":36},"Hi, I am looking for a baker for a birthday cake. Please DM me 🙂 Update: Found one",["Date","2022-12-05T09:19:20.000Z"],1,{"text":55,"timestamp":56,"topicId":5,"sentiment":6,"topicConfidence":27,"sentimentConfidence":57},"Christmas 🎄 market is poppin' 🔥 Mulled wine, friikartulid, small pancakes and ice cold hands 🌟 Merry Christmas in advance!",["Date","2022-11-29T18:18:57.000Z"],0.97,{"text":59,"timestamp":60,"topicId":5,"sentiment":6,"topicConfidence":36,"sentimentConfidence":61},"Hi everyone 👋 I make cakes and sweets brazilian style. This upcoming Christmas i will be offering a special gift bag with cake jars and sweets (you can see it on this post). For orders please reach out to me on my instagram https:\u002F\u002Finstagram.com\u002Fsugarblisscakes_ee?igshid=YmMyMTA2M2Y=",["Date","2022-11-17T16:49:43.000Z"],0.55,{"text":63,"timestamp":64,"topicId":5,"sentiment":6,"topicConfidence":65,"sentimentConfidence":8},"Good morning everyone, I thought I'd share a fantastic recipe created by a group of Canadian Prarie farm ladies, their bran muffins can't be beaten. 🌤 P.S. I use oat bran that I purchase through Amazon de, And the buttermilk can be substituted with 946 ml of whole milk plus 3 tablespoons of lemon 🍋 mixed in. Pps. The batter lasts up to three weeks in the fridge, which means you can have fresh baked muffins whenever you want.",["Date","2022-11-14T08:39:04.000Z"],0.71,{"text":67,"timestamp":68,"topicId":5,"sentiment":6,"topicConfidence":21,"sentimentConfidence":69},"Last few spots left for Father's Day cupcakes 🥰🥰 Box of 4 €20 Box of 6 €30 Pick up only! Delivery schedule fully booked 🎉🎉 DM or WhatsApp 5897 3275",["Date","2022-11-11T11:22:28.000Z"],0.87,{"text":71,"timestamp":72,"topicId":5,"sentiment":6,"topicConfidence":13,"sentimentConfidence":73},"Hey fellas :) Are there any Christmas special products (sweets, chocolates, anything else) that you think would be worth (as in they're very tasty) to take as present for your family in the other side of the world?",["Date","2022-11-07T18:51:34.000Z"],0.91,{"text":75,"timestamp":76,"topicId":5,"sentiment":12,"topicConfidence":53,"sentimentConfidence":77},"For father day  Cupcakes 3,5€\u002F1pc Sushi cake 35€  Can pick up from Lasnamäe Raadiku",["Date","2022-11-07T16:21:50.000Z"],0.84,{"text":79,"timestamp":80,"topicId":5,"sentiment":6,"topicConfidence":53,"sentimentConfidence":32},"Two weeks ago I asked for recommendations for a great place to get birthday cake, thank you all for your recommendations, I ended up going with Denise Cunha who made me the best Brazilian birthday cake plus some individually packed cake for all my guests. I recommend her to anyone having a party anytime soon.",["Date","2022-11-04T17:04:45.000Z"],{"text":82,"timestamp":83,"topicId":5,"sentiment":6,"topicConfidence":48,"sentimentConfidence":84},"Random question but has anyone found a brand of pre-made seljanka that is semi-good quality in some supermarket? I always see those jars and I'm curious if some of the brands is semi decent or even properly tasty.  (Yes, i know i can cook it on my own, I also know some restaurants have really good ones, but that's not where the question is oriented :) )",["Date","2022-11-01T21:03:26.000Z"],0.63,{"text":86,"timestamp":87,"topicId":5,"sentiment":12,"topicConfidence":53,"sentimentConfidence":88},"May I know where can I get a sponge cake for birthday? (Please note I'm not referring to ice cake or a pastry)",["Date","2022-10-31T21:04:03.000Z"],0.81,{"text":90,"timestamp":91,"topicId":5,"sentiment":12,"topicConfidence":61,"sentimentConfidence":92},"Ordering Burger King from Wolt........ Just cook food if you're hungry lol.",["Date","2022-10-22T10:59:03.000Z"],0.6,{"text":94,"timestamp":95,"topicId":5,"sentiment":6,"topicConfidence":53,"sentimentConfidence":96},"Hi guys, where can I order great birthday cake in Tallinn.",["Date","2022-10-19T10:11:57.000Z"],0.82,{"text":98,"timestamp":99,"topicId":5,"sentiment":6,"topicConfidence":53,"sentimentConfidence":100},"Good day! Can anyone recommend a good place to buy a birthday cake? 🎂 Thanks in advance!",["Date","2022-10-17T10:45:27.000Z"],0.99,{"text":102,"timestamp":103,"topicId":5,"sentiment":6,"topicConfidence":26,"sentimentConfidence":88},"Hey expats! Any idea of a place that makes cakes and desserts with options like .. sugar free ...lactose free and special dietary requirements?  Google search does provide much results  Thanks",["Date","2022-10-13T07:41:19.000Z"],{"text":105,"timestamp":106,"topicId":5,"sentiment":6,"topicConfidence":92,"sentimentConfidence":57},"Hello Everyone,  I would like to inform you about new menu... Chef Emine; After years of conducting professionally in the sector of pastry and pastry products, and with a life experience in preparing natural, delicious and totally homemade pastry products for family and friends decided to share them with our costumers as well. We are honored to offer you many cookies and sweet and salty pastry products of the best quality, prepared specially for you in your birthdays, special occasions and meetings.",["Date","2022-10-01T14:38:55.000Z"],{"text":108,"timestamp":109,"topicId":5,"sentiment":6,"topicConfidence":21,"sentimentConfidence":73},"Hi! I do not really make recommendations for services but for Clean Kitchen I want to make an exception. We just received our first delivery and prepared our first day. Just wow, its a lot of food for just two people and super easy to make and taste amazing. Only downside is that the recipe card is in estonian (not sure if they provide english), google translate worked fine.  For those that do not know what to cook or hate doing groceries - use clean kitchen as it saves a lot of time and seems to be cheap too!",["Date","2022-09-18T17:08:03.000Z"],{"text":111,"timestamp":112,"topicId":5,"sentiment":6,"topicConfidence":113,"sentimentConfidence":57},"It's a birthday celebration! This Saturday! There'll be cake, live music and Cantillon on tap!",["Date","2022-09-06T21:15:17.000Z"],0.88,{"text":115,"timestamp":116,"topicId":5,"sentiment":12,"topicConfidence":117,"sentimentConfidence":118},"Are they giving cookies away? 🍪🍪🍪🍪",["Date","2022-09-03T18:15:24.000Z"],0.56,0.85,{"text":120,"timestamp":121,"topicId":5,"sentiment":6,"topicConfidence":122,"sentimentConfidence":123},"It's gonna be some late cooking for me 😁🍲🍛🍜🍝🥘",["Date","2022-08-28T11:44:54.000Z"],0.5,0.75,{"text":125,"timestamp":126,"topicId":5,"sentiment":12,"topicConfidence":7,"sentimentConfidence":13},"After a lot of request, we have added bun kebabs in our menu for Kristiine backyard cafe day on 27th of August (this saturday) 1100-1500 at Siidisaba 5. Bun kebabs in Pakistan are the direct competition to Vara pau in Bombay (Mumbai) that looks like a burger but looks can be deceiving 😈. Its an underdog in his own class! Some of the ingredients are: beef, chickpea lentils, eggs, cilantro, mint, green chilis, special chutney, onions, tomato and cucumber. I dare you to visit us at Siidisaba 5 on this Saturday and try the true taste of streets of Karachi and Bombay (again, Mumbai. My mother don't allow me to call it Mumbai still. She is from M...Bombay)",["Date","2022-08-25T21:01:06.000Z"],{"text":128,"timestamp":129,"topicId":5,"sentiment":12,"topicConfidence":130,"sentimentConfidence":113},"Tere Hommikust  Where could I buy high quality Açai powder,Strawberry powder and Raspberry powder ? Aitäh",["Date","2022-08-25T12:34:16.000Z"],0.45,{"text":132,"timestamp":133,"topicId":5,"sentiment":12,"topicConfidence":61,"sentimentConfidence":65},"This may be a very basic American question, but - has anyone found canned pumpkin puree here? Not pumpkin pie puree, which has spices and sugar already added, just the pumpkin?",["Date","2022-08-22T16:53:58.000Z"],{"text":135,"timestamp":136,"topicId":5,"sentiment":6,"topicConfidence":27,"sentimentConfidence":61},"Hey expats .. any idea where to find lactose free kohupiimakreem  the plain one(no added sugar or fruits..) If it does exist .. or maybe lactose free Greek yogurt  ? Thanks a lot",["Date","2022-08-14T08:06:09.000Z"],{"text":138,"timestamp":139,"topicId":5,"sentiment":140,"topicConfidence":27,"sentimentConfidence":141},"Dear internet. Can I please return these \"cookies\"? I don't like the taste... 😜🍪",["Date","2022-08-09T14:57:14.000Z"],"Negative",0.95,{"text":143,"timestamp":144,"topicId":5,"sentiment":140,"topicConfidence":13,"sentimentConfidence":118},"Why does every single sushi restaurant in town feel like they have to degrade sushi by adding cream cheese in literally every sushi offerings. It really is rare to come across a maki without cream cheese XD Unfortunately, it makes a lot of sushi taste the same…",["Date","2022-07-24T15:43:51.000Z"],{"text":146,"timestamp":147,"topicId":5,"sentiment":12,"topicConfidence":92,"sentimentConfidence":48},"I'd like to learn how to make Tteokbokki.   AA shop has the actual Korean rice cakes (https:\u002F\u002Faashop.ee\u002Fcollections\u002Frice-noodles-dried-foods\u002Fproducts\u002Fkorean-rice-cakes-stick-type-600g) but they don't appear to sell Korean fish cake.  Does anyone know where I might find the latter?",["Date","2022-07-24T12:15:05.000Z"],{"text":149,"timestamp":150,"topicId":5,"sentiment":6,"topicConfidence":61,"sentimentConfidence":32},"Just stumbled across this Frenchman baking croissants, pain aux raisins, baguettes etc at Härjapea 17 in Telliskivi! Thought people in this group might get as excited as I did at the prospect of sampling some authentic  🥐🥐🥐🤩",["Date","2022-07-15T15:23:58.000Z"],{"text":152,"timestamp":153,"topicId":5,"sentiment":12,"topicConfidence":13,"sentimentConfidence":154},"Muffin tray 8€ SOLD",["Date","2022-06-27T14:13:00.000Z"],0.89,{"text":156,"timestamp":157,"topicId":5,"sentiment":6,"topicConfidence":122,"sentimentConfidence":158},"Last chance to get fresh vegetables and Moroccan mint for Jaanipäev’s Mojitos!! Come in Keskturg tomorrow",["Date","2022-06-22T16:12:10.000Z"],0.51,{"text":160,"timestamp":161,"topicId":5,"sentiment":6,"topicConfidence":36,"sentimentConfidence":22},"Hi all!   I want to offer you some pastries.   Today there are:  1) 🍰Cheesecake in a jar - saber with nuts, currant cheesecake, lemon namelaka.   A very convenient dessert, as you can easily take it with you or with friends to nature. 2)🍓 Strawberry cheesecake - saber with coconut flakes, strawberry cheesecake, Coolie with strawberries.  3)🍰 Portion cakes - Honey apricot - honey cakes, apricot layer, apricot mousse, chocolate coating.   I will gladly answer everyone!",["Date","2022-06-22T15:19:47.000Z"],{"text":163,"timestamp":164,"topicId":5,"sentiment":12,"topicConfidence":27,"sentimentConfidence":14},"Does anyone know where I can find some dishes with crispy noodles? Like an American chopsuey?",["Date","2022-06-21T12:42:19.000Z"],{"text":166,"timestamp":167,"topicId":5,"sentiment":12,"topicConfidence":168,"sentimentConfidence":73},"FISKARS, Functional Form, Frying pan 26 cm, 10 €",["Date","2022-06-20T19:32:09.000Z"],0.48,{"text":170,"timestamp":171,"topicId":5,"sentiment":6,"topicConfidence":13,"sentimentConfidence":113},"WE ARE LOOKING FOR A COOK Whether for a day, two, a week or the end of the season. I know that my search can be as helpful as shouting in the desert, but if you're in trouble, try everything. In any case, if you want to work on an island with an acute vibe, you are welcome. There is a lot to work, but the reward is also worth it. Our head chef is Michelin-starred Moroccan chef Hicham Salami. It is good for him to gain new knowledge. If you are interested, call 54542020 or write to info@viirelaid.ee",["Date","2022-06-19T09:45:23.000Z"],{"text":173,"timestamp":174,"topicId":5,"sentiment":6,"topicConfidence":26,"sentimentConfidence":22},"Hi all! Today (17:00-18:00) will be available for sale:  - rhubarb pie - strawberries - lime with Patissier cream.  (1.6 kg 25€)  - eclairs with strawberry cream and lemon curd (2€\u002F1 piece).   A great option for a family vacation or a weekend getaway with friends.   Write in private",["Date","2022-05-27T11:44:39.000Z"],{"text":176,"timestamp":177,"topicId":5,"sentiment":6,"topicConfidence":178,"sentimentConfidence":57},"Hello!   I offer delicious homemade food. 1)  Open pie Kish Loren with bacon and apple.(25€)  2) Open pie rhubarb - strawberries with Patisier cream and almond flakes. (25€) 3) Biscuit roll with lemon curd and strawberry cream.(13€) 4) orange cake (12€) The weight of each product is more than 1 kg. For purchase inquiries, please get in PM.   Have a nice evening and peace everyone!💛💙",["Date","2022-05-14T18:00:16.000Z"],0.7,{"text":180,"timestamp":181,"topicId":5,"sentiment":6,"topicConfidence":36,"sentimentConfidence":32},"Vita has some amazing baked goods available. She stays in Kalamaja. If you have a gathering planned or feel like something sweet or savory this evening , let her know! 💜Hello!   Today I offer homemade cakes.   1) Cheesecake - nut cheese - chocolate layer with pear in caramel.   2) Open pie Kish Loren with bacon and apple.  3) Open pie rhubarb - strawberries with Patisier cream and almond flakes.  4) Rum rolls (with cognac).   6) Biscuit roll with lemon curd and strawberry cream.   For purchase inquiries, please get in PM.   Have a nice day and peace everyone!💛💙",["Date","2022-05-14T16:05:09.000Z"],{"text":183,"timestamp":184,"topicId":5,"sentiment":6,"topicConfidence":36,"sentimentConfidence":8},"Hello lovely friends 😊 I need a « Very light pastry flour » very light and soft, Can anyone suggest me a flour with these specifications please? Thanks for your helping🙏🏻😍",["Date","2022-05-05T19:46:48.000Z"],{"text":186,"timestamp":187,"topicId":5,"sentiment":6,"topicConfidence":53,"sentimentConfidence":141},"Hello friends! Can anyone recommend a good place to buy a delicious vegan cake\u002Fdessert? 😋 I've been looking for a while now but I just find the fruity ones over and over again (which are fine as well) but I'm just looking for different options this time. (Birthday cake) Thanks! 💖💖💖",["Date","2022-05-03T09:54:07.000Z"],{"text":189,"timestamp":190,"topicId":5,"sentiment":6,"topicConfidence":130,"sentimentConfidence":191},"Hi everyone, I hope you’re having a lovely day🙂 We're running the TLU student podcast and our discussion is “Should you become a Vegan?” and also talking about its impact on nutrition. We’re looking for vegans who are willing to be guest speakers on this episode of the Podcast. We intend to record between the 27th and 30th of April, so I agree we are on a very strained timeline 🥶. Please let me know in the comment section if anyone is interested and I’ll share the full details🥺. Here is a link to our podcast on Spotify: https:\u002F\u002Fopen.spotify.com\u002Fshow\u002F0TRMsX71Y5zwClgqNq907y?si=2vYKNcrjSDy_F5mQq7i3RQ The episode would be live📡 at the end of April and It would be an honour and privilege to have vegans on the episode for a balanced discussion🙏🏽. Looking forward to your responses. - Thanks in advance🤞🏽",["Date","2022-04-26T16:25:15.000Z"],0.94,{"text":193,"timestamp":194,"topicId":5,"sentiment":6,"topicConfidence":44,"sentimentConfidence":22},"Have someone seen Italian Easter cake here in Tallinn? Colomba Or in case something from your country you have seen here and it is not usual for Estonia, please share - I love culture exchange ;)",["Date","2022-04-23T11:36:40.000Z"],{"text":196,"timestamp":197,"topicId":5,"sentiment":12,"topicConfidence":21,"sentimentConfidence":198},"Hi guys, I would like to ask you if there’s any place to get Orthodox Easter cake\u002Fbun? It’s called Paska or Pasxa? 🫶🏼 Thanks in advance.",["Date","2022-04-20T07:10:28.000Z"],0.61,{"text":200,"timestamp":201,"topicId":5,"sentiment":6,"topicConfidence":36,"sentimentConfidence":65},"Hey guys. I'm going to blatantly use this space to spread the word about my mom's passion. She's a baker, who recently moved to Tallinn from Ukraine and would be happy if you try her homemade Easter cakes 🐣 “Original classic” - the traditional cake with rum-raisins and candied orange & grapefruit peel. The ingredients for this artisanal cake are: wheat flour, milk, butter, eggs, sugar, yeast, salt, raisins, sultanas, candied peels, vanilla, and brandy. Comes in 3 sizes: 120 g (​​3€) kid size, 240 g (5.5€) and 1.3 kg (30€) family\u002Fcorporate style. “Pear, mulberry & white chocolate” cake. Uses wheat flour, milk, butter, eggs, sugar, yeast, salt, vanilla, brandy, candied pear, dehydrated white… More",["Date","2022-04-19T14:32:29.000Z"],{"text":203,"timestamp":204,"topicId":5,"sentiment":6,"topicConfidence":122,"sentimentConfidence":31},"Hello (RUS bellow) I’m Valentyna. I’ve recently moved to Tallinn, and I’ll be happy if you try my homemade Easter cakes 🐣 “Original classic” - the traditional cake with rum-raisins and candied orange & grapefruit peel. The ingredients for this artisanal cake are: wheat flour, milk, butter, eggs, sugar, yeast, salt, raisins, sultanas, candied peels, vanilla, and brandy. Comes in 3 sizes: 120 g ( 3€) kid size, 240 g (5.5€) and 1.3 kg (30€) family\u002Fcorporate style. “Pear, mulberry & white chocolate” cake. Uses wheat flour, milk, butter, eggs, sugar, yeast, salt, vanilla, brandy, candied pear, dehydrated white mulberry and white chocolate. Comes in 3 sizes: 120 g ( 4.5€), 240 g (8€) and 1.3 kg… More",["Date","2022-04-19T07:49:06.000Z"],{"text":206,"timestamp":207,"topicId":5,"sentiment":6,"topicConfidence":65,"sentimentConfidence":208},"Hello everyone,  Again this weekend, I am offering crispy and delicious Jalebi.  It is a popular sweet snack in south and west Asia.. It is a melt-in-the-mouth dessert that can best be categorized as funnel cakes.  Please pre-book your order. 5€ - Jalebi ( includes 8-10 pieces) PM for more information and order details. https:\u002F\u002Fwa.me\u002F919769044486",["Date","2022-04-08T05:42:50.000Z"],0.9,{"text":210,"timestamp":211,"topicId":5,"sentiment":6,"topicConfidence":212,"sentimentConfidence":49},"Looking to make a big batch of kimchi tomorrow, has anyone noticed any grocery store with particularly nice Napa cabbage?",["Date","2022-03-26T15:04:39.000Z"],0.46,{"text":214,"timestamp":215,"topicId":5,"sentiment":6,"topicConfidence":53,"sentimentConfidence":57},"Hi guys! You've been proven super duper helpful on many occasions \u003C3  Just wanted to ask if you know any good birthday cake places? I want boiled milk cream \u003C3",["Date","2022-03-26T12:25:02.000Z"],{"text":217,"timestamp":218,"topicId":5,"sentiment":6,"topicConfidence":7,"sentimentConfidence":8},"Hello everyone, As Indian festival Holi is approaching, I would love to offer crispy and delicious Jalebi. It is a melt-in-the-mouth Indian dessert that can best be categorized as funnel cakes.  Available from this Friday until weekend.  Price:  5€ - Jalebi ( includes 8pieces) 7.50€ - Jalebi with Rabdi PM for more information and order details.",["Date","2022-03-16T19:49:35.000Z"],{"text":220,"timestamp":221,"topicId":5,"sentiment":6,"topicConfidence":168,"sentimentConfidence":100},"Hi ! Join us on friday for a lovely vegan potluck :) Good food and good mood only 🥳 https:\u002F\u002Ffb.me\u002Fe\u002FeI7NsnCRQ",["Date","2022-03-16T18:16:09.000Z"],{"text":223,"timestamp":224,"topicId":5,"sentiment":12,"topicConfidence":117,"sentimentConfidence":40},"A very off topic question but am I just blind or is there no supermarket here that offers flavored\u002Fsweetened creamers or even condensed milk? I've been to Prisma, Selver, Rimi etc. And none of them have anything besides the plain 10% creamer.  Of course, I may just not have waved my phone with Google translate enough to notice it but I would be glad if someone let me know a place I could find anything of the sort.",["Date","2022-03-04T13:56:17.000Z"],{"text":226,"timestamp":227,"topicId":5,"sentiment":12,"topicConfidence":168,"sentimentConfidence":65},"Be sure to double check the cheese before you buy it even if it’s not expired yet, it could be like this",["Date","2022-02-11T23:53:31.000Z"],{"text":229,"timestamp":230,"topicId":5,"sentiment":6,"topicConfidence":92,"sentimentConfidence":118},"We offer a very tasty Arabic semolina pie Basbousa for trial at an introductory price.  1pc = 1 euro Available with or without coconut For pickup details, please DM",["Date","2022-02-02T09:18:48.000Z"],{"text":232,"timestamp":233,"topicId":5,"sentiment":6,"topicConfidence":44,"sentimentConfidence":234},"Howdy, fellow expats! Does anyone have any idea where I could find something like this? It is supposedly called a \"sheet slicer\". I've got a bake-off coming up that I need to ace 👌",["Date","2022-01-30T17:04:31.000Z"],0.73,{"text":236,"timestamp":237,"topicId":5,"sentiment":140,"topicConfidence":130,"sentimentConfidence":118},"Am I the only one who felt badly the poorest  service of KFC here in Tallinn. In Dubai KFC provide a complete meal decently  with free paper plates Fries , coleslaw drinks ,sauces and lot of  buns . Here they give only bucket without any basic  accessories . There free drink refill is also pathetic water and sugar with no gas and taste. It feels so embarrassing  how they present food a bucket in a tray with mostly cold fries and chicken  and thats all.  No plates no spoon no extra glass no sauce but tiny paid one  , no coleslaw  no buns nothing . Will they ever do their quality better as per international  standard.  Or they always earn here for their name only",["Date","2022-01-25T22:36:55.000Z"],{"text":239,"timestamp":240,"topicId":5,"sentiment":12,"topicConfidence":53,"sentimentConfidence":154},"Recommendation on ordering a birthday cake for 30 people",["Date","2022-01-21T14:53:54.000Z"],{"text":242,"timestamp":243,"topicId":5,"sentiment":6,"topicConfidence":53,"sentimentConfidence":65},"Hello all. The cake lady is back again for another sweet weekend.  As some might know already, I am backing a new cake that I chose, every weekend, and I will be giving it away each Sunday to the first person who requests it during the week. I ask for a small fee of 2€ per cake, simply for covering some of the basic ingredients, the cardboard box, and to lock that cake for you. I am not able to do home delivery, so you would have to come and pick it up (city center, close to Viru Keskus).  Why am I doing this? https:\u002F\u002Fwww.facebook.com\u002Fgroups\u002F166477880066544\u002Fpermalink\u002F4746673485380271 I only request one thing in return from those who do take each cake home. Constructive feedback. I want to… MoreHello all, I have a dream, where I would be able to bring my love for baking into people's lives. Baking is one of my happiest moments and is where I love to spend my free time. However, I have not been able to do it as often as I would wish for, then we would have a whole new cake at home and we just can't consume as many cakes as I would love to… More bake :D For that reason, I'd love to share this love with you all. Here's my proposal: Every weekend I will be baking a new cake chosen by me and I will be giving it away each Sunday to the first person who requests it during the week. I will be asking a small fee of 2€ per cake, simply for covering some of the basic ingredients, the cardboard box,… More",["Date","2022-01-11T19:46:01.000Z"],{"text":245,"timestamp":246,"topicId":5,"sentiment":6,"topicConfidence":14,"sentimentConfidence":32},"Hey guys! Thank you so much for your support in my last post ( https:\u002F\u002Fwww.facebook.com\u002Fgroups\u002F166477880066544\u002Fpermalink\u002F4746673485380271\u002F ), as it seems the carrot cake was a winner 🤩 Thank you Ayush Kapadia  Since this week I haven't been feeling good I decided it's better if I skip this weekend baking session, and restart it next weekend. I'll post the info about the next cake early next week 😊 wishing you all an amazing and healthy weekend.",["Date","2022-01-07T16:24:31.000Z"],{"text":248,"timestamp":249,"topicId":5,"sentiment":12,"topicConfidence":250,"sentimentConfidence":251},"Where can I buy malt powder? (Malted milk or malt powder is a powdered gruel made from a mixture of malted barley, wheat flour, and evaporated whole milk powder. The powder is used to add its distinctive flavor to beverages and other foods, but it is also used in baking to help dough cook properly.)",["Date","2022-01-02T14:29:44.000Z"],0.65,0.83,{"id":5,"label":253,"color":254},"cake, birthday, strawberry","#9c755f",[256,259,262,264,266,268,270,272,274,276],[257,258],"cake",220,[260,261],"birthday",60,[263,261],"strawberry",[265,261],"cream",[267,261],"flour",[269,261],"sugar",[271,261],"candied",[273,261],"milk",[275,261],"sweet",[277,261],"powder"],"uses":{"params":["topic_id"]}}]}
