{"type":"data","nodes":[null,{"type":"data","data":[{"posts":1,"topic":295,"representativeWords":298},[2,9,14,19,24,29,33,37,41,46,50,55,59,62,67,72,75,79,84,89,94,98,103,108,112,116,119,124,128,133,136,140,144,147,151,154,158,162,167,170,173,178,181,184,187,191,194,197,200,204,207,210,214,219,222,226,229,233,238,242,247,251,255,258,261,265,268,271,274,278,282,285,289,292],{"text":3,"timestamp":4,"topicId":5,"sentiment":6,"topicConfidence":7,"sentimentConfidence":8},"Leitud võtmed ( \"Tehnika\" ühistranspordipeatuses ).",["Date","2022-12-04T10:08:06.000Z"],13,"Neutral",0.83,0.8,{"text":10,"timestamp":11,"topicId":5,"sentiment":6,"topicConfidence":12,"sentimentConfidence":13},"With Google translate How to go from Tallinn to JõhviGoogle tõlkimisteenus turistile Eestis rongiga ringi rändamisel 😀 Allikas: Facebook",["Date","2022-12-03T21:26:30.000Z"],0.08,0.61,{"text":15,"timestamp":16,"topicId":5,"sentiment":6,"topicConfidence":17,"sentimentConfidence":18},"Ära maga maha head võimalust ja pane ennast kirja juba järgmiseks aastaks! SAAD 20% SOODSAMALT ÕIGEAEGNE KATUSEHOOLDUS PIKENDAB KATUSE ELUIGA https:\u002F\u002Fwww.facebook.com\u002FKatusepesu-Hooldus-Grupp-104723035384660\u002F",["Date","2022-11-25T10:51:00.000Z"],0.95,0.81,{"text":20,"timestamp":21,"topicId":5,"sentiment":6,"topicConfidence":22,"sentimentConfidence":23},"OTSINGU LÕPP Täna, 21. novembril kella 14.30 paiku tõid tuukrid Noblessneri sadama akvatooriumis mere põhjast üles tagasi kaldale ööl vastu 19. novembrit teadmata kadunuks jäänud 18-aastase Simoni keha.  Sihtasutuse Kadunud juhtide ja otsingugrupi OPEROG staabi liikmete ja otsijate südametest sügav kaastunne Simoni lähedastele, sõpradele, klassi- ja koolikaaslastele! Südamest täname... ...kõiki OPEROG otsingugrupi vabatahtlikke otsijaid ja staabi liikmeid, kes alates laupäeva, 19. novembri õhtust kuni kella 05.30-ni pühapäeva hommikul ja terve pühapäeva, kuni hilise õhtuni, nii Simoni elukoha vaatlusel, tema võimalike viimaste liikumissuundade kohta info kogumisel kui neil kahel päeval… MoreEND OF THE SEARCH Today, the 21st on November at around 14.30, the divers brought Noblessner port aquarium back to the shore at night from the bottom of the sea. 18-year-old Simon's body, who went missing since November. Deepest condolences from the hearts of members and searchers of the Foundation Lost Leaders and Search Group OPEROG staff to Simon's relatives, friends, classmates and schoolmates! From the bottom of our hearts we say Thank you.. ... all volunteer searchers and staff members of the OPEROG search group, who will start on Saturday, 19. from the evening of November until 05.30 on Sunday morning and all Sunday until late evening, both observing Simon's place of residence, collecting information about his possible last directions of movement as on those two days Simon's landscape search in North Tallinn were a big help in the space! ... Searchers from OPEROG Tallinn-Harju County search group Liisa-Indra, Ellut, Roman and Karl in finding the passport belonging to the missing young man and retrieving it from the sea, which gave the port aquarium a new point in the search! ... everyone, in total more than 6 thousand people who helped share Simon's search notice on social media! ... The foundation's Lost 24\u002F7 information phone 6616 776 received a lot of callers to report Simon's alleged movement! ... Police officers of west harju police station! ... Marina Port Noblessner, BLRT Kinnisvara OÜ, Elu24 Postimees for their quick cooperation in the search of factual evidence! Updated on 21.11.2022 at 15:57, SA Missing CEO Aare Rüütel. Dear searchers, sharers, all assistants and SA lost telephone callers! We finished the search on the land, the search continues from the sea, the passport found in the water at Noblessner port aquarium by searchers of OPEROG search group last night belongs to the missing young man. A big thank you to everyone who has been helpful! Updated on 20.11.2022 at 14.18. Aare Rüütel, SA Lost CEO. ATTENTION! WE ARE ASKING FOR THE HELP OF ALL PEOPLE! On the night of Saturday, 19.11.2022, 18-year-old Simon was lost in Tallinn (photos 1-2). Simon passed away on the night around 19. on November around 00.10, one of my friends near the Hollywood club, with the intention of walking to their home in the Kopli-Sitsi area in northern Tallinn, but the young man did not make it home and since then his close ones or his schoolmates have not been able to contact Simon Bored. Simon has never been missing in this way before, his loved ones and friends are very concerned about the young man's life and health.\\n According to Simon's relatives, the young man was last contacted at around 2 am, but information about Simon's location and situation remained unclear. As a result, Simon's life may have been in direct danger, according to his relatives. The characteristics of 18-year-old Simon: *length 185 cm, *body build skinny, *hair brown, long, *wearing a grey jacket *wearing dark pants and black boots, *knows the glasses. PLEASE EVERYONE who is in the photo and described above 18 year old Simon from Saturday 19th. about the night of November: *has seen a club Hollywood - Old Town - Baltic Station - Noblessner - Kalamaja Park area in Tallinn or *has seen moving around in some other areas in Tallinn, *has seen 1-2 young men in the photos visiting any gas station in Tallinn on 19.11.2022 or *know something about Simon's CURRENT LOCATION report this IMMEDIATELY to SA Missing 24\u002F7 on 661 6776. Anonymity is guaranteed to the informant. Thank you very much! Aare Rüütel, SA Lost CEO, tel. 6616 776. __________________________________________ If your loved one is missing, don't leave it waiting and report immediately: SA Missing 24\u002F7 phone is 6616 776. Everyone can support the search for unknown missing people: references to bank accounts and donation phone numbers can be found lost on our website.\\n ee Blessed is every gift and the giver! SA The Lost is a foundation independent of public authority, being financially supported as a citizen association only by citizens, whose common desire is to help search and find people missing in Estonia. SA does not pay bills for searches for missing loved ones. You can support SA Missing Action by coming to search with us, helping to buy search equipment, or supporting us with a monthly permanent donation. The SA Missing GOAL is to search for people who are missing unknown by doing so in four areas: * Operational Life Saving Search - OPEROG Operational Search Team, *missing children - KatrinAlert, *doing a review of old cases, *prevention work. Together we will help and save! The golden rule for people under the stars is: whatever you want people to do to you, do unto them.",["Date","2022-11-20T14:12:35.000Z"],0.63,0.67,{"text":25,"timestamp":26,"topicId":5,"sentiment":6,"topicConfidence":27,"sentimentConfidence":28},"Moikka, itse olen jo vanhempi äijä, mutta poikani perheineen puolison ja pienten tyttöjen kanssa ovat tulossa vierailulle Tallinnaan. Nyt olemme vinkkejä vailla. Pliis help.  ps käyvät ennen joulua ja Raatihuoneen tori on jo listalla.",["Date","2022-11-19T21:01:37.000Z"],0.13,0.73,{"text":30,"timestamp":31,"topicId":5,"sentiment":6,"topicConfidence":32,"sentimentConfidence":8},"Casting. Otsin Moonika Siimetsa filmi  MUST AUK, ameeriklannat, blondi, kes oskaks eesti keelt võib rääkida aktsendiga, vanus 22-35. Huvilistel palun saata värske foto koos kontaktandmetega toomvappiret@gmail.com   MUST AUK.",["Date","2022-11-17T18:58:56.000Z"],0.15,{"text":34,"timestamp":35,"topicId":5,"sentiment":6,"topicConfidence":36,"sentimentConfidence":7},"tere, olen Zoya Ukrainast, elan Tallinnas juba 5 kuud, olen puudega inimene, kasutan ratastooli, Eesti võttis mind väga hästi vastu, olen Thomas Erikule väga tänulik kuni lõpuni oma elust elasin Euroopa hotellis, mille eest olen väga tänulik hetkel, kui mulle Tallinnas tuba anti, väga hea, aga palun abi toa sisustamisel, vajate veekeetjat, triikrauda , aeglane pliit, pott, nuga, kulp, pann, pump vaia pumpamiseks. Nad maksavad meile raha, kuid me kulutame palju ravimitele ja ma kasutan võimalust tänada Andrei Pšenitšnõi tasuta ratastooli pakkumise eest ja Alexandra Polaki ratastooli hankimise eest Todale varuosade mots telefon. 56345793, 56454094. tänan teid kõiki juba ette",["Date","2022-11-17T17:06:56.000Z"],0.52,{"text":38,"timestamp":39,"topicId":5,"sentiment":6,"topicConfidence":23,"sentimentConfidence":40},"Pane ennast kirja järgmiseks aastaks!Saad 20% SOODSAMALT!!!!  Ära Maga Maha!!! Õige katusehooldus pikendab Katuse eluiga!!! https:\u002F\u002Fwww.facebook.com\u002FKatusepesu-Hooldus-Grupp-104723035384660\u002F",["Date","2022-11-10T10:37:03.000Z"],0.68,{"text":42,"timestamp":43,"topicId":5,"sentiment":6,"topicConfidence":44,"sentimentConfidence":45},"Just forwarding :)Üürile anda armas kodu ilusas Männimetsas.  Kõrged laed ja valgusküllasus muudab kodu väga hubaseks. Paarismaja asub Tallinna piiril.  Värskelt renoveeritud 2022 aastal.  * Vesipõrandaküte * Oma aia ala * Ümberringi ilus loodus Madalad kommunaalkulud, talvel ca 120 €\u002F suvel 70.",["Date","2022-11-05T20:53:31.000Z"],0.57,0.74,{"text":47,"timestamp":48,"topicId":5,"sentiment":6,"topicConfidence":22,"sentimentConfidence":49},"Tere toredad inimesed! Mina Olen Saleh. Õpin Eesti keelt. Nüüd olen B1 tasemel. Mul on üks harjutus teha. Ma pean ühe Andrus Kivirähki raamatu tõlkima.  Te näete raamatu pealkirja pildilt. Kui kellelgi on üks nendest raamatutest, palun andke mulle teada. Ma sooviksin seda laenata kuni kaheks kuuks. Palun DM.  Suur tänu!",["Date","2022-10-31T09:52:45.000Z"],0.79,{"text":51,"timestamp":52,"topicId":5,"sentiment":6,"topicConfidence":53,"sentimentConfidence":54},"Доброго времени суток, всем жителям прекрасного острова Saaremaa, и их постоянным гостям ! Хочу порекомендовать себя всем тем, кто ищет добросовестного работника, либо необходима помощь в сфере сварочного производства . Зовут меня Олександр, проживаю со своей семьей в Kuressaare.  Являюсь специалистом сварочного дела; Много лет до начала войны работал в Украине Сварщиком-Монтажником-Сборщиком,также были обьекты в Польше, прошел повышение квалификации в Нарве. Имею сертификаты по сварке , такие как; MIG.MAG.TIG 135, 136, 141.Отлично зарекомендовал себя в работе с ручной электродуговой сваркой (MMA-111). Так сложилось что , после двух месяцев работы на одном предприятии, пришлось пойти в… More",["Date","2022-10-28T03:38:12.000Z"],1,0.87,{"text":56,"timestamp":57,"topicId":5,"sentiment":6,"topicConfidence":58,"sentimentConfidence":8},"Hey!  Ma olen natuke aega juba mõelnud juba selles suunas ning siin on minu küsimus. Ma olen juba mõnda aega olnud laulukirjutaja, kuid kahjuks ei ole minu võimuses - vähemalt veel- nende lindistamine ja masterdamine. Kas minu tutvusringkonnas oleks mõni isik, kes soovib kätt proovida koos laulude aretamisel?  Täpsemalt: Otsin isikut, kellel on võimekus luua lauludele tausta, lindistada ning masterdada laule.  kasuks tuleb: Laulude kirjutamise oskus\u002Fsoov või ideed, isegi kui ei oska neid lauludesse sisse kanda. kirjutan peamiselt inglise keeles, kuid eesti keel ei ole välistatud. Huvi korral kirjutage mulle palun privasse. Arutame zanreid ja võin saata mõned laulud, mille kallal hetkel nokitsen. Kui teate kedagi, kellele see pakkumine meele järgi võib olla, siis palun saatke neile edasi!",["Date","2022-10-26T20:04:50.000Z"],0.56,{"text":60,"timestamp":61,"topicId":5,"sentiment":6,"topicConfidence":12,"sentimentConfidence":8},"GrassEesti.ee",["Date","2022-10-21T13:09:54.000Z"],{"text":63,"timestamp":64,"topicId":5,"sentiment":65,"topicConfidence":27,"sentimentConfidence":66},"Hello fellow expats,  as you know I’m leaving Tallinn - and my lovely place is up for grabs. The location is unbeatable imo, close to Balti Jaam, just outside Old Town, you can basically walk everywhere. View of Old Town and Stenbock Maja from the balcony 🤩 Pets should be ok, I was allowed to take my dog in, after I moved in.  The building is really good insulated, which should be useful for this winter and the upcoming energy costs. Even in the last two very cold winters, I did not always need to turn on the heating in my flat, building heating was enough.  Parking spot in garage and a dry spacious storage are included as well.  I hope it goes into good hands, loved living there 💜 https:\u002F\u002Fwww.facebook.com\u002Fgroups\u002F299056793537765\u002Fpermalink\u002F5171347919641937\u002F?sale_post_id=5171347919641937Saadaval on imeline valgusküllane korter otse Balti jaama ja Kunstiülikooli vahel. Tegemist on hubase  2-toalise korteriga (52 m2) koos rõduga.  Korteris on olemas kõik eluks vajalik koos mööbliga ja on vaba alates novembrist. Tegemist on hea planeeringuga korteriga mis sisaldab:  - avarat elutuba koos pool avatud  köögiga  + juurdepääs rõdule… More imelise vaatega Stenbocki majale ja Toompeale - suur eraldiseisev magamistuba - wc ja vannituba - ruumikas esik - panipaik keldris - korteri juurde kuulub ka parkimiskoht, mis on omaette suur väärtus kesklinnas. Kommunaalkulud on ca 70-110€ kuus. Kommunaalkulud lisanduvad üürile Ühe kuu üür 780.-€ Tagatisraha 1500.- € Tegemist on suurepärase korteriga imeheas asukohas. Kôik eluks vajalik on kohe käe-jala juures ning vanalinn on otse üle tee.  Huvitunutel palun messengeris otse minuga ühendust võtta. Vastan vajadusel lisaks eesti keelele ka norra ja inglise keeles.",["Date","2022-10-20T14:27:54.000Z"],"Positive",0.82,{"text":68,"timestamp":69,"topicId":5,"sentiment":6,"topicConfidence":70,"sentimentConfidence":71},"Hei! kõigile kellele meeldib hästi süüa! Tasuta 4-käiguline õhtusöök Gastro Studi LIVE köögis on sind ootamas! 🥳🥳 Sellel neljapäeval! Peakokk serveerib kõike kohapeal. Võta sõber kaasa ja broneeri koht. 😊 20.10 kell 18:00 - https:\u002F\u002Ffienta.com\u002Fet\u002Fpromo-halloweenYouSooduskoodiga “Akadeemia1010” on registreerumine tasuta. Muidu on pilet 25€",["Date","2022-10-19T15:08:49.000Z"],0.84,0.51,{"text":73,"timestamp":74,"topicId":5,"sentiment":6,"topicConfidence":40,"sentimentConfidence":66},"Armsad fb sõbrad, kirjutan lootuses, et keegi oskab edasi aidata. Felixi klassis õpib 7-aastane Ukraina poiss Miron, kes põgenes siia sõja eest koos oma emaga. Nad on pärit Harkovist, mida pommitatakse igapäevaselt sõja algusest alates. Mironi ema käib tööl kohas, kus on ka õhtused ja öised vahetused ning Miron peab kooli minema ja koolist tulema enamasti üksinda.  Hetkel elavad nad Kaupmehe tänaval, kust on lihtne kooli - Prantsuse Lütseumi - jalutada. Kuu aja pärast peavad nad aga uue elupaiga leidma. Mironi ema Ludmila palk võimaldaks kardetavasti tasuda vaid kommunaalide eest.  Ehk oskab keegi siiski aidata - Ludmila vajaks elamist, mis ei jääks liiga kaugele kesklinnast, et laps saaks iseseisvalt kooli liikuda. Tegemist on väga tubli ja toreda poisiga, kes õpib vapralt samaaegselt eesti ja prantsuse keelt.",["Date","2022-10-14T05:16:37.000Z"],{"text":76,"timestamp":77,"topicId":5,"sentiment":6,"topicConfidence":66,"sentimentConfidence":78},"Ei miski tuju nii rõõmsaks tee, kui kaunilt lakitud küüned! Pakun nii klassikalist kui geellakiga maniküüri Keilas. Kirjuta julgelt oma soovidest mulle messengeri.  Elu pole täiuslik, kuid su küüned võivad olla.",["Date","2022-10-12T20:28:23.000Z"],0.77,{"text":80,"timestamp":81,"topicId":5,"sentiment":6,"topicConfidence":82,"sentimentConfidence":83},"Head päeva, Antikvariaat Tallinnas otsib ekspedeerijat antiikmööbli toimetamiseks Hollandist Eestisse ja ka Itaaliast Eestisse, tore oleks leida lisakoormat. Palun kirjutage whatsapp +31634064697.",["Date","2022-10-06T21:59:52.000Z"],0.27,0.85,{"text":85,"timestamp":86,"topicId":5,"sentiment":6,"topicConfidence":87,"sentimentConfidence":88},"SÜGISE HINNA BOMM!!! Pane ennast kirja  Oktoobri kuuks!Saad hea SOODUSE . Ära Maga Maha!!! Õige katusehooldus pikendab Katuse eluiga!!! https:\u002F\u002Fwww.facebook.com\u002FKatusepesu-Hooldus-Grupp-104723035384660\u002F",["Date","2022-10-02T15:21:40.000Z"],0.94,0.76,{"text":90,"timestamp":91,"topicId":5,"sentiment":65,"topicConfidence":92,"sentimentConfidence":93},"Hello hello, Just like Kaubamaja Osturalli comes once in a while, so does our Capoeira Open Classes.  So feel free to come visit and train with us during our open week.  I hope I see you all soon  https:\u002F\u002Ffb.me\u002Fe\u002F26xkVZEd3",["Date","2022-09-26T17:11:56.000Z"],0.06,0.9,{"text":95,"timestamp":96,"topicId":5,"sentiment":65,"topicConfidence":12,"sentimentConfidence":97},"Hello hello, Just like Kaubamaja Osturalli comes once in a while, so does our Capoeira Open Classes.  So feel free to come visit and train with us during our open week.  (Ahmed Saeed I'm sorry but I needed a superior shopping place to make the point)  I hope I see you all soon  https:\u002F\u002Ffb.me\u002Fe\u002F26xkVZEd3",["Date","2022-09-26T17:11:24.000Z"],0.75,{"text":99,"timestamp":100,"topicId":5,"sentiment":6,"topicConfidence":101,"sentimentConfidence":102},"(ENG, RUS 👇)  ‼️‼️‼️ Viimane võimalus osaleda vinges auhinnaloosis! 😊🤩Juba kuu viimasel päeval kell 12 loosime välja 3 inimesele kaks 72-tunni Tallinn Cardi!  Soovid oma eesti keelt enam kui 50 Tallinna muuseumi ja muud vaatamisväärsust tasuta külastades rikastada ja saada selleks ka tasuta sõidu 🚎 ühistranspordis?  Loosimises osaleda on lihtne! ✍️ Kirjuta kommentaaridesse, mis on Sinu lemmikkoht Tallinnas ja hakka meie lehe jälgijaks. Võitjatest anname teada Tallinna eesti keele maja facebooki lehel, kust saad jooksvalt ka väärt infot eesti keele harjutamiseks loodud tasuta ürituste kohta.  Milliseid võimalusi 72-tunni Tallinn Card Sulle pakub, loe lehelt www.tallinncard.ee  ‼️‼️‼️ Last… More",["Date","2022-09-23T07:23:10.000Z"],0.42,0.65,{"text":104,"timestamp":105,"topicId":5,"sentiment":6,"topicConfidence":106,"sentimentConfidence":107},"Teretulemast www.komisjonikaubamaja.ee \u002F Tallinn, Kadaka tee 56c \u002F Kangas & Nööp uksest \u002F 2 korrus \u002F E-R 10-18 \u002F L 10-15 \u002F  5640383 \u002F info@komisjonikaubamaja.ee",["Date","2022-09-20T20:08:36.000Z"],0.07,0.91,{"text":109,"timestamp":110,"topicId":5,"sentiment":6,"topicConfidence":53,"sentimentConfidence":111},"Ootame Teid alates 18:00. Tule naudi Head Vesipiipu, kokteile, snäkke, ja veeda õhtu kvaliteetselt. Võimalik mängida ka erinevaid lauamänge. Tule naudi Head Vesipiipu, kokteile, snäkke, ja veeda õhtu mõnusalt. 19:30 LIVE FOOTBALL Tottenham Hotspur vs Leicester City SUNDAY 18.09.22 EUROBASKET FINAL ( Pühapäeval Ettebroneerimisel +372 58048340 ). 18:15 Third place GAME GERMANY vs POLAD 21:30 FIRST place GAME SPAIN vs FRANCE",["Date","2022-09-17T13:28:56.000Z"],0.86,{"text":113,"timestamp":114,"topicId":5,"sentiment":6,"topicConfidence":115,"sentimentConfidence":18},"Milli Kültür Günleri kapsamında Eestimaa Rahvuste Ühendus bir etno fuarı düzenliyor. Oldtown Meydanı çeşitli kültürel programa sahip çok sayıda etnik azınlık kültürel topluluğa haftasonu (17-18 Eylül 2022) ev sahipliği yapacak. Bizde Estonya-Türkiye Dostluk Derneği olarak Türkiye'yi temsil edeceğiz. Fuarda gelenksel sanatlarımızı görebilir, Ebru workshop'una katilabilir, geleneksel Türk mutfağını tadabilirsiniz. Cumartesi günü saat 11.30'da Aşık Veysel türkülerimizi dinlemek için konser alanına bekliyoruz.  Standımıza sevgili vatandaşlarımızı ve Türk kültürünü merak eden tüm dostlarımızı bekliyoruz. 💐 As part of the National Culture Days, Eestimaa Rahvuste Ühendus is organizing an elegant… More",["Date","2022-09-15T18:22:20.000Z"],0.58,{"text":117,"timestamp":118,"topicId":5,"sentiment":6,"topicConfidence":40,"sentimentConfidence":66},"Meriino riided soodushinnaga! Tere! Tellin oma 1,5 aastasele pojale meriino riided Taani kvaliteetbrändilt Mikk-Line, kuna olen taganud seal hea allahindluse. Minimaalne tellimus on seal aga päris suur. Äkki on keegi, kes tahaks minuga liituda? Näiteks meriino kombinesoon kodulehel on 80 eur, minu soodushind on 49. Lumekostüüm on umbes 130 eur, minu soodushind 59-70 eur. Palun vaadake: https:\u002F\u002Fwww.mikk-line.com\u002F palun jaga seda postitust oma sõpradega",["Date","2022-09-09T16:31:17.000Z"],{"text":120,"timestamp":121,"topicId":5,"sentiment":6,"topicConfidence":122,"sentimentConfidence":123},"Today! Kumbia Palavik @ Paljasaare Rannakas  El maestro, Lucho Bermúdez!! https:\u002F\u002Fopen.spotify.com\u002Ftrack\u002F6zDNIslMTDm2LT50XLRPR5?si=CNvmDjSERwi5hCxFLVu8EQ&utm_source=copy-link",["Date","2022-09-09T14:39:51.000Z"],0.88,0.72,{"text":125,"timestamp":126,"topicId":5,"sentiment":65,"topicConfidence":127,"sentimentConfidence":54},"🌞🏖🍹Kurb, et puhkus ja ilus suvi läbi said ? Ära tuppa nukrutsema jää, vaid tule hoopis meie kuubalasest 🇨🇺 treeneriga TASUTA salsat ja bachatat proovima – need lõbusad tantsud toovad su ellu kuhjaga head energiat ning eksootilist vibe’i ka siis kui väljas külm ja pime ning uusi tuttavaid ja vahvaid pidusid ja tantsureise saad veel pealekauba! 🕺💃🍹🥳 🚩 Septembris uute algajate kursused -50% tavahinnast! 👉 Täpsem info: https:\u002F\u002Ffb.me\u002Fe\u002F1FROFSwUI 🌞🏖🍹Feeling sad because summer and vacation are over?   Then come try salsa and bachata for FREE with our Cuban 🇨🇺 trainer - these fun dances bring a lot of good energy and an exotic vibe to your life even when it's cold and dark outside. And on top of that all you will get new friends and cool dance parties! 💃🕺🍹🥳 🚩 Courses for new beginners in September -50% of the regular price!  👉 More info: https:\u002F\u002Ffb.me\u002Fe\u002F1FROFSwUI",["Date","2022-09-04T06:55:25.000Z"],0.3,{"text":129,"timestamp":130,"topicId":5,"sentiment":65,"topicConfidence":131,"sentimentConfidence":132},"Imetlen oma Hiiumaad väikest, naeratus suul. A must visit to the little island of Hiiumaa.❤️",["Date","2022-08-31T06:59:33.000Z"],0.38,0.96,{"text":134,"timestamp":135,"topicId":5,"sentiment":65,"topicConfidence":82,"sentimentConfidence":111},"Tere! Olen 14 aastane neiu, armastan lapsi ja loomi. Oskan süüa teha, koristada, ja olen lapsele hea mängukaaslane. Kui teil on Soov näiteks teatrisse või kinno minna ja on vaja lapse- või loomahoidjat, võite alati  julgelt messengeri kirjutada. Räägin ka inglise ja prantsuse keelt. Hello! I’m a 14 year old girl, I love kids and pets. I can cook, clean, and I’m a good playmate for kids. If for example you wish to spend an evening at the theatre or at the cinema, and you need a pet or babysitter,  you can always write to me on messenger. I speak Estonian, English and French.",["Date","2022-08-13T20:21:18.000Z"],{"text":137,"timestamp":138,"topicId":5,"sentiment":6,"topicConfidence":139,"sentimentConfidence":18},"Tere tulemast meie uude Ravintolasse https:\u002F\u002Fwww.facebook.com\u002FRoyal-Cuisine-108989121850931\u002F",["Date","2022-07-31T11:40:38.000Z"],0.44,{"text":141,"timestamp":142,"topicId":5,"sentiment":6,"topicConfidence":143,"sentimentConfidence":66},"Tere tulemast meie uude restorani https:\u002F\u002Fwww.facebook.com\u002FRoyal-Cuisine-108989121850931\u002F",["Date","2022-07-29T12:29:02.000Z"],0.24,{"text":145,"timestamp":146,"topicId":5,"sentiment":6,"topicConfidence":71,"sentimentConfidence":49},"Tere, mu nimi on Marlon, ma olen kolmkümmend viis aastat ja mulle väga meeldib ilus ning huvitav eesti keel! Ma sooviksin sel nädalal ja järgmisel nädalal ka kellega kohtuda, et eesti keelt rääkides mu oskuse parandada. Kuigi ma olen pärit Brasiiliast, ma elan Poola lõuna pool ja praegu sõidan ma bussiga Tallinna. See pole mu esimine viibimine Tallinnas, sest ma olen juba seal käinud kaksi aastat tagasi. Seekord ma jään Eestisse kaheksaks päevaks ja ma väga tahaks inimestega suhelda, kes eesti keelt oskavad (muidugi kutsun välismaalasi ka kes seda suudavad nagu mina) et midagi juues ning süües kõigest juttu ajada proovida. Kas see ettepanek kellegi huvitab? WhatsAppis ka võiksime kõnelda, et teada saada, millal sobib mind linnas näha. Head aega!",["Date","2022-07-27T21:58:48.000Z"],{"text":148,"timestamp":149,"topicId":5,"sentiment":6,"topicConfidence":150,"sentimentConfidence":83},"Järgmised ringid! Värske puhtalt (orgaaniliselt) kasvatatud talutoodanguga Sulle koju kätte! Tartu\u002FTartumaa reedel 29.07 🥬 Tallinn\u002FHarjumaa pühapäeval 31.07 🌶 Kohila-Rapla-Türi-Paide-Põltsamaa pühapäeval 31.07 🥒 Võrumaa ja Põlvamaa ja Otepää piirkond jooksvalt 🥦 Hetkel sortimendis: Värske kartul 2 EUR\u002Fkg, värske kapsas, värske piklik punapeet, värske porgand kimbus, suvikõrvits, suur suvikõrvits 1,50 EUR\u002Fkg, lühike kurk, värske till, KALE ehk lehtkapsas, värske petersell, värske mugulsibul, värske MUGULSIBULA MIX, värske küüslauk, värske kaalikas, värske nuikapsas, värske SOOLAKURK, värske mesi ... Hinnakiri \u002F sortiment \u002F tellimuse mugav esitamine  www.talutoodang.ee\u002Ftalutooted 🥕  Kohtumiseni! Päikest ☀️ Jaano & co Hannuste talu www.talutoodang.ee",["Date","2022-07-26T15:50:11.000Z"],0.46,{"text":152,"timestamp":153,"topicId":5,"sentiment":6,"topicConfidence":53,"sentimentConfidence":123},"Head Eesti inimesed, Kutsume teid osalema meie alternatiivhariduse suvepäeval (30.07).  Meil on palju kohalikke ja välismaiseid osalejaid, kes kogunevad, et kaaluda võimalikke alternatiive tavakooliõppele ja teie panus on ülioluline!   Ootame teid ideid ja kogemusi jagama!!",["Date","2022-07-15T13:59:01.000Z"],{"text":155,"timestamp":156,"topicId":5,"sentiment":6,"topicConfidence":157,"sentimentConfidence":8},"🔸🔹ON REEDE!🔹🔸 🔹 ELVIS on jätkuvalt Sõpruse kahel ekraanil, seda nii Noblessneri kui Vanalinna valikutes.  🔸ALLJUMALAD oma ilus ja sünguses on vaadatav Sõpruse Vanalinna saalis laupäeval kell 13.00. 🔹Lastehommik Kais on sel korral vaid pühapäeval. Seekord rõõmustab \"Sabata kass\". Algus ikka 13.30.  🔸Pühapäeval näeb Sõpruses tantsudokumentaali \"Querétaro - elav maa\". See film esitleb Mehhiko Queretaro osariigi traditsioonilisi tantse, üritab tõlgendada nende olemuse sügavust, kutsub kaasahaaravale teekonnale rituaalide tähendusest ning nende suhetest elu ja maa enda rütmidega. 🔹\"Suveniir. Osa II\" on veel vaid ühel korral suurel ekraanil. Seda puhku on film vaadatav Kai saalis. 17.07 kell 20.00. www.kinosoprus.ee",["Date","2022-07-15T09:05:47.000Z"],0.32,{"text":159,"timestamp":160,"topicId":5,"sentiment":65,"topicConfidence":161,"sentimentConfidence":115},"Let's help a Ukrainian student company win the sales prize! Purchase truffles and borsch on the Freedom square from them on the 14th of July between 10-14 o'clock. The event is the biggest entrepreneurship studies event in European history!Head sõbrad, kes veel suvel Tallinnas olete! Homme on algamas Euroopa aegade suurim ettevõtlusõppe üritus, milles on ühitatud nii õpilasfirmade kui ka üliõpilasfirmade võistlus. Kõikidel on võimalik näha 14. juulil Vabaduse platsil laata. Tulge vaatama ja ostma! Veel üks tähtis asi. Tallinna linn annab ühele osalejale parima müüja preemia. Meie Eesti firmad seda püüda ei saa, küll aga ülitubli Ukraina õpilasfirma, kes tegi kuu ajaga ära sama töö, mis teised õppeaasta jooksul. Nemad müüvad seekord purkides borši ja ka trühvleid, mida saavad ka osalejad osta (ei ole vaja keeta, saab koju viia!). Aidake neil see preemia kätte saada! Nad on seda väärt! Laad on avatud kell 10-14.00. Kordan, 14. juulil Vabaduse platsil! AItame Ukrainat ka seekord!",["Date","2022-07-11T13:06:56.000Z"],0.33,{"text":163,"timestamp":164,"topicId":5,"sentiment":6,"topicConfidence":165,"sentimentConfidence":166},"Found near Telliskivi…",["Date","2022-07-09T18:36:52.000Z"],0.1,0.89,{"text":168,"timestamp":169,"topicId":5,"sentiment":6,"topicConfidence":53,"sentimentConfidence":8},"📣Pärnu rahvusvaheline maja kutsub multikultuursele perepiknikule! Kui kuuled kutset, tule juba pühapäeval Rannaparki vabaõhueinele. 🍉Tasuta perepäevale ootame Pärnus elavaid välismaalasi ja kohalikke peresid – haara kaasa näksimist, juua, istumiseks tekike ning ära unusta putukatõrjet! Veedame lõbusa päeva kohaliku meelelahutuse ja rannajoogaga. Details: https:\u002F\u002Fkultuur.parnu.ee\u002Fen\u002Fnode\u002F78620",["Date","2022-07-04T10:44:19.000Z"],{"text":171,"timestamp":172,"topicId":5,"sentiment":65,"topicConfidence":165,"sentimentConfidence":97},"It doesn’t matter whether you have any experience or not, now is the time to enjoy the pleasures of summer. We invite you to take part in a SUP adventure! Неважно, есть ли у вас какой-либо опыт или нет, сейчас самое время наслаждаться удовольствиями лета. Приглашаем Вас принять участие в SUP-приключении! Vahet ei ole, kas sul on kogemus või mitte, suverõõmude aeg on käes- kutsume teid osa võtma SUP seiklusest!",["Date","2022-07-04T07:25:05.000Z"],{"text":174,"timestamp":175,"topicId":5,"sentiment":65,"topicConfidence":176,"sentimentConfidence":177},"maitske erinevust, nautige tõelise ida toidu maitset😍😍😍😍😍tellige meid Bolti ja Woltiga www.facebook.com\u002Feasternspiceseesti",["Date","2022-07-01T23:11:44.000Z"],0.59,0.7,{"text":179,"timestamp":180,"topicId":5,"sentiment":6,"topicConfidence":18,"sentimentConfidence":111},"Tere, olen latiino, otsin ajutist tööd Eestis.Räägin väga hästi hispaania keelt, vähe inglise keelt, aga soovin töötada mis tahes valdkonnas alates koristamisest, aiandusest, ehitusest, köögist, köögiabilisest, nõudepesijast või mis iganes tööst. Mul on kogemus erinevatel aladel, töötan alal, kus pole probleeme, olen kohusetundlik mees, keel ei takista, tahan lihtsalt töötada, minu number on +37258345862",["Date","2022-06-21T16:21:32.000Z"],{"text":182,"timestamp":183,"topicId":5,"sentiment":6,"topicConfidence":157,"sentimentConfidence":78},"Otsid võimalust teenida lisaraha? Tule meie tiimi testkliendiks! Pakume lisatööd testklientidele nii kogemusega kui ilma. Testkliendiks saamiseks palun täitke ankeet keskkonnas: https:\u002F\u002Fshopperquality.shopmetrics.com\u002Fauth\u002Findex.asp#signup Kes on testklient? Testklient on terava pilguga ja hea vaistuga inimene, kes peab oluliseks head teenindust. Testklient külastab poode, apteeke, kohvikuid ja teisi teenindusettevõtteid, just nii nagu seda teeb iga klient. Testkliendi eripäraks on aga oskus näha detaile teeninduses ja neid kirjalikult kirjeldada. Lisainfot leiad: http:\u002F\u002Fshopperquality.com\u002Fet\u002Ftule_testkliendiks\u002F Küsimuste korral võta ühendust: ingrida@shopperquality.com",["Date","2022-06-15T12:39:34.000Z"],{"text":185,"timestamp":186,"topicId":5,"sentiment":6,"topicConfidence":53,"sentimentConfidence":70},"Üürile anda 2-toaline hea korter Mustamäel.  Sütiste tee 37 7\u002F9 korrus 43m2 500€\u002Fkuu Esimene maks: 500€ üür + 500€ tagatis + 500€ leping +372 58270155",["Date","2022-06-14T20:01:16.000Z"],{"text":188,"timestamp":189,"topicId":5,"sentiment":65,"topicConfidence":53,"sentimentConfidence":190},"Nautige oma lemmiktoitu ilma lisatasudeta kohaletoimetamise eest.  Tellige meid WOLTist.🥳🥳🥳🤩🤩",["Date","2022-06-13T09:55:43.000Z"],0.71,{"text":192,"timestamp":193,"topicId":5,"sentiment":6,"topicConfidence":53,"sentimentConfidence":66},"Lasteriided müük! Tooteid saab tulla vaatama outleti, kus on tooted (0-3a) kuni -50% soodsamalt. Asume Tallinnas Parda 4 ja oleme tavapäraselt avatud 10-15 tööpäevadel. Külastamiseks kirjuta ja anna meile palun varem teada. Jälgi meie tegevusi Facebookis ja saa osa parimatest hindadest iga nädal! www.babystork.eu",["Date","2022-06-11T10:48:21.000Z"],{"text":195,"timestamp":196,"topicId":5,"sentiment":6,"topicConfidence":53,"sentimentConfidence":58},"Hea uudis, meie tasuta kohaletoimetamise nädal just algas.  Tellige oma lemmiktoit BOLTist ja nautige kohaletoimetamise allahindlust🥳🥳 www.facebook.com\u002Feasternspiceseesti",["Date","2022-06-07T21:06:43.000Z"],{"text":198,"timestamp":199,"topicId":5,"sentiment":6,"topicConfidence":53,"sentimentConfidence":66},"Tere kõigile, kas on võimalik, et keegi on naine, kellelt saan õppida eesti keelt a2 rääkima ja sõbrad olla",["Date","2022-06-04T19:42:53.000Z"],{"text":201,"timestamp":202,"topicId":5,"sentiment":6,"topicConfidence":203,"sentimentConfidence":177},"\"Bicicleta este moartea lentă a planetei\".  Un bancher i-a făcut pe economiști să gândească asta când a spus: “Un biciclist este un dezastru pentru economia țării: nu cumpără mașini și nu împrumută bani ca să cumpere. El, nu plătește polițe de asigurare. Nu cumpără combustibil, nu plătește să ducă mașina la revizie și reparațiile necesare. Nu folosește parcare plătită. Nu provoacă accidente majore. Nu necesită autostrăzi cu mai multe benzi. El nu devine obez. Oamenii sănătoși nu sunt necesari sau utili economiei. Ei nu cumpără medicamente. Ei nu merg la spitale sau la doctori. Ei nu adaugă nimic în PIB-ul țării. Dimpotrivă, fiecare nou magazin McDonald 's creează cel puțin 30 locuri de muncă, de fapt 10 cardiologi, 10 stomatologi, 10 experți în dietă și nutriționiști, evident precum și oamenii care lucrează în magazinul propriu-zis\". Alege cu grijă: o bicicletă sau un Mc Donald? Merită să te gândești. PS: mersul pe jos este și mai rău. Pietonii nici măcar nu cumpără bicicletă!\"Bicycle is the slow death of the planet.\" A banker made the economists think this when he said, “A cyclist is a disaster for the country’s economy: he doesn’t buy cars and doesn’t borrow money to buy. He don't pay insurance policies Don't buy fuel, don't pay to have the car serviced and repairs needed. He doesn't use paid parking. Doesn't cause any major accidents. No need for multi-lane highways He is not getting obese Healthy people are not necessary or useful to the economy. They are not buying the medicine. They dont go to hospitals or doctors. They add nothing to the country's GDP. \"On the contrary, each new McDonald’s store creates at least 30 jobs—actually 10 cardiologists, 10 dentists, 10 dietitians and nutritionists—obviously as well as the people who work in the store itself.\" Choose wisely: a bike or a McDonald's? It's something to think about. PS: walking is even worse. Pedestrians don't even buy a bicycle!",["Date","2022-05-30T12:01:02.000Z"],0.4,{"text":205,"timestamp":206,"topicId":5,"sentiment":65,"topicConfidence":27,"sentimentConfidence":49},"Tere õhtust  long ago.I read a post of a lady ,Asian surname,that made marmalade which seemed to be very successful  Any idea how to reach her product? Aitäh",["Date","2022-05-29T18:26:32.000Z"],{"text":208,"timestamp":209,"topicId":5,"sentiment":6,"topicConfidence":53,"sentimentConfidence":176},"Kutsu sõbrad UpSteami tööle ja võida salongi keemiline pesu! Tervitame tiimi ka inglise keelt kõnelevad kandidaate! 🤩 *Kampaanias osalemiseks märgi sõbrad originaalse postituse alla.",["Date","2022-05-26T07:37:16.000Z"],{"text":211,"timestamp":212,"topicId":5,"sentiment":6,"topicConfidence":213,"sentimentConfidence":49},"Müüa 7 raamatut. Ostusoovi korral kirjutage palun postkasti.",["Date","2022-05-23T15:01:58.000Z"],0.49,{"text":215,"timestamp":216,"topicId":5,"sentiment":65,"topicConfidence":217,"sentimentConfidence":218},"Koostöös Videoagentuur Kulutuli valmis meie esimene meriforelli videoklipp. Täname kõiki asjaosalisi ja let's rock! Head vaatamist.",["Date","2022-05-20T16:34:47.000Z"],0.23,0.54,{"text":220,"timestamp":221,"topicId":5,"sentiment":6,"topicConfidence":49,"sentimentConfidence":123},"Sotsiaalne häkaton juba homme! Veel võib liituda https:\u002F\u002Fwww.exu.tlu.ee\u002Fpost\u002Fhack-social-issues-2022 Tudengid👇 on igatahes ettevalmistusi teinud.",["Date","2022-05-12T18:39:26.000Z"],{"text":223,"timestamp":224,"topicId":5,"sentiment":65,"topicConfidence":225,"sentimentConfidence":218},"For those who have not visited Saaremaa and Muhu …make it your own journey. Till next time. Ma Igatsen sind! Ma aramastan sind ❤️! Head aega!",["Date","2022-04-18T18:53:22.000Z"],0.43,{"text":227,"timestamp":228,"topicId":5,"sentiment":6,"topicConfidence":13,"sentimentConfidence":49},"HOOAJA VIIMANE RING Tallinna\u002FHarjumaa & Põltsamaa-Paide suunal laupäeval 23.04! Kaupa piiratud koguses! Ootan Sinu soove aegsasti! Ehe puhas talutoit Sulle koju kätte www.talutoodang.ee 🥕🧅🥔🧄🍯🥰 Sortimendist leiad palju puhtalt (orgaaniliselt) kasvatatud talutoitu: kartul kollane Gala ja punane Bellefleur  porgand punapeet kapsas kaalikas hapukapsas porgandiga õnnelike kanade munad UUS! äge salat 🙂 kreemjas mesi klaaspurgis erinevad ravimtaimed erinevad kodused käsitööleivad ja karask lilla kartul Blue Congo pastinaak sibul peipsi sibul punane sibul värvilised porgandid värvilised peedid… More",["Date","2022-04-16T18:46:04.000Z"],{"text":230,"timestamp":231,"topicId":5,"sentiment":6,"topicConfidence":232,"sentimentConfidence":190},"TÄHELEPANU !!! Mina ja Alexander Krivoborodov vajame abi. Soovime saata Alexandri sõpradele  vabatahtlike meditsiinipataljonis Hospitallers ( Госпітальєри https:\u002F\u002Fen.wikipedia.org\u002Fwiki\u002FHospitallers_Medical_Battalion ) hädavajaliku maastikuauto haavatute evakueerimiseks Nikolajevi oblastis. Auto on välja valitud. Teeme sellele enne üleandmist ka vajalikud hooldused ning hoolitseme saatmise eest. Hetkel on projekti eelarvest puudu  5000 eurot ning  selleks oleme loonud korjanduse.  Võimalusel palume toetada ja postitust jagada !  !!!!  !! !!! ! Juhul, kui meie korjandus osutub oodatust edukamaks, kasutame ülejäänud raha vajalike meditsiinitarvikute ostuks ja paneme need autoga kaasa. Korjandus on avatud Ukraina Kreeka-Katoliku Kiriku Koguduse juures. Annetada saab tehes ülekande :  Saaja: Ukraina Kreeka-Katoliku Kiriku Kogudus Tallinnas konto: EE151010052032024005 Makse selgitus: charitable donation for car vaata ka: https:\u002F\u002Fwww.facebook.com\u002Fhospitallers\u002F",["Date","2022-04-13T06:53:51.000Z"],0.25,{"text":234,"timestamp":235,"topicId":5,"sentiment":65,"topicConfidence":236,"sentimentConfidence":237},"Tere hommikust! 😅",["Date","2022-04-11T01:11:01.000Z"],0.31,0.69,{"text":239,"timestamp":240,"topicId":5,"sentiment":65,"topicConfidence":241,"sentimentConfidence":237},"(PT) Ultimos lugares disponiveis, reserve já a sua porção por ola@taberna.ee, +372 56148500 ou por mensagem nas redes sociais. Obrigado. ! (EN) Last seats available, book now yours by ola@taberna.ee, +372 56148500 or by message in social networks. Thank you !",["Date","2022-04-10T06:21:53.000Z"],0.36,{"text":243,"timestamp":244,"topicId":5,"sentiment":65,"topicConfidence":245,"sentimentConfidence":246},"Estonians have started making camonets for the Ukrainian army. if someone has right now time it would be a great help if you could go to T1 and help make sense of this giant netSee kriis lahendatud, võtame järgmise! KIIRE ÜLESKUTSE! PALUME ABI! On vaja 10 vabatahtlikku, parem, kui mehed, kes lahendaks ära T1 laadimisala 1 juure toodud 200 kg-se võrgukoguse. Vaja on see lahti harutada ja väiksemateks tükkideks teha!  Kaasa vaja võtta lõikamisvahendid! Palun levitage sõna, et moodustuks selline  tugev seltskond, kes saaks kiiresti appi tõtata, sest see kuhi asub tuletõrje sissepääsu ees. Positiivselt poolelt - siis oleme pikaks ajaks võrguga varustatud. Anu 51 49546",["Date","2022-03-31T10:27:16.000Z"],0.39,0.48,{"text":248,"timestamp":249,"topicId":5,"sentiment":65,"topicConfidence":250,"sentimentConfidence":190},"Dear friends, we need your help. We are buying used computers for refugees schoolchildren. For few days we received 300 requests. We buy used computers for a minimum price (around 150 eur per unit) from such companies as Wise, Bolt, Veriff. Please support us financially, as requests would grow. This initiative is ran by my good friends and the first volunteers of our evacuation team. Please support it ❤🇺🇦 we will report all accounting, all is transparent 🙏Anna oma panus, et Ukraina lapsed Eestis saaksid jätkata kooliteed! Help Ukrainian children in Estonia to get laptops and continue their schooling! Eestis on momendil ligikaudu 5500 kooliealist Ukraina… More põgenikku ja see number tõenäoliselt kasvab. MTÜ Ukraina Eneseabi tegeleb vahendite kogumisega ja ostab kokku sülearvuteid, et jagada need abi vajavatele peredele koolihariduse toetamiseks ka distantsõppe näol. Ukrainas toimub Covidi tõttu suuresti distantsõpe ning paljud põgenikud saaksid jätkata oma õpinguid, kuid neil puudub selleks arvuti, seega mõned lapsed kasutavad hädapärast telefoni ja suurel osal ei ole isegi seda.  Kui Sina soovid aidata, siis palun anna oma kuitahes väike või suur… More",["Date","2022-03-24T16:22:16.000Z"],0.29,{"text":252,"timestamp":253,"topicId":5,"sentiment":6,"topicConfidence":102,"sentimentConfidence":254},"Tomorrow wednesday: Gatka martial art free trial class for all youth at Rajamaa Ashram 18:00 Parents and siblings are also welcome to join. After that we continue with Gatka classes every wednesday 18:00-19:00. For joining the group from 30. march please write an email to Sukhdev Kaur at sukhdevkaur@khalsa.com From 30th march the donation for a class will be 5€. More about gatka: www.dharamsaal.ee\u002Fgatka Children can also join the Architectural building workshop from 30. march at the ashram at 15:00. More information about this can be found here:  https:\u002F\u002Fdharamsaal.ee\u002Fchildren\u002FHomme 23 märts toimub Rajamaa ashramil  Gatka võitluskunsti proovitund kl 18:00-19:00 Noored koos emad-isad ja nooremate vendade-õdedega on oodatud.  Seejärel jätkame noortega Gatka igal kolmapäeval kl… More 18:00-19:00. Kes soovib alates 30. märtsist ühineda palun kirjutage emaili teel Sukhdev Kaurile sukhdevkaur@khalsa.com  Alates 30. märts tunni maksumus 5€.  Gatkast lähemalt: www.dharamsaal.ee\u002Fgatka  Noored saavad ka liituda alates 30. märts Arhitektuuri töötoaga, mis algab kl 15:00st (algusega 30. märts, mitte 23 märts nagu varem oli reklaamitud). Selle töötoa info leiate siit: https:\u002F\u002Fdharamsaal.ee\u002Fchildren\u002F",["Date","2022-03-22T09:37:28.000Z"],0.78,{"text":256,"timestamp":257,"topicId":5,"sentiment":6,"topicConfidence":92,"sentimentConfidence":45},"Hey..  Is there any Pentacoastal English service or Indian language Pentacoastal church here in Tallinn?  Thanks in advance",["Date","2022-03-12T17:18:41.000Z"],{"text":259,"timestamp":260,"topicId":5,"sentiment":6,"topicConfidence":27,"sentimentConfidence":54},"Таллиннская центральная больница (IDA TALLINNA KESKHAIGLA) предлагает неотложную или неизбежную медицинскую помощь беженцам войны. Расходы на лечение военных беженцев покрывает Больничная касса Эстонии.  Неотложная помощь 24\u002F7  ✅Рави тн 18, Таллинн (пункт скорой медицинской помощи)  ✅ Звоните 666 1900  Беременность и гинекология 24\u002F7  ✅Рави тн 18, Таллинн (родильный дом)  ✅ Звоните 5308 0874  Зарегистрировать беременность (С понедельника по пятницу 7.15-18.00)  ✅Позвоните по телефону 666 1900 или запросите информацию по адресу rasedus@itk.ee",["Date","2022-03-05T15:32:37.000Z"],{"text":262,"timestamp":263,"topicId":5,"sentiment":6,"topicConfidence":264,"sentimentConfidence":28},"DOES ANYONE KNOW IF THE GROCERY STORES HAVE DONATION BOXES FOR THE UKRAINIANS?  Maxima, Rimi, Selver, Prisma? I use Barbora, so l'm not in the stores.Suur aitäh kõigile, kes on juba toonud annetusi Ukraina inimestele ❤️ Kui tunned, et tahaksid ka aidata, siis veel kuni 4. märtsini võtame kauplustes vastu annetuseks minevaid hügieenitarbeid. Pärast seda võtame vastu vaid rahalisi annetusi nii kauplustes (nii ostupuldiga kui tavakassas ja infoletis) kui ka e-Selveris 👉 https:\u002F\u002Fbit.ly\u002F36OdNG6.  Kogutud tooted ja rahalised annetused edastame läbi Eesti Punane Risti Ukrainasse kannatada saanud elanike abistamiseks.",["Date","2022-03-02T13:43:03.000Z"],0.22,{"text":266,"timestamp":267,"topicId":5,"sentiment":6,"topicConfidence":123,"sentimentConfidence":18},"Inglisekeelsed raamatud, mõni rohkem loetud kui teine. Hind 7eur\u002Ftk, va. Sapiens ja The Subtile Art of...  12eur\u002Ftk. Lisandub postikulu. Books in english, some more read then others. Price 7eur\u002Fpce, except Sapiens and The Subtile Art of... 12eur\u002Fpce.  +  sending.",["Date","2022-02-19T11:59:58.000Z"],{"text":269,"timestamp":270,"topicId":5,"sentiment":6,"topicConfidence":106,"sentimentConfidence":22},"I am looking for \"fleur de sel\". Does anyone know where I could buy it? I was in Kaubamaja already but no luck. Thanks!",["Date","2022-02-15T15:15:18.000Z"],{"text":272,"timestamp":273,"topicId":5,"sentiment":6,"topicConfidence":44,"sentimentConfidence":70},"Tallinn\u002FHarjumaa* ja Põltsamaa, Paide, Türi piirkond laupäeval 19.02 🙂 Ehe puhas talutoit Sulle koju kätte www.talutoodang.ee 🥕🧅🥔🧄🍯🥰 Sortimendist leiad palju puhtalt (orgaaniliselt) kasvatatud talutoitu: talvekartul kollane Gala ja punane Bellefleur porgand punapeet kapsas kaalikas hapukapsas porgandiga UUS! äge salat 🙂 kodused marineeritud kõrvitsad muskaatkõrvits värske mesi ämbris ja klaaspurgis kreemjas mesi klaaspurgis erinevad ravimtaimed erinevad kodused käsitööleivad ja karask lilla kartul Blue Congo pastinaak küüslauk sibul punane sibul värvilised porgandid värvilised peedid… More",["Date","2022-02-12T14:36:09.000Z"],{"text":275,"timestamp":276,"topicId":5,"sentiment":6,"topicConfidence":277,"sentimentConfidence":8},"Anda ära tasuta madratseid! Tegemist on AS Tallink poolt vallale antud madratsitega, mis jäid üle kuulsast Glasgow kliimakonverentsist. Nimelt, Tallinki laev majutas maineka kliimakonverentsi korraldustiimi ning tolleks tellitud uued madratsid ei leidnud pärast enam kasutust.  Ringmajandust soosiva omavalitsusena ning varasemat head koostööd arvestades pöördusid nad meie poole, et leiaksime madratsitele uued omanikud.  Osa on juba antud valla allasutustesse, huvikeskustesse jms, kuid suur kogus ootab veel omanikke. Tegemist on poroloonmadratsitega, mille mõõdud 195x75cm. Asuvad Pakri Plazas. Kätte saab plaza infost Rae 38 I korrus täna kella 20ni või pühapäeval kl 10.00-15.00. Source: Ohtu Küla https:\u002F\u002Fwww.facebook.com\u002F195793427133320\u002Fposts\u002F4883670831678866\u002F?sfnsn=mo",["Date","2022-02-11T17:01:23.000Z"],0.66,{"text":279,"timestamp":280,"topicId":5,"sentiment":65,"topicConfidence":281,"sentimentConfidence":88},"Reserve your table ! Last ones available 🙂 Tel: +372 56 148 500 , ola@taberna.ee or through a message in social media. See you soon !",["Date","2022-02-01T09:09:15.000Z"],0.18,{"text":283,"timestamp":284,"topicId":5,"sentiment":6,"topicConfidence":123,"sentimentConfidence":58},"Kraabitav plakat “100 paika Eestis” 🇪🇪 https:\u002F\u002Fannafermer.com\u002Fproducts\u002F100-paika-eestis Reisilt tagasi tulles kraapige lihtsalt kaitsekihti ruutudelt maha ja paljastage ilus pilt sellest kohast!🪙 Loodusrajad, saared, metsad, muuseumid, mõisad - plakatil olevad kohad on väga mitmekesised ja paiknevad hajali üle Eesti!🚀 Plakati suurus: 42 х 59,4 sm Pakend: vutlar tugevast papist ♥️",["Date","2022-01-22T12:04:00.000Z"],{"text":286,"timestamp":287,"topicId":5,"sentiment":6,"topicConfidence":288,"sentimentConfidence":66},"Üksik, haritud ja korraarmastaja 50-aastane naine üürib Tallinnas või lähiümbruses maja või majaosa pikaajaliseks elamiseks koos suure teenistuskoeraga (kesk-aasia lambakoer, 80kg). Emakeel on vene keel, inglise keel kõrgtase, eesti keel suhtlustasandil. Eelarve 350-400 eurot tel. (+WhatsApp+Viber+Telegram) +372-585-23650 FB https:\u002F\u002Fwww.facebook.com\u002Flokotok =========== Женщина-репетитор высшей математики с большой служебной собакой (алабай– среднеазиатская овчарка, 80 кг) возьмет в аренду небольшой домик или часть дома с огороженной территорией в Таллинне\u002Fокрестностях на очень длительный срок. Русский язык – родной, английский – свободно, эстонский – разговорный. Бюджет: 350-400 евро в месяц… More",["Date","2022-01-17T20:46:52.000Z"],0.41,{"text":290,"timestamp":291,"topicId":5,"sentiment":6,"topicConfidence":27,"sentimentConfidence":123},"For some people who know the story of the 10 million dollar affair 🤣Täname Mihklit, aga eeskätt täname Kaja. Vau.",["Date","2022-01-13T19:33:17.000Z"],{"text":293,"timestamp":294,"topicId":5,"sentiment":6,"topicConfidence":277,"sentimentConfidence":54},"🤍Cococchoco keratiinhooldus selle kuu lõpuni 55€  🤍Cocochoco valikus Original-paksemad juuksed , Gold-kullaosakestega, Pure -blondidele juustele! 🤍Sense keratiinhooldus 75 € (kollageeni ja keratiiniga- tugevama toimega) 🤍Keratiinhooldus:  🤍Annab juustele kaitsekihi, kuna juuksed on paksemad ei lähe need ka nii lihtsalt pusasse 🤍Muudab juuksed supersiledaks -eemaldab kahu , juuksed ei lähe ka elektrit täis 🤍Sirgendab juukseid pikemaks ajaks- seega pole vaja igapäevaselt juukseid rikkuda ja sirgendada 🤍Kuna juuksed koosnevad 80% ulatuses keratiinist ,siis keratiinhooldus tugevdab juukseid ,kuna täidab juustes olevaid tühimikkke ja annab ka juuksekarvale paksust 🤍 Annab võimaluse juustel… More",["Date","2022-01-12T10:57:21.000Z"],{"id":5,"label":296,"color":297},"ja, ka, kui","#76b7b2",[299,302,305,308,310,312,314,316,318,320],[300,301],"ja",120,[303,304],"ka",60,[306,307],"kui",40,[309,307],"olen",[311,307],"rske",[313,307],"kes",[315,307],"simon",[317,307],"ei",[319,307],"eval",[321,307],"ning"],"uses":{"params":["topic_id"]}}]}
