{"type":"data","nodes":[null,{"type":"data","data":[{"posts":1,"topic":271,"representativeWords":274},[2,9,14,18,22,27,32,35,40,44,48,52,57,61,65,69,73,77,81,84,89,93,96,100,103,106,111,115,119,123,126,129,132,136,139,143,146,150,154,158,162,166,170,173,177,180,183,186,189,194,197,200,204,208,211,214,219,222,225,228,232,236,239,243,246,249,253,256,259,262,265,268],{"text":3,"timestamp":4,"topicId":5,"sentiment":6,"topicConfidence":7,"sentimentConfidence":8},"Hello folks,  I am looking for a basic presential HR course in Talllinn.  Could someone recommend a school\u002Finstitute  that I can study inloco.  P.S:. Not online classes...I just wanted in person.  The same my husband...he is looking for PMP or Product Management course.  TIA.",["Date","2022-12-25T11:42:22.000Z"],14,"Neutral",1,0.75,{"text":10,"timestamp":11,"topicId":5,"sentiment":6,"topicConfidence":12,"sentimentConfidence":13},"Hello! Can anyone tell me how I can check my driving history online (Estonia).",["Date","2022-12-21T00:41:06.000Z"],0.49,0.83,{"text":15,"timestamp":16,"topicId":5,"sentiment":6,"topicConfidence":7,"sentimentConfidence":17},"Is A2 level enough for the driving test? How much communication is needed? So the instructor will set a destination and we drive there by listening to the instructor or they just tell where to go and we find our way which mean instructor just sit and observe? #drivingtest",["Date","2022-12-02T05:49:55.000Z"],0.68,{"text":19,"timestamp":20,"topicId":5,"sentiment":6,"topicConfidence":7,"sentimentConfidence":21},"Hey! Does anyone know where i could get a document in Estonia translated to Portuguese? Thanks!",["Date","2022-11-12T17:19:26.000Z"],0.64,{"text":23,"timestamp":24,"topicId":5,"sentiment":25,"topicConfidence":12,"sentimentConfidence":26},"Hello everyone! I have an acquaintance who is interested in opening a company in Estonia and is looking for a lawyer or advisor, preferably one who speaks Spanish. If you have information, you can put it in the comments and if you are interested, send a DM. 😁",["Date","2022-11-10T19:07:36.000Z"],"Positive",0.56,{"text":28,"timestamp":29,"topicId":5,"sentiment":25,"topicConfidence":30,"sentimentConfidence":31},"Hi all. Looking for any eco\u002Fsustainability Facebook groups in Tallinn\u002FEstonia. Thank you. PS language not an issue as google translate will help me.",["Date","2022-11-08T09:16:20.000Z"],0.79,0.89,{"text":33,"timestamp":34,"topicId":5,"sentiment":25,"topicConfidence":7,"sentimentConfidence":17},"Anyone planning to have a driving exam in the next few weeks and would like to pass it sooner? I have my exam scheduled on the 16th of November but I need to reschedule for later as I will be abroad that day. We can exchange the exam dates, I'll free mine so you can take it and then I take yours. The end of November or any day in December is fine for me. Edit: Thanks for the suggestions!",["Date","2022-11-07T16:17:07.000Z"],{"text":36,"timestamp":37,"topicId":5,"sentiment":38,"topicConfidence":7,"sentimentConfidence":39},"I went through driving test thread in this group and it seems difficult to pass the theory and practical test. 1. Any tips for both test?  2. Any link or website to learn for those tests? I saw a few recommendations for the paid website but I am searching for something free (if any). Addicted to the free things after being spoiled by many free services here.",["Date","2022-10-27T11:26:25.000Z"],"Negative",0.48,{"text":41,"timestamp":42,"topicId":5,"sentiment":6,"topicConfidence":7,"sentimentConfidence":43},"Hello expats ,  I have a question : what’s the faster way to get Estonian driving license from scratch ? I have Chinese driving license , but it cannot be used in Estonia .  I believe I need to go to some driving school here . So which driving school in Tallinn is best and have English classes . Or if there is a way to skip the classes (especially theory and do self study then take tests ) . Any recommendations or advice would be highly appreciated  ✌️",["Date","2022-10-25T08:43:16.000Z"],0.6,{"text":45,"timestamp":46,"topicId":5,"sentiment":6,"topicConfidence":7,"sentimentConfidence":47},"Hello expats, has anyone here translated any official document from Estonian -\u003E English?  I know there is an official notary list that has the names and contacts of all the official sworn translators. Just want to know if someone has good experience with any one of them. Too much to choose from.",["Date","2022-10-22T13:11:12.000Z"],0.65,{"text":49,"timestamp":50,"topicId":5,"sentiment":6,"topicConfidence":51,"sentimentConfidence":47},"Hi, do you know if one holding Estonian driving license can drive car in Dubai? I find information like we can exchange driving license in Dubai without exam but not sure if I can simply hire car and drive ! Thanks for your advise!",["Date","2022-10-02T17:24:49.000Z"],0.69,{"text":53,"timestamp":54,"topicId":5,"sentiment":6,"topicConfidence":55,"sentimentConfidence":56},"A English speaking friend of mine wants to take driving lessons here in Estonia. She has nobody to teach her, and has no driving experience. What is her best course of action to get driving lessons from a professional, friendly, English speaking teacher\u002Fschool? Cost is also something she takes into account, so she doesn't need anything ultra premium, but she would like it to be a good teacher\u002Fschool. A good environment to learn. Any suggestions on how to go about it? Also, what would be the typical cost from beginning to end of the entire education until taking a test?",["Date","2022-09-28T10:46:37.000Z"],0.91,0.58,{"text":58,"timestamp":59,"topicId":5,"sentiment":6,"topicConfidence":7,"sentimentConfidence":60},"Anyone had\u002FHave any experience or know any person who works as a translator? I need Estonian to English Translation. I am willing to check companies as well",["Date","2022-09-27T13:13:15.000Z"],0.87,{"text":62,"timestamp":63,"topicId":5,"sentiment":6,"topicConfidence":7,"sentimentConfidence":64},"Any English to Estonian translators here or to recommend. I have a standard English document that needs to be translated.",["Date","2022-09-22T05:50:29.000Z"],0.82,{"text":66,"timestamp":67,"topicId":5,"sentiment":25,"topicConfidence":7,"sentimentConfidence":68},"Hello ladies and gentlemen, We would like to introduce you to our driving school. Maybe you are looking for one. One of the main prioritised work flows in our driving school - are courses in English. We provide our services in several areas: - B category courses (Car) - A category (motorcycle) - Winter driving (final stage of the courses starts on 15.10.2022) - Online live streming theory course (starts on 21.09.2022 at 18:00) In addition we have a possibility of attending the courses online. It will help you to save your time, since you would be able to attend the classes from home and not spend your time on traveling via public transport to the driving school. Moreover, there is an… More",["Date","2022-09-21T08:06:26.000Z"],0.77,{"text":70,"timestamp":71,"topicId":5,"sentiment":25,"topicConfidence":72,"sentimentConfidence":26},"Hi! I would like to renew my driving skills. I am an EU citizen and I got a Croatian driving license that is accepted in Estonia (approved by an employee at the Department of Transport in Tallinn). Any recommendations for driving schools (particularly close to the border of Mustamäe and Nomme)?",["Date","2022-09-19T16:12:10.000Z"],0.5,{"text":74,"timestamp":75,"topicId":5,"sentiment":6,"topicConfidence":7,"sentimentConfidence":76},"hello, does any one know a private car driving trainer please 🚗🚦",["Date","2022-09-18T16:07:56.000Z"],0.88,{"text":78,"timestamp":79,"topicId":5,"sentiment":25,"topicConfidence":7,"sentimentConfidence":80},"Help needed 🙏🏿 Does anyone have Estonian driving exam study books —\u003E IN ENGLISH ?  Willing to buy. Please PM. Thank you in advance!",["Date","2022-09-14T11:34:55.000Z"],0.52,{"text":82,"timestamp":83,"topicId":5,"sentiment":6,"topicConfidence":7,"sentimentConfidence":76},"Any recommendations to study for the driving license theoretical test?",["Date","2022-09-09T16:44:14.000Z"],{"text":85,"timestamp":86,"topicId":5,"sentiment":25,"topicConfidence":87,"sentimentConfidence":88},"Hello people, Hope you guys are doing well. I am looking for an Estonian to English translator for 40 minutes practice car driving exam in Tallinn on 9th September at 9AM. Please write me or tag your friend. Thank you",["Date","2022-09-06T15:04:53.000Z"],0.67,0.86,{"text":90,"timestamp":91,"topicId":5,"sentiment":6,"topicConfidence":7,"sentimentConfidence":92},"Hello everyone, please I need a translator in parnu for my driving exam. Anyone here or know someone that can help.Thanks!",["Date","2022-09-02T14:33:07.000Z"],0.7,{"text":94,"timestamp":95,"topicId":5,"sentiment":25,"topicConfidence":7,"sentimentConfidence":17},"Hello folks;  Anybody appeared in practical driving exam at Parnu. I need some information. Kindly let me know if someone attended there. Thank you so much.",["Date","2022-08-31T08:55:25.000Z"],{"text":97,"timestamp":98,"topicId":5,"sentiment":25,"topicConfidence":72,"sentimentConfidence":99},"Hello 👋. Does anyone know of a driving school that speaks English? I would like some recommendations. Thank you!",["Date","2022-08-30T09:10:48.000Z"],0.72,{"text":101,"timestamp":102,"topicId":5,"sentiment":6,"topicConfidence":7,"sentimentConfidence":12},"Hello! I urgently need an English-\u003EEstonian (native) translator with IT competencies\u002Fexpertise. I need to translate a document of 1k words (including a lot of IT terms that do not require translation).  I guess it can be not even a professional translator, just an Estonian-native IT student who needs some extra money.   I'll be grateful for recommendations.",["Date","2022-08-25T16:58:55.000Z"],{"text":104,"timestamp":105,"topicId":5,"sentiment":6,"topicConfidence":7,"sentimentConfidence":26},"I feel like rather than reducing access to translated information on official websites, maybe increasing the capacity of language courses could help foreigners learn Estonian, but here we are.",["Date","2022-08-24T13:51:02.000Z"],{"text":107,"timestamp":108,"topicId":5,"sentiment":25,"topicConfidence":109,"sentimentConfidence":110},"Hi everyone I need to find someone for translation in interpreter for the session of the labour dispute. For maybe one hour and I hope not so much expensive.  Thank you",["Date","2022-08-15T14:03:40.000Z"],0.94,0.63,{"text":112,"timestamp":113,"topicId":5,"sentiment":6,"topicConfidence":114,"sentimentConfidence":99},"Hello, May I ask where can I find a translation service that can help me to translate my driving license into Estonian language, but it should be accepted by the ark.",["Date","2022-08-08T17:08:41.000Z"],0.96,{"text":116,"timestamp":117,"topicId":5,"sentiment":6,"topicConfidence":109,"sentimentConfidence":118},"Hi everyone, please I need some help, any recommendations for an English speaking translator in johvi. I’m about to do my driving exam and I need a translator. Thanks!",["Date","2022-08-08T14:29:33.000Z"],0.71,{"text":120,"timestamp":121,"topicId":5,"sentiment":25,"topicConfidence":7,"sentimentConfidence":122},"Hello everyone, I am planning to do an A2 or A motorcycle license in Estonia and I would like to know if there are any driving schools in Tallinn that offer classes in English? Further, what is the average price range of such a license? So if you have any recommendations based on personal experience, feel free to share.  Also, how are the regulations with the theory classes if I already own a driving permit class B for over 3 years? Do I have to redo all of theory classes or just a few “catch-up” ones? Thanks for helping and have a wonderful rest of the summer :)",["Date","2022-08-03T08:01:25.000Z"],0.92,{"text":124,"timestamp":125,"topicId":5,"sentiment":38,"topicConfidence":7,"sentimentConfidence":72},"Is anyone here familiar with the driving license system here? So after passing my driving exam, I have to use this green leaf sign for 2 years and then after that? Is there another exam I have to do after 2 years? What if I have to leave EU before 2 years is up? Does my license become useless? Also what are the rules of the green leaf? Like no driving more than 90kmph? Anything else?",["Date","2022-08-01T07:03:52.000Z"],{"text":127,"timestamp":128,"topicId":5,"sentiment":6,"topicConfidence":7,"sentimentConfidence":31},"Hey, do you know any sworn translator that translate arabic to estonian ?",["Date","2022-07-27T10:03:20.000Z"],{"text":130,"timestamp":131,"topicId":5,"sentiment":25,"topicConfidence":7,"sentimentConfidence":56},"hello, could you please recommend a translation office to translate documents from french to estonian and arabic to estonian, that is open tomorrow and that I can take the translated documents on the same day tomorrow. thank you..",["Date","2022-07-17T18:28:07.000Z"],{"text":133,"timestamp":134,"topicId":5,"sentiment":25,"topicConfidence":88,"sentimentConfidence":135},"Hey folks, I am planning to go to a driving school (English speaking). Recommendations would be appreciated",["Date","2022-07-10T15:06:48.000Z"],0.73,{"text":137,"timestamp":138,"topicId":5,"sentiment":6,"topicConfidence":17,"sentimentConfidence":122},"Does anyone know where I can find testing prep for the drone license in English?",["Date","2022-07-02T14:01:23.000Z"],{"text":140,"timestamp":141,"topicId":5,"sentiment":6,"topicConfidence":142,"sentimentConfidence":72},"I'm obviously procrastinating today because the mention of Hemingway in the recently re=posted Estonian World article made me go and hunt out the original quote. Here's the original line from \"To Have and Have Not\", from the Internet Archive (https:\u002F\u002Farchive.org\u002Fstream\u002FToHaveAndHaveNot\u002FToHaveAndHaveNot_djvu.txt): It uses the old-fashioned spelling \"Esthonia\" which made it a bit tricky to find! \"Esthoxdans [sic, OCR error] who are sailing around in different parts of the world, in boats between 28 and 36 feet long and sending back articles to the Esthonian newspapers. These articles are very popular in Esthonia and bring their authors between a dollar and a dollar and thirty cents a column.… More",["Date","2022-07-01T10:33:32.000Z"],0.51,{"text":144,"timestamp":145,"topicId":5,"sentiment":6,"topicConfidence":7,"sentimentConfidence":80},"Hello everyone, I tried to find where is it mentioned the requirements for getting driver license like mandatory 28 hours of practical lessons but I was not able. If someone knows, could you please share with me? Thanks in advance.",["Date","2022-07-01T06:43:27.000Z"],{"text":147,"timestamp":148,"topicId":5,"sentiment":6,"topicConfidence":56,"sentimentConfidence":149},"Hi all,  I know it's a long shot but does anyone know any English speaking driving instructor in Narva?",["Date","2022-06-30T06:41:53.000Z"],0.84,{"text":151,"timestamp":152,"topicId":5,"sentiment":6,"topicConfidence":13,"sentimentConfidence":153},"Friends, do you aware, do I need apostile on document, given in Russia to present in police? For example on birth certificate?",["Date","2022-06-17T18:53:49.000Z"],0.78,{"text":155,"timestamp":156,"topicId":5,"sentiment":25,"topicConfidence":7,"sentimentConfidence":157},"Helloo  I just passed my driving exam. I am so happy",["Date","2022-06-10T10:52:50.000Z"],0.99,{"text":159,"timestamp":160,"topicId":5,"sentiment":25,"topicConfidence":7,"sentimentConfidence":161},"Hello  folks; I need translator from Estonian to English for my practical driving test on Monday 6.06 at 3:30pm in Tallinn. Anybody can help me, it would be highly appreciated..",["Date","2022-06-02T15:27:48.000Z"],0.53,{"text":163,"timestamp":164,"topicId":5,"sentiment":38,"topicConfidence":118,"sentimentConfidence":165},"If you think, like me, that the current Environment minister is not really a friend of the environment and want to try to change it, here's a petition for him to resign.  https:\u002F\u002Frahvaalgatus.ee\u002Finitiatives\u002F711a49f4-ab32-4194-acb5-6b9b0699bfdc The text is in Estonian but you know, Google Translate exists.",["Date","2022-06-01T14:41:39.000Z"],0.55,{"text":167,"timestamp":168,"topicId":5,"sentiment":25,"topicConfidence":7,"sentimentConfidence":169},"Gotta love google translate 🥳",["Date","2022-05-22T12:53:32.000Z"],0.98,{"text":171,"timestamp":172,"topicId":5,"sentiment":6,"topicConfidence":7,"sentimentConfidence":26},"Looking for someone to translate a page of Estonian into English by the end of the day - for a friend, could post here for community assistance if any good!",["Date","2022-05-12T10:10:16.000Z"],{"text":174,"timestamp":175,"topicId":5,"sentiment":6,"topicConfidence":176,"sentimentConfidence":118},"Does anyone know of any sustainability or planning work going for a very capable and experienced young professional? She's currently working in solar development in the UK but doesn't speak Estonian or Russian.",["Date","2022-05-10T18:06:58.000Z"],0.46,{"text":178,"timestamp":179,"topicId":5,"sentiment":25,"topicConfidence":7,"sentimentConfidence":161},"Hey hey. Can someone recommend a good, reliable, English-speaking driving instructor? I have already a driving license but need to get some driving lessons since I am not familiar with driving in Estonia. Thank you in advance!",["Date","2022-04-18T19:59:28.000Z"],{"text":181,"timestamp":182,"topicId":5,"sentiment":25,"topicConfidence":7,"sentimentConfidence":68},"Hello everyone I am looking for a translator for my driving exam in Tartu. The exam is on 21st of april and at 11am. Can anyone in Tartu be my translator from estonian to english during the exam? We can agree on the price thru DM 🙂 Please contact me thru messenger or if you have any recommendations all welcome, thank you🙏🏼",["Date","2022-04-17T10:54:37.000Z"],{"text":184,"timestamp":185,"topicId":5,"sentiment":25,"topicConfidence":7,"sentimentConfidence":110},"Hello, I am looking for a reasonably priced Russian to English translator.  Translator does not need to be certified and there is no urgent deadline on the request.  Translation would be of 44 family postcards from early 1900s. Will provide more details for anyone that is interested. PM if interested. Thanks!",["Date","2022-04-16T05:31:26.000Z"],{"text":187,"timestamp":188,"topicId":5,"sentiment":6,"topicConfidence":122,"sentimentConfidence":56},"Hello everyone, I need an Estonian-English translator please on 6th of April from 14:30 till 15:30 at transport registration office in Tallinn heli 6 driving exam.thanks 😉I will pay 20€ for it",["Date","2022-04-04T13:41:25.000Z"],{"text":190,"timestamp":191,"topicId":5,"sentiment":6,"topicConfidence":192,"sentimentConfidence":193},"Urgently, I need a translator for the driving exam on 05.04 at 11.00. If anybody can help me please inbox. I will pay for this.",["Date","2022-04-02T21:49:21.000Z"],0.97,0.62,{"text":195,"timestamp":196,"topicId":5,"sentiment":6,"topicConfidence":76,"sentimentConfidence":76},"In Tallinn how much would it cost to get a driving license? And for the driving school?",["Date","2022-04-01T12:50:01.000Z"],{"text":198,"timestamp":199,"topicId":5,"sentiment":25,"topicConfidence":7,"sentimentConfidence":142},"Hello! Could someone here recommend a good driving instructor (English or Russian speaking) in Tallinn? I’m looking for a driving instructor who will be patient and supportive. I already have a driver’s license but I’m completely out of practice as I have never owned a car and have not driven in years. I may want to start learning from scratch. Thank you! 🙏",["Date","2022-03-22T13:52:37.000Z"],{"text":201,"timestamp":202,"topicId":5,"sentiment":6,"topicConfidence":203,"sentimentConfidence":88},"Hi everyone, I need legal document translation service from an authorized person or an entity. Can anyone recommend some place?  TIA",["Date","2022-03-19T09:06:11.000Z"],0.66,{"text":205,"timestamp":206,"topicId":5,"sentiment":6,"topicConfidence":7,"sentimentConfidence":207},"Hello all. I am looking for an Estonian to English translator who has experience with medical translations. It is a one-page histopathology report which we need someone to translate. Thank you.",["Date","2022-03-16T16:08:54.000Z"],0.59,{"text":209,"timestamp":210,"topicId":5,"sentiment":25,"topicConfidence":7,"sentimentConfidence":142},"Hello everyone! looking for an Estonian translator that could translate a manuscript of a book from English(american) to Estonian. (Students on English letters, phylology, translation are welcome) approximately 95k words.",["Date","2022-03-15T09:40:08.000Z"],{"text":212,"timestamp":213,"topicId":5,"sentiment":25,"topicConfidence":7,"sentimentConfidence":43},"Hello, Searching for the Dari language speaker to translate documents in Dari to English or Estonian. Thank you in advance!",["Date","2022-03-05T10:21:12.000Z"],{"text":215,"timestamp":216,"topicId":5,"sentiment":6,"topicConfidence":217,"sentimentConfidence":218},"Hi! I have an Estonian driving license cat. B (previously Italian got in 1990) and now I would like to get A license for scooter more than 50cc.  Anyone in the group had the same experience ?  Do I need to do a new theory and practice test to get A license ? Thanks for advice",["Date","2022-02-26T07:00:16.000Z"],0.81,0.76,{"text":220,"timestamp":221,"topicId":5,"sentiment":25,"topicConfidence":7,"sentimentConfidence":30},"Hello everyone! I am a master's student in Tallinn University and currently working on my thesis that researches foreigners' experience with translation services in Estonia. I need some help with a questionnaire that should take about 5 minutes to complete and is anonymous. If you can find the time to answer, it is much appreciated! Thank you! Here is the link: https:\u002F\u002Fdocs.google.com\u002Fforms\u002Fd\u002Fe\u002F1FAIpQLSdBi-P8yS6NBagmK26XPxYbcrds0RB2shBLycL3WauXqHoI_g\u002Fviewform?fbclid=IwAR1Eb86ccj-icJU559JmPYZyZnJF4vyHADHkRvl9KXgmrp_2slmq8tTHYs8",["Date","2022-02-25T11:09:32.000Z"],{"text":223,"timestamp":224,"topicId":5,"sentiment":25,"topicConfidence":7,"sentimentConfidence":55},"Hello! I am looking for an Estonian translator that could translate from Spanish to Estonian (a manuscript of stories, around 52,000 words) contacts: stretomx@gmail.com   I would appreciate if anybody could provide a contact ;)   Thanks!",["Date","2022-02-21T15:11:34.000Z"],{"text":226,"timestamp":227,"topicId":5,"sentiment":25,"topicConfidence":7,"sentimentConfidence":122},"Hello! I am looking for an Estonian translator that could translate from Spanish to Estonian (a manuscript of stories, around 52,000 words) contacts: stretomx@gmail.com   I would appreciate if anybody could provide a contact too ;)   Thanks!",["Date","2022-02-21T15:11:06.000Z"],{"text":229,"timestamp":230,"topicId":5,"sentiment":25,"topicConfidence":231,"sentimentConfidence":8},"Hi, needs your help. Am looking for translator for my driving test, it’s on 11.00 am 25th Feb (this Friday). Please pm me If you’re available for this job, we can discuss the fee. Thank you so much in advance 🙏",["Date","2022-02-21T10:18:50.000Z"],0.93,{"text":233,"timestamp":234,"topicId":5,"sentiment":25,"topicConfidence":7,"sentimentConfidence":235},"How to pass the theoretical test for driving license? Thanks for help!",["Date","2022-02-17T08:07:02.000Z"],0.8,{"text":237,"timestamp":238,"topicId":5,"sentiment":38,"topicConfidence":7,"sentimentConfidence":110},"Finnish speakers, please help to translate names of the flour properly, google translate is not very helpful 😅 4 dl maan parhaat hiivaleipävehnä jauho ja 2 dl kruunu-vehnäjauhoja",["Date","2022-02-16T16:17:10.000Z"],{"text":240,"timestamp":241,"topicId":5,"sentiment":6,"topicConfidence":231,"sentimentConfidence":242},"Help. Need to find a translation office that will translate and stamp an iranian\u002Ffarsi driving lisence. Any suggestions?",["Date","2022-02-02T12:06:13.000Z"],0.85,{"text":244,"timestamp":245,"topicId":5,"sentiment":25,"topicConfidence":7,"sentimentConfidence":153},"Hello everyone! I am a master's student in Tallinn University and currently working on my thesis that researches foreigners' experience with translation services in Estonia.  I need some help with a questionnaire that should take about 5 minutes to complete and is anonymous. If you can find the time to answer, it is much appreciated! Thank you! Here is the link:  https:\u002F\u002Fdocs.google.com\u002Fforms\u002Fd\u002Fe\u002F1FAIpQLSdBi-P8yS6NBagmK26XPxYbcrds0RB2shBLycL3WauXqHoI_g\u002Fviewform?fbclid=IwAR2p8BGWPpTUPt0T3LDmwiiKHgAkRDjUDzzcZ8T8dlcLUjE-uYfBAlOdpvA",["Date","2022-01-26T09:15:17.000Z"],{"text":247,"timestamp":248,"topicId":5,"sentiment":25,"topicConfidence":7,"sentimentConfidence":55},"Win a trial driving test! It is really useful to prepare for the state driving test.",["Date","2022-01-22T11:02:16.000Z"],{"text":250,"timestamp":251,"topicId":5,"sentiment":6,"topicConfidence":7,"sentimentConfidence":252},"Hey guys, could someone recommend a private driving instructor that operates in kesklinn (city center) and has an automatic?",["Date","2022-01-19T13:29:02.000Z"],0.9,{"text":254,"timestamp":255,"topicId":5,"sentiment":25,"topicConfidence":7,"sentimentConfidence":13},"Hello ladies and gentlemen, We would like to introduce you to our driving school. Maybe you are looking for one. One of the main prioritised work flows in our driving school - are courses in English. We provide our services in several areas: - B category courses (Car) - A category (motorcycle) - Winter driving (final stage of the courses) - Online live streming theory course (New feature!) In addition we have a possibility of attending the courses online. It will help you to save your time, since you would be able to attend the classes from home and not spend your time on traveling via public transport to the driving school. Moreover, there is an opportunity to register for the exam in… More",["Date","2022-01-11T09:16:14.000Z"],{"text":257,"timestamp":258,"topicId":5,"sentiment":6,"topicConfidence":7,"sentimentConfidence":68},"Good morning guys, could anybody recommend a professional translator between Estonian and English to accompany me in an interview with the FIU on January 20th?. The test will last about 5 hours and the translator's job is to translate the interviewer’s question and vice versa.",["Date","2022-01-09T19:33:14.000Z"],{"text":260,"timestamp":261,"topicId":5,"sentiment":25,"topicConfidence":7,"sentimentConfidence":149},"The Google translate in Chrome for this article his very funny 😅. The subject is not unfortunately.😔 ''The angel himself is a volunteer conflict solver'' 😅",["Date","2022-01-08T18:19:18.000Z"],{"text":263,"timestamp":264,"topicId":5,"sentiment":25,"topicConfidence":7,"sentimentConfidence":218},"Hello! Does anybody knows a professional translator that can do Spanish-Estonian? (somebody that has translated full literature type of books in Spanish before--  perhaps a philologist, not just a spanish(estonian) speaker). Thank you!",["Date","2022-01-08T12:34:05.000Z"],{"text":266,"timestamp":267,"topicId":5,"sentiment":6,"topicConfidence":235,"sentimentConfidence":161},"Boost your website traffic - translate it into Russian!  I am in between projects, and have more than enough of free time, so in order not to get bored at home I'm offering my translation services, something I used to do years ago professionally. Ready to translate your website, any contract, document, e-mail or whatever you need from English, French, Estonian or Serbian\u002FCroatian into Russian. For big and serious projects a list of executed projects\u002Fpartners will be provided. P.S. I don't want to get into political debates on language superiority in a particular geographic region, it's just business!  Besides, having photography as hobby (and business sometimes), I feel that my photo camera… More",["Date","2022-01-07T11:14:30.000Z"],{"text":269,"timestamp":270,"topicId":5,"sentiment":25,"topicConfidence":7,"sentimentConfidence":47},"Hello wonderful people  Im doing my masters in Tallinn university, and about to submit my thesis but from this year it’s mandatory to translate the abstract (half a page) into Estonian. So i know there is good amount oh Estonians in this group and i was wondering if some one can validate the google translations as some times its not correct. ￼ Please DM me if you can help  Thanks in advance",["Date","2022-01-02T10:14:54.000Z"],{"id":5,"label":272,"color":273},"driving, translator, translate","#59a14f",[275,278,281,284,287,289,292,295,297,299],[276,277],"driving",280,[279,280],"translator",180,[282,283],"translate",140,[285,286],"license",120,[288,286],"exam",[290,291],"translation",100,[293,294],"theory",60,[296,294],"school",[298,294],"estonian",[300,294],"instructor"],"uses":{"params":["topic_id"]}}]}
