{"type":"data","nodes":[null,{"type":"data","data":[{"posts":1,"topic":649,"representativeWords":652},[2,9,13,17,23,27,32,36,41,44,47,52,56,60,64,69,72,77,82,86,90,94,98,103,106,110,113,117,120,125,129,134,138,141,144,148,151,154,158,163,166,169,173,176,179,182,186,189,192,196,199,202,206,209,212,216,219,222,225,228,231,235,238,242,245,248,251,254,257,260,263,266,269,272,275,278,281,285,288,291,294,298,301,304,307,310,315,318,322,325,328,331,334,338,342,345,348,351,354,358,361,365,368,371,374,377,380,383,386,389,392,395,398,401,404,407,410,413,416,419,422,425,428,431,434,437,440,443,446,449,452,455,458,461,464,467,470,473,476,479,482,485,488,491,494,497,500,503,506,509,512,516,519,522,525,528,531,534,537,540,543,546,549,552,555,558,561,564,567,570,573,576,579,582,585,588,591,594,597,600,603,606,609,612,615,618,621,624,627,630,633,636,639,642,645],{"text":3,"timestamp":4,"topicId":5,"sentiment":6,"topicConfidence":7,"sentimentConfidence":8},"As far as I know recently some Iranian students at Tallinn University organized an event regarding the current ongoing protests in Iran. If anyone aware, please send me the link for that news. I am sure I saw this as a news somewhere.",["Date","2022-12-19T15:21:08.000Z"],2,"Neutral",1,0.69,{"text":10,"timestamp":11,"topicId":5,"sentiment":6,"topicConfidence":7,"sentimentConfidence":12},"Dear Folks, Join us this Saturday, December 17th for the “Silence March” in solidarity with innocent victims of executions in IRAN. We will gather at Toompea 8 and walk towards the Parliament (Riigikogu) building to show our disgust at the oppressive IR regime. Several protest performances will be held to condemn the regime of the Islamic Republic. p.s. Permission for the event has been granted by Police.  https:\u002F\u002Ffb.me\u002Fe\u002F2kdFiJEdQ #MahsaAmini  #WomanLifeFreedom",["Date","2022-12-14T13:45:58.000Z"],0.58,{"text":14,"timestamp":15,"topicId":5,"sentiment":6,"topicConfidence":7,"sentimentConfidence":16},"Power to the people. Do you want to see more supermarket wars. NB: For Educational Purposes only, no political uprising. Admins 🙏🏿🙏🏿🙏🏿",["Date","2022-11-25T10:34:58.000Z"],0.66,{"text":18,"timestamp":19,"topicId":5,"sentiment":20,"topicConfidence":21,"sentimentConfidence":22},"Hello everyone, I know it’s a long shot but do you know companies that ship to Ukraine? A friend of mine needs to send a generator to her parents.  Thank you in advance!",["Date","2022-11-24T07:08:21.000Z"],"Positive",0.86,0.67,{"text":24,"timestamp":25,"topicId":5,"sentiment":6,"topicConfidence":26,"sentimentConfidence":26},"Since the beginning of the Russia’s aggression in Ukraine, Centre for Applied Social Sciences team in the University of Tartu has worked to support Ukrainians who have arrived to Estonia. We have supported Estonian Ministries with data and studies that enable to provide to the Ukrainian refugees in Estonian the help they need. We are conducting study for Estonian Ministry of Social Affairs aimed at understanding what support need refugees who do not work and are not registered in Estonian Unemployment Insurance Fund. There are many reasons for this: need to take care of children and other family members, studying, health problems, difficulties in finding a job, etc. If you are one of them… More",["Date","2022-11-17T07:07:51.000Z"],0.65,{"text":28,"timestamp":29,"topicId":5,"sentiment":20,"topicConfidence":30,"sentimentConfidence":31},"Hey! The Iranian community still need your sustain in this hard time they are facing. Don hesitate to join!",["Date","2022-11-15T17:31:24.000Z"],0.78,0.51,{"text":33,"timestamp":34,"topicId":5,"sentiment":6,"topicConfidence":7,"sentimentConfidence":35},"On Saturday, November 19, We will gather in Freedom Square in memory of more than 1500 victims who killed by Islamic Republic Regime in Iran. Time: 14:00 - 16:00",["Date","2022-11-15T16:48:43.000Z"],0.61,{"text":37,"timestamp":38,"topicId":5,"sentiment":6,"topicConfidence":39,"sentimentConfidence":40},"Hello, is it mandatory for prison administration to give information about some prisoner to his family asking about the status of his case? thank you",["Date","2022-11-01T17:38:59.000Z"],0.36,0.82,{"text":42,"timestamp":43,"topicId":5,"sentiment":6,"topicConfidence":7,"sentimentConfidence":12},"🔴We now have common ENEMIES! While Ukrainian people are fighting against Putin, In Iran, people are fighting for freedom, against the dictators who are killing, raping and suppressing innocents meanwhile supporting Putin with war drones to attack Ukraine. In solidarity with the people of Ukraine and Iran, we are going to have a human chain from Vabaduse valjak to the Embassy of Russia in Tallinn. Permission for this event has been granted by Police.  Feel free to take your banners, photos and flags with you.  #woman_life_freedom #mahsa_amini https:\u002F\u002Ffb.me\u002Fe\u002F2e31Nf38u",["Date","2022-10-27T08:58:56.000Z"],{"text":45,"timestamp":46,"topicId":5,"sentiment":6,"topicConfidence":7,"sentimentConfidence":35},"🛑We now have a common ENEMY While Ukrainian people are standing against Putin (not Russians), In Iran, people are fighting for freedom, against dictator who is killing and  suppressing innocents, while they supporting Putin with war drones to attack Ukraine. In solidarity with the people of Ukraine and Iran, we are going to have a human chain from Vabaduse valjak to the embassy of Russia in Tallinn. Permission for this event has been granted by Police.  Feel free to take your banners with you Time: Saturday 29th October 16:00-18:00",["Date","2022-10-26T19:38:17.000Z"],{"text":48,"timestamp":49,"topicId":5,"sentiment":50,"topicConfidence":7,"sentimentConfidence":51},"Friends, please sign a petition created by belarusians in Estonia about not allowing pro-putin singers\u002Fbands to have concerts in Estonia. We think those who support agression, terror and war do not have right to earn money in democratic countries. Thank you for your support 🙏🇺🇦❤",["Date","2022-10-23T16:19:32.000Z"],"Negative",0.6,{"text":53,"timestamp":54,"topicId":5,"sentiment":6,"topicConfidence":55,"sentimentConfidence":12},"For expats who have a right to know what russia is doing to Ukraine now.",["Date","2022-10-23T09:58:36.000Z"],0.99,{"text":57,"timestamp":58,"topicId":5,"sentiment":20,"topicConfidence":7,"sentimentConfidence":59},"Friends, join us today to celebrate the Day of Defence Forces of Ukraine! 🇺🇦",["Date","2022-10-14T09:19:00.000Z"],0.96,{"text":61,"timestamp":62,"topicId":5,"sentiment":6,"topicConfidence":7,"sentimentConfidence":63},"St. Petersburg-Based Media Paper has Launched an English-language Podcast about Russian Resistance Every week \"Russian Resistance\" tells the stories of people who are not afraid to speak out against the war and oppose Russian authorities and propaganda.  Together with feminist activist Daria Serenko, Nogu Svelo band leader Maxim Pokrovsky, Pussy Riot participant Maria Alyokhina and other brave people Paper Media discuss why their guests keep fighting and why there’s still hope. Listen http:\u002F\u002Fpapersupport.ru\u002Frussian_resistance_podcast?utm_medium=article&utm_campaign=for \"Russian Resistance\" on all major platforms if you want to understand what is happening in Russia against the background of the war with Ukraine.",["Date","2022-10-12T11:59:27.000Z"],0.63,{"text":65,"timestamp":66,"topicId":5,"sentiment":6,"topicConfidence":67,"sentimentConfidence":68},"Hi everyone, I am making a solidarity action with the association Refuge Estonia to help them raise money to keep helping in Ukraine. Refuge Estonia is a non-profit organisation that have been since the unfortunate beginning of the war in Ukraine helping on the front, by going there to bring supplies such as food, health product and cars. They still need help and I decided to join them to organize a draw\u002Flotto action.  I created a crochet cardigan that would be the prize. Every donation you can make, the amount of your choice at Refuge Estonia from the 2 of October until the 16 of October is a chance for you to win this cardigan. We will pick randomly on the 17 of October between all the… More",["Date","2022-10-09T16:22:15.000Z"],0.88,0.53,{"text":70,"timestamp":71,"topicId":5,"sentiment":6,"topicConfidence":7,"sentimentConfidence":26},"What happens today in Ukraine, has happened in Georgia, years ago. We share the heart aching experience...Learn more about Abkhazia 👇 https:\u002F\u002Fwww.facebook.com\u002FAbkhazian.Story",["Date","2022-10-07T08:04:20.000Z"],{"text":73,"timestamp":74,"topicId":5,"sentiment":50,"topicConfidence":75,"sentimentConfidence":76},"Women’s rights are human rights. Violence against women and girls is unacceptable, yet, enforced by many countries under the flag of “morality”.  ✋🏽 Control of the female body and oppression of women needs to stop 🛑  **We can show our support to Iranian women’s movement today, men and women together🌿🤝**  “These are protests against the compulsory hijab and controlling women. They have support even among women who believe in Islam and who choose to wear it, but they don’t agree with the compulsory hijab and they definitely don’t agree with the violence which is used to enforce it... ...The hijab, a headscarf worn by Muslim women, became mandatory in Iran after the 1979 Islamic Revolution,… More",["Date","2022-10-01T06:21:27.000Z"],0.95,0.72,{"text":78,"timestamp":79,"topicId":5,"sentiment":50,"topicConfidence":80,"sentimentConfidence":81},"Women’s rights are human rights. Violence against women and girls is unacceptable, yet, enforced by many countries under the flag of “morality”.  Control of the female body and oppression of women needs to stop.  **We can show our support to Iranian women’s movement today, men and women together🌿🤝**  “These are protests against the compulsory hijab and controlling women. They have support even among women who believe in Islam and who choose to wear it, but they don’t agree with the compulsory hijab and they definitely don’t agree with the violence which is used to enforce it... ...The hijab, a headscarf worn by Muslim women, became mandatory in Iran after the 1979 Islamic Revolution, which… More",["Date","2022-10-01T06:13:27.000Z"],0.76,0.71,{"text":83,"timestamp":84,"topicId":5,"sentiment":6,"topicConfidence":7,"sentimentConfidence":85},"Time has come We are standing beside Iranian youths who are fighting against dictator regime of Iran. Not only in Tallinn but all over the world. Let’s gather, support, and help to find a peaceful Iran which led to a peaceful middle east, which cut off the financial and weapons support to militants. You don’t believe? check this out👇🏼👇🏼👇🏼 https:\u002F\u002Fwww.theguardian.com\u002Fworld\u002F2022\u002Fsep\u002F29\u002Frussia-escalating-use-of-iranian-kamikaze-drones-ukraine-reports-say Note : the event has registered officially",["Date","2022-09-30T13:52:23.000Z"],0.64,{"text":87,"timestamp":88,"topicId":5,"sentiment":50,"topicConfidence":7,"sentimentConfidence":89},"Do you care about human rights? Stand With Iranian Women.  The biggest war for women rights is now happening in IRAN and the Islamic Republic is killing civilians.  Let help their voice be heard by the World.  Today Sep. 21, 18:00-19:00 at Freedom Square (Vabaduse väljak).  Try sharing what's happening there even if you cannot attend. You can find more about it by #IranProtests or #MahsaAmini. Please don't be silent.",["Date","2022-09-21T08:25:45.000Z"],0.59,{"text":91,"timestamp":92,"topicId":5,"sentiment":50,"topicConfidence":93,"sentimentConfidence":12},"Friends, we invite you to watch a movie about Mariupol - the city, which Russian terrorists destroyed fully. This is one of the cities and places in Ukraine, where the biggest cruelty, violence, inhumanity took place and still all this disaster continues for local residents. In Estonia we have a huge wave of Ukrainians from Mariupol, who had chance to escape or were forced to pull to Russia. For many people from Ukraine, who live in Estonia now, this was a real life.  The movie with English and Estonian subtitles, admission is free.",["Date","2022-09-07T16:15:23.000Z"],0.81,{"text":95,"timestamp":96,"topicId":5,"sentiment":50,"topicConfidence":97,"sentimentConfidence":21},"Hi everyone, You must have already heard about ’super floods’ in Pakistan which have left 1\u002F3rd of the country under water, with 33 million (and counting) people displaced and over a thousand dead. Over 2 million acres of farm land has been affected, and around half of Pakistan’s cotton crops have now been destroyed. Agriculture accounts for ~ 25% of Pakistan’s GDP, and cotton is a major export.  To put this into perspective, 33 million means around 87% of the population of Canada. In terms of damage to economy too, it’s a HUGE hit for the country.  It breaks my heart to watch news from back home and so I’m sharing with you some reliable places you can donate to.  1. Go Fund Me has compiled… More",["Date","2022-09-03T06:40:05.000Z"],0.44,{"text":99,"timestamp":100,"topicId":5,"sentiment":6,"topicConfidence":101,"sentimentConfidence":102},"One third of country is under water. Death toll crosses 11,00. Houses destroyed 992,871. Livestock death 727, 144. Millions in need for aid after devastating floods in Pakistan. Humanitarian workers expect conditions to worsen as monsoon rains continue and say millions face a terrible winter.  If you can, please donate for flood affected people in Pakistan. Today its Pakistan, tomorrow can be your country, as pointed out by sec UN. How to help Pakistan’s flood victims? There is an informative news article https:\u002F\u002Fwww.pbs.org\u002Fnewshour\u002Fworld\u002Fhow-to-help-pakistans-flood-victims providing some links of international and national non-profit organisations working for flood relief. Review their profiles, area and domain of relief work and chose by your own. Links of other active local NGOs and foundations are listed in comments.",["Date","2022-09-02T07:19:56.000Z"],0.46,0.49,{"text":104,"timestamp":105,"topicId":5,"sentiment":20,"topicConfidence":40,"sentimentConfidence":81},"Friends, join us on 24th August when Ukraine celebrates the Independence Day from Soviet Occupation 🇺🇦🇺🇦🇺🇦",["Date","2022-08-22T20:13:29.000Z"],{"text":107,"timestamp":108,"topicId":5,"sentiment":6,"topicConfidence":8,"sentimentConfidence":109},"The Maarjamäe memorial in Pirita area, depicting the journey of the victims of communism, is dedicated to Estonian people who suffered the terror of the Soviet regime. The memorial consists of two parts – 'Journey', with name plaques of the victims, and a symbolical 'Home Garden', with informative texts and stone tablets marking the sites of terror. The memorial includes a monument dedicated to Estonian officers who fell victim to Communist terrorism. Estonia lost a fifth of its population of just over one million to Soviet terrorism, many of whom still rest in unmarked graves. The memorial complex is dedicated to the victims of communism and serves to remind us of the fragility of freedom and human life.  Vast park area next to the sea is also a pleasant place for long walks.",["Date","2022-08-13T08:23:56.000Z"],0.55,{"text":111,"timestamp":112,"topicId":5,"sentiment":6,"topicConfidence":7,"sentimentConfidence":89},"Guys, help us get more votes in petition! https:\u002F\u002Frahvaalgatus.ee\u002Finitiatives\u002F3c67e809-76fa-448d-9cec-511e2e1231ed WE ARE AGAINST THE WAR!",["Date","2022-08-11T21:46:39.000Z"],{"text":114,"timestamp":115,"topicId":5,"sentiment":50,"topicConfidence":116,"sentimentConfidence":116},"Washington Post:  “The worst scenario is that Ukraine loses land, no longer has a strong  commodity economy and becomes more like one of the BALTIC STATES, a  nation unable to sustain its industrial economy,”",["Date","2022-08-10T15:10:30.000Z"],0.89,{"text":118,"timestamp":119,"topicId":5,"sentiment":50,"topicConfidence":7,"sentimentConfidence":67},"Hello amazing people. Today at 6pm on Vabaduse Valjak will be protest against Russian aggression. We usually think that what happened it could not be worse anymore, but then Russian terrorists show us the opposite. This weekend Russia made a terrorist act against our prisoners of war. In the village Olenivka (Donetsk oblast) they held Ukrainians solders in a local colony, on the 29th July Russians blew up the colony with Ukrainian prisoners and killed more than 50 people (but no one knows the exact numbers), and a lot of PoWs are wounded. PoWs are protected by guarantees of the United Nations, but this gesture shows us that Russia does not care about international interests and legislation,… More",["Date","2022-08-02T07:07:20.000Z"],{"text":121,"timestamp":122,"topicId":5,"sentiment":20,"topicConfidence":123,"sentimentConfidence":124},"Palette is looking for volunteers to work with children from Ukraine. We have classes every Sunday that run from 1-1:30pm. Your support is very important! 👩 🎨👨 🎨 To join us call or write +372 58283974 Palette is looking for volunteers to work with children from Ukraine. We have classes every Sunday which lasts from 1 to 1:30 hour. Your support is very important! To join us please call or text +372 58283974 Palette is looking for volunteers to work with children from Ukraine. We have classes every Sunday that run from 1 to 1:30. Your support is very important! To join us call or write +372 58283974",["Date","2022-07-30T19:34:24.000Z"],0.38,0.85,{"text":126,"timestamp":127,"topicId":5,"sentiment":50,"topicConfidence":128,"sentimentConfidence":75},"This is just heart wrenching and aggravating😡 I hope they get to the bottom of this and bring the perpetrators to book! I just feel sorry for the family of this beautiful individual and I pray their family have the fortitude to bear the loss",["Date","2022-07-26T15:44:59.000Z"],0.41,{"text":130,"timestamp":131,"topicId":5,"sentiment":6,"topicConfidence":132,"sentimentConfidence":133},"OMG people, I never thought this would happen in this country 😭 https:\u002F\u002Fwww.delfi.ee\u002Fartikkel\u002F120040994\u002Fpaari-nadala-eest-raekoja-platsi-korteris-tapetud-isik-oli-transsooline-naine?fbclid=IwAR2UK5TTOjMjWXBrMQ0nHGdnG5rKqB7d1G77NTjdf83EBmzEZGF6vwlZ0eY  If you know anything to help solve this case kindly contact the police.Hello everyone, It's with a very heavy heart I am coming publicly to say that on Saturday July 09, 2022 my cousin Sabrina Houston  was found Stabbed multiple times in her hotel room in Estonia where she was visiting 💔 😢 ❤️ 💙 This information was confirmed to me by the Estonian police who call me this afternoon to inform me with heart broken 💔 news.😭😭😭😭😭😭 Sabrina and I was close I spoke with her Saturday morning at 01:32am and she message later that morning saying \"Morning \" at 07:00am the next thing to hear is that she was found murder in her hotel room  She was a loving, kindhearted and caring person. She love children, her family are everything to her.. She was genuine to her friends.. she was talented she was educated She was a beautiful young black Trans Woman🏳️‍⚧️🇯🇲🇳🇱🇩🇪🇪🇸🇫🇷🇳🇴🇫🇮🇸🇪🇮🇸🇩🇰 🇲🇽🇪🇪   Sabrina you gone so soon with get to say goodbye but we will see each other one day again my heart is broken 💔 but now I know  you will keep watching over me. I miss you and I will always have you in my heart I will never forgot you my Cousin, my Best friend  💔😭💔😭💔😭💐💐💐💐💐💐💐💔😭💔",["Date","2022-07-26T07:16:44.000Z"],0.7,0.45,{"text":135,"timestamp":136,"topicId":5,"sentiment":50,"topicConfidence":7,"sentimentConfidence":137},"Three men were found guilty of supporting Russian aggression by Harju County County on Thursday. One man was found to have purchased drones for the Russian military.👇",["Date","2022-07-22T13:05:44.000Z"],0.83,{"text":139,"timestamp":140,"topicId":5,"sentiment":6,"topicConfidence":7,"sentimentConfidence":137},"Hi, is there someone in Rapla that can give a bike for a Ukrainian who needs it for going to work? If yes, I will give you the contact of that person. I don't know more.",["Date","2022-07-16T19:25:09.000Z"],{"text":142,"timestamp":143,"topicId":5,"sentiment":6,"topicConfidence":7,"sentimentConfidence":124},"What are your thoughts about coming The Great Reset aka Soviet 2.0?",["Date","2022-07-13T04:15:39.000Z"],{"text":145,"timestamp":146,"topicId":5,"sentiment":20,"topicConfidence":133,"sentimentConfidence":147},"Join us! 🥰 The International Organization for Migration (IOM) established its operations in Estonia in 2004. Across the country IOM provides a comprehensive response to the humanitarian needs of migrants, internally displaced persons, returnees and host communities through humanitarian direct assistance, recreational activities, and a variety of other efforts. 👉English is a must. 👉Estonian and Russian are a big plus! Find all the details at https:\u002F\u002Fbit.ly\u002F3yVWM8k Apply by July 20!",["Date","2022-07-12T06:53:25.000Z"],0.92,{"text":149,"timestamp":150,"topicId":5,"sentiment":20,"topicConfidence":85,"sentimentConfidence":89},"Hi everyone. We (me, my 4yo daughter and my Mom) are refugees from Ukraine based in Tartu. Next weekends 1.07-02.07 we will be in Tallinn to make some paper work in Ukrainan embassy. Who will be so kind and host us for 1 or 2 nights? Thanks in advance.",["Date","2022-06-24T20:37:43.000Z"],{"text":152,"timestamp":153,"topicId":5,"sentiment":20,"topicConfidence":137,"sentimentConfidence":81},"Well done Eesti.  Estonia has been credited by Microsoft as one of the best in Europe against Russian Cyberattacks.  Full Quote: A striking exception was Estonia, where Microsoft said it had detected no Russian cyber intrusions since Mr Putin launched the full-scale invasion of Ukraine in February.",["Date","2022-06-23T09:13:01.000Z"],{"text":155,"timestamp":156,"topicId":5,"sentiment":20,"topicConfidence":40,"sentimentConfidence":157},"Hello! I posted today on this Ukrainian refugee group that I was donating a few personal and household items;  and the inbox response was instantaneous and overwhelming. The response showed me really need basic items. So, if you have items to give away, I think they would really appreciate it.   The link is below. https:\u002F\u002Fwww.facebook.com\u002Fgroups\u002Fukrainasobradeestis",["Date","2022-06-15T17:52:28.000Z"],0.87,{"text":159,"timestamp":160,"topicId":5,"sentiment":50,"topicConfidence":161,"sentimentConfidence":162},"Installation “Wagon of tears” on Freedom square in Tallinn remembers and commemorates the thousands of people deported on June 14 in 1941. Half of the tears are in Ukraine colours this year… Deportation stories have found their ways into local poets creation. On the square you can hear some of the poems presented by local actors. And before you ask, the balloons will not be released.",["Date","2022-06-14T12:51:03.000Z"],0.74,0.48,{"text":164,"timestamp":165,"topicId":5,"sentiment":50,"topicConfidence":7,"sentimentConfidence":31},"We ask those who can contribute a little. :) Short version: Many Ukrainian war refugees do not have anything to eat, and we are trying to help them. https:\u002F\u002Ftoeta.me\u002Fprojects\u002Ftoidukorv-sojapogenikele\u002F Long version: At the moment, more than 40 thousand Ukrainian war refugees have already arrived in Estonia and it is estimated that around 30 thousand have remained here. Many of them arrived here by a difficult route, leaving behind a lot of basic necessities. And it has not been easy for many of them to start out here either. There are support groups, people have organised basic necessities, furniture, clothes, they have helped with accommodation. But many have either simply not been lucky,… More",["Date","2022-06-03T17:27:42.000Z"],{"text":167,"timestamp":168,"topicId":5,"sentiment":20,"topicConfidence":7,"sentimentConfidence":59},"Hello everyone!  I have a friend who's looking forward to give to charity some stuff he no longer needs. He wants to specifically give it to a charity involved in helping Ukrainians. Do you know of any place that is taking charity? It's mostly furniture although I don't have the specifics. Any help will be greatly appreciated!  Have a great week!",["Date","2022-05-30T10:44:17.000Z"],{"text":170,"timestamp":171,"topicId":5,"sentiment":6,"topicConfidence":7,"sentimentConfidence":172},"i heard some place in kopli 70 there is place where you can donate stuff ? what is the site or group about it ? For Ukrainian people I suppose",["Date","2022-05-30T10:09:58.000Z"],0.9,{"text":174,"timestamp":175,"topicId":5,"sentiment":6,"topicConfidence":21,"sentimentConfidence":81},"Please join TIRC  this Friday at Ocean 11 for  their 18th Anniversary Gala to raise money for Ukrainian Refugees in Estonia. Click on event for further details. RSVP by 17.05.22.",["Date","2022-05-15T20:58:50.000Z"],{"text":177,"timestamp":178,"topicId":5,"sentiment":20,"topicConfidence":76,"sentimentConfidence":40},"Tallinn city centre supports Ukraine 🇺🇦 I do it too ! They accept the payments for Ukrainian gadgets via bank transfer",["Date","2022-05-15T12:23:36.000Z"],{"text":180,"timestamp":181,"topicId":5,"sentiment":6,"topicConfidence":7,"sentimentConfidence":30},"Słuchajcie, jest akcja: Moja firma kupiła samochód dla ukraińskiego wojska (manual) i wypełniła go pomocą humanitarną. Potrzebujemy kogoś, kto podrzuci go na granicę w sobotę 14.05. Pokrywamy wszystkie koszty podróży do granicy i powrót.  Może znajdzie się tu jakaś dobra dusza ;)*TARTU* Anyone is willing to help Ukrainian volunteers? 🇺🇦 🙏 My company purchased a car (manual gearbox) for Armed Forces of Ukraine and filled it with humanitarian aid. I am looking for someone with a drivers license to drive it from Tartu to Polish\u002FUkrainian border (Border crossing Zosin - Ustyluh, DK74, Zosin, Poland) on Saturday, May 14th. We just need to leave the car on the Polish side, volunteer from Ukraine will cross the border to pick it up and deliver to Ukraine. We will take all the expenses on ourselves, everything is covered including a return trip to Estonia",["Date","2022-05-11T21:30:30.000Z"],{"text":183,"timestamp":184,"topicId":5,"sentiment":20,"topicConfidence":7,"sentimentConfidence":185},"Great Russian service",["Date","2022-05-03T17:00:27.000Z"],0.77,{"text":187,"timestamp":188,"topicId":5,"sentiment":6,"topicConfidence":7,"sentimentConfidence":63},"Hi, guys, to tell the story short: we’re from Ukraine and my friend Yaroslav(https:\u002F\u002Ft.me\u002Fyarik_vv) has direct access to the Ukrainian Air Assault Forces which are working in the east, and which are in need of much stuff - starting from USB flash drives and ending with various vehicles (we’ve got quite a long list). Now the top priority here is thermal imaging monoculars - to do their specific tasks they need Pulsar Helion 2 XP50 PRO and XQ50 and vehicles. We have already raised around 9.5K USD targeting close friends and people we know and have already purchased 2 thermal imagers from Poland and Austria. This time we decided to expose our little initiative to support Ukraine to a wider… More",["Date","2022-04-25T08:23:21.000Z"],{"text":190,"timestamp":191,"topicId":5,"sentiment":20,"topicConfidence":55,"sentimentConfidence":21},"Hi, I created a charity- and handicrafts club called A Stand with Ukraine. (Get the pun? It’s like a booth\u002Fstand and also like “standing for” Ukraine.)  Our booth is next to Vabaduse Väljak (the Freedom Square) by Suur-Karja 18 and it’s usually manned between 9:30 and 17ish if the weather is good. We get together with a group of Ukrainian refugees and local Estonians once a week in my home. My goal is to help them make friends and de-stress together by creating pretty arts and crafts, drinking tea together, gossiping a little and letting our children play together. They also have an opportunity to make some money in a way that involves zero bureaucracy. The women whose husband is still in… More",["Date","2022-04-24T14:00:36.000Z"],{"text":193,"timestamp":194,"topicId":5,"sentiment":20,"topicConfidence":195,"sentimentConfidence":59},"Hi everyone 🤗 my parents are hosting a Ukrainian family. We have managed to find a job and accommodation for them, but we'd be super grateful if someone could donate 1-2 bicycles (ideally for women, but not a must) for them, as the bus connection to work for both of them is very long and it would be easier to reach work by bike. Thank you in advance 💞",["Date","2022-04-23T16:30:28.000Z"],0.8,{"text":197,"timestamp":198,"topicId":5,"sentiment":6,"topicConfidence":7,"sentimentConfidence":162},"Does anyone happen to know if there are legal services available for Ukrainian Refugees?  I swear I read somewhere there are, but can’t seem to find the info. now that I am looking. Thx",["Date","2022-04-22T12:03:47.000Z"],{"text":200,"timestamp":201,"topicId":5,"sentiment":20,"topicConfidence":7,"sentimentConfidence":132},"A friend of mine from the states is trying to get some ground information for an NGO doing food relief (world central kitchen) and she is looking for someone who might be able to do an assessment of the Ukrainian refugees situation in Estonia.  Would anyone be up for this task and be able to help with this? If yes, please DM would love to connect you to my friend.  Cheers!",["Date","2022-04-19T16:10:09.000Z"],{"text":203,"timestamp":204,"topicId":5,"sentiment":6,"topicConfidence":7,"sentimentConfidence":205},"This Sunday at 7PM-10PM, candles are lit in the Freedom Square in the memory of hundreds of children who have lost their lives due to Russian aggression in Ukraine. If you wish to bring your own candle and light it on the square, you are very welcome. #standwithukraine",["Date","2022-04-19T08:59:31.000Z"],0.56,{"text":207,"timestamp":208,"topicId":5,"sentiment":6,"topicConfidence":81,"sentimentConfidence":93},"I just wanted to share this information. For those with friends in Ukraine. The postal service is offering free postage to any individual or organization that will accept your package. Right now this is only for packages coming from Austria, Czech Republic, Estonia, Georgia, Slovenia, Slovakia, Ireland, Cyprus, Armenia, Hungary, Grency, Gibraltar and Jersey. 🌎 Ми запровадили безкоштовну допомогу українцям з-за кордону! ⠀ Безкоштовні посилки в Україну можна надсилати з 14 країн світу. Достатньо мати лише адресу, індекс та контакти українця або організації, що прийматиме допомогу. Доставка буде здійснюватися до відділення Укрпошти. ⠀ Це ініціатива, яку ми реалізовуємо разом з національними… More",["Date","2022-04-16T04:57:31.000Z"],{"text":210,"timestamp":211,"topicId":5,"sentiment":20,"topicConfidence":59,"sentimentConfidence":8},"Welcome to attend the free online government update from the Ministry of Digital Transformation of Ukraine and the Ministry of Social Policy of Ukraine.      Thursday, 14th April 2022: 5pm Ukraine time  Register free here:",["Date","2022-04-12T00:56:28.000Z"],{"text":213,"timestamp":214,"topicId":5,"sentiment":6,"topicConfidence":7,"sentimentConfidence":215},"Hi, help is needed in Narva to assist Ukrainian refugees forcefully evacuated from Mariupol to Russia. This Thursday (14.04) 3 people should be met on the border or ideally in the neutral zone and assisted with getting transport to Tallinn (bus or train). Please share. Ищем людей в Нарве, которые могут помочь беженцам из Украины, которые были насильно вывезены из Мариуполя в Россию. В этот четверг (14.04) 3 человека нужно будет встетить на границе, или лучше на нейтральной территории, и помочь посадить на транспорт до Таллина (автобус или поезд). Репостим.",["Date","2022-04-11T13:41:14.000Z"],0.84,{"text":217,"timestamp":218,"topicId":5,"sentiment":6,"topicConfidence":7,"sentimentConfidence":89},"Hey everyone, I just wanted to shortly promote my work and show how easy it is to disprove Russian propaganda. As you may know, two rockets hit Kramatorsk railway station on 8th of April at 10:30. The missiles used were of the type Tochka-U. Russian authorities made the claim they could not be behind the attack as they do not use these types of missiles. In this thread I both prove that is not the case and also show that prior to and right after the attack, Russian Telegram channels actually PROMOTED the attack as theirs. I  have also written several articles of analysis on other topics related to the war.",["Date","2022-04-09T11:10:33.000Z"],{"text":220,"timestamp":221,"topicId":5,"sentiment":50,"topicConfidence":7,"sentimentConfidence":21},"Can someone who has courage explain what’s happening here … what is she talking about !?! Ukrainians are supposed to be Nazis because they say borscht is Ukrainian not Russian … actually we call it Ukrainian in Poland for centuries … but we also prepare this soup. Are we Nazis … this is becoming a circus \u002F nightmare. I feel being back to 1939.",["Date","2022-04-08T22:10:34.000Z"],{"text":223,"timestamp":224,"topicId":5,"sentiment":6,"topicConfidence":161,"sentimentConfidence":137},"tere everyone! does anyone know if there's any organisation \u002F volunteers in Estonia, maybe close to the border with Russia, who could meet Ukrainian people there, those who were forced to be evacuated to Russia but would want to escape to Europe? if you've heard about some group of people who is able to help refugees to find a place to sleep, get on a train, help with the documents, could you please let me know? aitäh! 🕊",["Date","2022-04-08T10:17:10.000Z"],{"text":226,"timestamp":227,"topicId":5,"sentiment":6,"topicConfidence":7,"sentimentConfidence":31},"I'm a Singaporean living in Estonia. I've seen that Singapore's Mandarin language channel seem to strongly blame Ukraine and sides with Putin's actions. I'm wondering if other Chinese media (except those from Hong Kong & Taiwan) actively support Putin's invasion of Ukraine? I'm asking here because I would like the perspective of Chinese expats living in Estonia, and how they compare the Chinese media from different countries.",["Date","2022-04-07T09:33:44.000Z"],{"text":229,"timestamp":230,"topicId":5,"sentiment":50,"topicConfidence":21,"sentimentConfidence":75},"Friends. We are all witnesses of a huge crime against humanity. Russian troops tortured, raped and killed civilians: men, women, inocent children ....Bucha, Irpin, Hostomel these days shocked all of us that there is no limit of evelness on this planet.  We, Ukrainian community, ask you to come with a candle on memory of all killed Ukrainians tomorrow at 17.30 on Vabaduse Väljak, Tallinn. Please stand with us and share our pain and tradegy. Our heart is broken, we are speechless, we cry and scream, all Ukraine and her people are screaming because our soul hurts ...",["Date","2022-04-06T19:20:21.000Z"],{"text":232,"timestamp":233,"topicId":5,"sentiment":20,"topicConfidence":234,"sentimentConfidence":51},"hi All ✋🇺🇦 I know Joanna from Poland 🇵🇱 personally. She is a great, brave Polish woman. Roman, her husband and Ukrainian went to Ukraine when the russian aggression began. Thank you for your help. They are fighting for us too.Dear Friends, my beloved husband Roman Sleepwalker Vikol is fighting in Ukraine. The collection is for the purchase of tactical clothing and equipment for fighters, as well as for children from orphanages. The items we collect go directly to those in need, the donation is always documented. We are supporting the places on the East of Ukraine. THE WAR CONTINUES AND THE NEEDS ARE STILL VERY HIGH. We are raising money through PayPal: lex.js@vip.interia.pl We are in dire need of purchasing: TACTICAL EQUIPMENT: tactical vests bulletproof vests helmets walkie-talkies elbow and knee pads ropes camouflage net tactical hand warmer drones night vision devices night vision devices sniper rucksacks… More",["Date","2022-04-05T20:22:32.000Z"],0.91,{"text":236,"timestamp":237,"topicId":5,"sentiment":6,"topicConfidence":7,"sentimentConfidence":147},"Hello  Does anyone knows if it needs to get a permission to held a small demonstration (about 10 people )  in Freedom Square ?",["Date","2022-04-03T09:20:05.000Z"],{"text":239,"timestamp":240,"topicId":5,"sentiment":6,"topicConfidence":7,"sentimentConfidence":241},"Friends, I had a call with Toidupank (Food bank), which  helps to support food for Ukrainian war refugees.  They kindly ask for food donations or financial support.  For food they do need food for children ‼ Please share with your friends and your companies you work in.  Unfortunately many Ukrainian families do not have money even to buy food for them and yheir children 😥",["Date","2022-03-31T21:45:17.000Z"],0.5,{"text":243,"timestamp":244,"topicId":5,"sentiment":20,"topicConfidence":26,"sentimentConfidence":109},"For expat chaga lovers Natural Chaga OÜ supports the Estonian Refugee Council's work with Ukrainian refugees Buy this limited edition 1 litre organic chaga elixir from our e-shop and we will donate 10€ (for each bottle we sell) to the Estonian Refugee Council (a registered charity in Estonia).",["Date","2022-03-31T06:33:03.000Z"],{"text":246,"timestamp":247,"topicId":5,"sentiment":20,"topicConfidence":51,"sentimentConfidence":109},"If you are a chaga lover..Natural Chaga OÜ supports the Estonian Refugee Council's work with Ukrainian refugees Buy this limited edition 1 litre organic chaga elixir from our e-shop and we will donate 10€ (for each bottle we sell) to the Estonian Refugee Council (a registered charity in Estonia).",["Date","2022-03-31T06:21:30.000Z"],{"text":249,"timestamp":250,"topicId":5,"sentiment":50,"topicConfidence":7,"sentimentConfidence":51},"This is absolutely true. I've been teaching English to people from around the world (online) as well as many Russians. The vast majority support this war and see \"The West\" as a single entity that is the enemy. Moreover, much of many other populations also support the War. Serbia, Malaysia, China, Indonesia to name but a few countries where the Media and the population largely support the invasion of Ukraine. (please google how Russian propaganda has succeeded in those countries instead of accusing me of making it up. You'll find plenty of news sources and videos from people of those countries, supporting Russia). I'm not talking about Russians living abroad. I'm speaking about Russians in… More",["Date","2022-03-27T08:05:13.000Z"],{"text":252,"timestamp":253,"topicId":5,"sentiment":6,"topicConfidence":101,"sentimentConfidence":12},"Has anyone driven across the Estonian border lately from Latvia? Is there a que or waiting time because of the Russian- Ukraine war?",["Date","2022-03-25T21:56:00.000Z"],{"text":255,"timestamp":256,"topicId":5,"sentiment":50,"topicConfidence":16,"sentimentConfidence":81},"Fear, heartache, broken dreams, homes left behind, ripped apart families, lost lives, destruction, hunger, uncertainty - this was deportation 73 years ago in Estonia. More than 22 000 Estonian people were taken to Siberia by force.  A remembrance installation on Freedom square today and tomorrow (25. and 26.03) highlights the boarders of Soviet Union. Red rail tracks show where people were taken.  For many years this event highlighted something written on history books. Today unfortunately it's reality to many people. Ceremony will take place at the Victims of Communism Memorial. Patarei prison will be lit in Ukrainian flag colours for the evening.  Video by Inimõiguste Instituut \u002F Estonian Institute of Human Rights",["Date","2022-03-25T12:18:08.000Z"],{"text":258,"timestamp":259,"topicId":5,"sentiment":20,"topicConfidence":7,"sentimentConfidence":80},"Update: African Students in Kherson, Ukraine. A few weeks ago, I requested help for a group of Africans stuck in Kherson, Ukraine. I wanted to let you that they have made it safely to Poland last night where they are receiving support from an organization. I wanted to give a shoutout to Kristilee Frost  for trying her very best to organize their evacuation FOR WEEKS. Unfortunately, the humanitarian corridors remain unopened in Kherson, and thus, her hands were tied.  The students actually made a decision to leave at their own risk and peril. They were successful in their second attempt.  Thank you all!",["Date","2022-03-25T10:50:15.000Z"],{"text":261,"timestamp":262,"topicId":5,"sentiment":50,"topicConfidence":7,"sentimentConfidence":51},"Hello Dear All. Sorry if my question is stupid, I am not as familiar with the Ukrainian refugees help in Estonia as I am with that in Finland. I have quite a few things for little kids that I could donate. The refugee families I am helping here have children of different ages and don’t need those things. Overall Finnish storages of such stuff seem to be over-filled. What is the situation in Estonia, is such stuff still needed? I’m cowing to Estonia in a couple of weeks and could bring stuff with me if there is a need for it. Where should I bring it?",["Date","2022-03-24T18:09:50.000Z"],{"text":264,"timestamp":265,"topicId":5,"sentiment":6,"topicConfidence":7,"sentimentConfidence":51},"Ukrainians who need help and support in Tallinn, Estonia , please, do not hesitate to reach out! I am ready to answer your questions. Please, share this video with your friends who might need help due to outrageous war in Ukraine. #ukraine #support #Україна",["Date","2022-03-24T09:35:49.000Z"],{"text":267,"timestamp":268,"topicId":5,"sentiment":50,"topicConfidence":7,"sentimentConfidence":205},"Russian National TV, government controlled. Supported by most \"ordinary innocent\" citizens. That's common there. Daily. Here is just one recent piece with English subtitles",["Date","2022-03-22T14:24:23.000Z"],{"text":270,"timestamp":271,"topicId":5,"sentiment":6,"topicConfidence":7,"sentimentConfidence":12},"Hello, my mum is living in the UK and has signed up to host Ukrainian refugees. The UK sponsor system works faster if individuals reach out themselves to find matches (uk government have haven't really offered much more than an online form)  I am reaching out to see if anybody knows of any fleeing Ukrainian women with children that are searching for sponsorship for refuge in the UK that she can sponsor and accommodate.  She has a CRB check, has been a Foster carer and has worked in social care for over 20 years. She lives alone and has two bedrooms to offer If anybody knows of anybody that I can put in touch please contact me here or private message Thanks!",["Date","2022-03-19T10:30:58.000Z"],{"text":273,"timestamp":274,"topicId":5,"sentiment":50,"topicConfidence":7,"sentimentConfidence":59},"Friends, tomorrow we orginise the protest against genocide of Ukrainian people. Russian troops kill our civilians and bomb the cities. Our hearts are broken💔. Our cities are destroyed and civilians are killed. More than 100 children were killed by Russians....Our cities Chernihiv, Kharkiv, Kyiv, MARIUPIL suffered the most!!!! Please stand with us, stand with Ukraine! 🇺🇦🇺🇦🇺🇦🙏",["Date","2022-03-18T20:06:00.000Z"],{"text":276,"timestamp":277,"topicId":5,"sentiment":20,"topicConfidence":7,"sentimentConfidence":215},"If you're wondering how to help Ukrainian war refugees, this is a good fundraiser that was passed along to me by an activist in Armenia.",["Date","2022-03-17T17:06:50.000Z"],{"text":279,"timestamp":280,"topicId":5,"sentiment":6,"topicConfidence":241,"sentimentConfidence":124},"Where can you buy the lapel ribbons with the Ukrainianian colors that people are wearing?",["Date","2022-03-17T11:52:50.000Z"],{"text":282,"timestamp":283,"topicId":5,"sentiment":50,"topicConfidence":7,"sentimentConfidence":284},"Remember, Russians didn't ask for this war either",["Date","2022-03-16T19:42:32.000Z"],0.62,{"text":286,"timestamp":287,"topicId":5,"sentiment":6,"topicConfidence":80,"sentimentConfidence":185},"Dear expats community,  I'm looking for a person who is the follower of Mazdean religion (you might know it under the improper name of Zoroastrism) for an historical project. If you know anyone please DM me. Cheers!",["Date","2022-03-16T16:53:12.000Z"],{"text":289,"timestamp":290,"topicId":5,"sentiment":20,"topicConfidence":75,"sentimentConfidence":147},"War refugees from Ukraine get free clothes assistance at the Aarete Laegas charity shop in Madala 3. There they also have a good amount of baby stuff for not a lot of money. https:\u002F\u002Faaretelaegas.ee\u002F Please share in other appropriate forums 💙💛",["Date","2022-03-15T16:47:43.000Z"],{"text":292,"timestamp":293,"topicId":5,"sentiment":20,"topicConfidence":75,"sentimentConfidence":161},"Another opportunity for Ukrainians in difficult times. A platform for job seekers to propose their CVs and for employers to announce offers dedicated to displaced people from Ukraine. Please share with anyone in needs!",["Date","2022-03-14T14:37:18.000Z"],{"text":295,"timestamp":296,"topicId":5,"sentiment":50,"topicConfidence":297,"sentimentConfidence":89},"Hello guys ,  Does anyone have information about people who have residents permit of Ukraine fleeing from the war and coming to Tallinn.  I can only see informations about Ukrainian citizens but nothing about Non ukrainian nationals of third countries who were legally residing in Ukraine and have a valid permanent resident permit of Ukraine and can’t go back to their country of origin. Any informations?",["Date","2022-03-14T13:07:00.000Z"],0.94,{"text":299,"timestamp":300,"topicId":5,"sentiment":20,"topicConfidence":7,"sentimentConfidence":284},"UKRAINIAN REFUGEES CAN TRAVEL FOR FREE ON TALLINA TRANSPORT, HARJU COUNTY & ELRON!",["Date","2022-03-13T13:31:56.000Z"],{"text":302,"timestamp":303,"topicId":5,"sentiment":6,"topicConfidence":7,"sentimentConfidence":12},"Hello, looking for Ukrainian speaking volunteers to help on Polish-Ukrainian border for 7-10 days. Accomodation in comfortable camping vans. All expensise are covered.  Register here -",["Date","2022-03-12T17:35:47.000Z"],{"text":305,"timestamp":306,"topicId":5,"sentiment":6,"topicConfidence":284,"sentimentConfidence":16},"Hi! My friend in Ukraine is in need of bulletproof vests. She’s a volonteer and they are collecting donations so they can pay for it. But supply is the problem. I wonder if anyone here has contact of where to buy some in Estonia. Any help is appreciated",["Date","2022-03-12T17:12:00.000Z"],{"text":308,"timestamp":309,"topicId":5,"sentiment":20,"topicConfidence":7,"sentimentConfidence":8},"Does anyone know Ukrainian refugees with expertise in creating clothing, or embroidery machines? I would like to propose a job offer (see attached post.) Please pass this on to anyone who might know!Hello! I have a business\u002Femployment proposal that I hope can help a couple of Ukrainian people for employment and (I hope) longer-term security, as follows: I'd like to start a business making Ukrainian embroidered shirts (вишиванки, vyshyvanky) for men and women. I think lots of people in Estonia would like to wear Ukrainian symbols right now, and it's also very hard to find good quality embroidered shirts outside Ukraine -- I know because I love the style and have tried to buy them for years! I want to make a \"cooperative\" style business: See Wikipedia, but it's one where employees have the right to vote on the board and the use of profits. It's a kind of \"business by democracy\" because… More",["Date","2022-03-12T13:23:17.000Z"],{"text":311,"timestamp":312,"topicId":5,"sentiment":6,"topicConfidence":313,"sentimentConfidence":314},"Anyone looking for a front end developer spread the word please. ❤️Looking for help in the IT community. My name is Vyacheslav Shevchenko, I am Ukrainian. I am 39 years old, 36 of which I am confined to a wheelchair and cannot move without it. I am a front-end developer with over 10 years of experience. Due to the military aggression of the Russian Federation, me and my wife were forced to leave our home in the village of Antonovka, Kherson. For four days we lived under artillery and hail fire. After the announcement of the evacuation, we were able to go to Lvov bypassing the main roads where the fighting was going on. We left everything that wehave, taking only a dog, a cat and a computer. There was enough money for travel and food, now there is… More",["Date","2022-03-11T20:55:03.000Z"],0.97,0.54,{"text":316,"timestamp":317,"topicId":5,"sentiment":6,"topicConfidence":68,"sentimentConfidence":132},"Hey gang. Posting via third party. It doesn’t matter what side you’re on. We all collectively agree that civvies don’t belong in a conflict. If anyone can help, please reach out. “Прошу прощения, если не по теме. Женщина с двумя детьми школьного возраста, престарелая мама инвалид-колясочник и шесть собак чихуахуа . Уехали из-под бомбежек в г. Сумы, едут в Эстонию. Жить негде. Нужно жилье на месяц-два, пригодное для проживания инвалида. Волонтеры обеспечивают дорогу, готовы оплачивать коммунальные платежи. Если кто-то готов помочь, заранее огромное спасибо. В скрине про 10 собак, но сейчас их 6. Просьба писать мне или Tatiana Zubova.”",["Date","2022-03-11T17:22:05.000Z"],{"text":319,"timestamp":320,"topicId":5,"sentiment":20,"topicConfidence":157,"sentimentConfidence":321},"Hello expat community!  We are organizing the second \"Art Against War\" auction. Estonian artists are coming together to support people in Ukraine and donating their art to fundraise money to support Ukraine!  Last time we had more than 70 art donations and we raised 57,605€. 100% was donated to support refugees organizations in Estonia.  This time we want to support and protect Ukrainian men and women fighting for our families and for our freedom. All the money raised will go towards buying equipment like vests, helmets, etc. This time it will be only up to 30 art objects and mostly done by young Estonian artists.  Link to the event - https:\u002F\u002Ffb.me\u002Fe\u002F38GUt1T0Y",["Date","2022-03-10T18:23:00.000Z"],0.73,{"text":323,"timestamp":324,"topicId":5,"sentiment":20,"topicConfidence":7,"sentimentConfidence":40},"Let me know if you are a Refugee  starting the life here. I am leaving  Estonia soon and I will have some great stuff for donating.",["Date","2022-03-10T11:52:40.000Z"],{"text":326,"timestamp":327,"topicId":5,"sentiment":6,"topicConfidence":137,"sentimentConfidence":297},"From Thursday (March 10), Tallinn will open collection drop-in centers at district administration offices for donations for newly arrived displaced people.",["Date","2022-03-09T21:02:39.000Z"],{"text":329,"timestamp":330,"topicId":5,"sentiment":50,"topicConfidence":284,"sentimentConfidence":30},"In March 1944 Tallinn survived massive bombing by the Soviet Air Force. 554 lives were lost, over 1500 buildings destroyed, many other houses badly damaged. Old Town was also hit hard. Particularly Harju street. And all this sounds dreadfully familiar today… To honour the victims back in 1944 and in todays war in Ukraine, candles were lit on Harju street.",["Date","2022-03-09T20:48:57.000Z"],{"text":332,"timestamp":333,"topicId":5,"sentiment":6,"topicConfidence":7,"sentimentConfidence":185},"Hi all! This Saturday we are going to Ukrainian border in Poland to bring down some supplies and pick up a couple of people who need help on the way back. If you have heard of any organisations that would like to have their donations delivered down there or if you would like to contribute yourself, or if you have more information on how our trip to the border could bring the most benefit please just let me know.",["Date","2022-03-09T18:39:05.000Z"],{"text":335,"timestamp":336,"topicId":5,"sentiment":50,"topicConfidence":337,"sentimentConfidence":12},"Hi! Are there any refugees here from Russia? I read trains and\u002For buses are fully booked from St. Petersburg to Tallinn, Riga and Helsinki to flee Putin's Russia in fear of what's coming there by its leadership. Please read before you post! Edit: As I see some people posting hostile messages here based on nationality, it's better to emphasize some points. Respect people regardless of their nationality, ethnicity, and their sexual and cultural background.  As some pointed out below, pro-feminist, LGBTIQ+, anti-war and pro-democracy protests are technically not tolerated by the authorities in Russia. Nevertheless many local people are still trying, tens of thousands according to reports. A part of these people might be among those fleeing Russia now.  This is what the question was about. Respect the rules of the group, respect other people.",["Date","2022-03-09T15:56:30.000Z"],0.79,{"text":339,"timestamp":340,"topicId":5,"sentiment":20,"topicConfidence":341,"sentimentConfidence":75},"Heayahei! This Friday there will be a party celebrating German, Ukrainian, Jamaican and English culture! Everyone is invited!🥳🤩🥳 PS! If you happen to have any of these countries flags with you you will get a free pass :D https:\u002F\u002Fwww.facebook.com\u002Fevents\u002F2147613025402896?acontext=%7B%22event_action_history%22%3A[%7B%22surface%22%3A%22page%22%7D]%7D",["Date","2022-03-09T12:28:35.000Z"],0.52,{"text":343,"timestamp":344,"topicId":5,"sentiment":6,"topicConfidence":7,"sentimentConfidence":89},"Feel free to join to this event which allows ukrainiens and other people who fear about the ukrainian war to speak up!",["Date","2022-03-08T17:37:42.000Z"],{"text":346,"timestamp":347,"topicId":5,"sentiment":50,"topicConfidence":7,"sentimentConfidence":341},"Courageous Russian POW explains how he ended up in Ukraine and wonders if redemption is possible for their crimes...",["Date","2022-03-07T17:59:30.000Z"],{"text":349,"timestamp":350,"topicId":5,"sentiment":6,"topicConfidence":7,"sentimentConfidence":68},"Hi, my wife`s stepsister (Ukrainian citizien) and her boyfriend are looking for a flat in Tallinn as they can`t come back to Ukraine, they work remotley and when the war started they were not in Ukraine, now they are stuck in Poland but would like to come over here (to stay close to my wife) and rent out some 1 room appartment, till the situation will not be solved or they figure it out what to do... any one can give some support?",["Date","2022-03-07T15:41:02.000Z"],{"text":352,"timestamp":353,"topicId":5,"sentiment":20,"topicConfidence":7,"sentimentConfidence":195},"We're offering a free evening for Ukrainian refugees and volunteers tomorrow night. Snacks, drinks, and a homemade meal will be available. We ask for no payment. Our hope is to at least give people the chance to be together. This will be an ongoing event until peace and freedom is restored in Ukraine. Slava Ukraini.",["Date","2022-03-07T12:33:44.000Z"],{"text":355,"timestamp":356,"topicId":5,"sentiment":6,"topicConfidence":7,"sentimentConfidence":357},"Today, 7th of March, at 17.30 near the embassy of USA will be a public meeting with a goal to ask for help in closing Ukrainian sky. Together we can stop killing innocent civilian people!",["Date","2022-03-07T11:03:13.000Z"],0.57,{"text":359,"timestamp":360,"topicId":5,"sentiment":6,"topicConfidence":7,"sentimentConfidence":157},"Updates about the war between Russia and Ukraine, curated and regularly updated by LinkedIn News editors.",["Date","2022-03-07T09:15:44.000Z"],{"text":362,"timestamp":363,"topicId":5,"sentiment":6,"topicConfidence":364,"sentimentConfidence":8},"I know its just in estonian and russian, but it might be still helpful. There are some notes for how to help the war refugees from Ukraine. Maybe somebody will find something useful from this post.Uuendatud 29.märtsil \u002F\u002F Oбновлено 29 марта Praktilised näpunäited Eestisse saabunud ukrainlaste aitamiseks  \u002F\u002F Практические советы в помощь приехавшим в Эстонию украинцам (версия на русском языке внизу) neile, kes mõne Ukraina pere käendusele võtavad. Jooksvalt uuendamisel vastavalt kommentaaride laekumisele ning uue info avaldamisele. Täiendage, parandage ja jagage. 1. Majutus ja söök, enesestmõistetav, erinevad lahendused peaks olema kõigile teada. Kui sugulased ja tuttavad aidata ei saa, siis teeb seda Sõjapõgenike vastuvõtukeskus Tallinnas, Tartus, Rakveres ja varsti ka Pärnus.  2. Sõjapõgenik peaks teadma oma aadressi Eestis. Seda on osade järgmiste sammude juures vaja.  3. Samuti… More",["Date","2022-03-07T00:19:38.000Z"],0.47,{"text":366,"timestamp":367,"topicId":5,"sentiment":6,"topicConfidence":7,"sentimentConfidence":215},"I know a family from Ukraine and they’re looking towards moving from Poland to Estonia, here’s their question. If you have any tangible information, please comment or DM me.  What I need to know 1. What government provides at the moment( accomodation yes\u002Fno) 2. Which kind of job I can get without language and do they help or its on my own  3. Kindergardens. If there is no free, how much is private one Thank you!",["Date","2022-03-06T20:57:04.000Z"],{"text":369,"timestamp":370,"topicId":5,"sentiment":20,"topicConfidence":133,"sentimentConfidence":63},"NB!  Thank you for your help! We have more then enough volunteers right now 09.03.  🙏❤️ Hello! We are looking for volunteers to babysit Ukraine kids in playroom in Dzingel hotel.  Russian or Ukraine language is needed.  If you feel you can help then write or call  Olga Murzajeva tel nr 55640584 info@deti.ee   Всем привет! В сотрудничестве с Министерством социальных дел Эстонии набираем волонтёров, которые готовы присмотреть за детьми из Украины.  3 часа в день, по рабочим дням с 9- 12 \u002F 14 - 17. Место: Dzingel hotel Возможно будут и другие места. Наличие COVID сертификата обязательно  Желательно наличие соответствующего образования или опыт работы с детьми.  Информация по телефону 55640584 или email info@deti.ee Ольга Мурзаева",["Date","2022-03-06T14:58:20.000Z"],{"text":372,"timestamp":373,"topicId":5,"sentiment":6,"topicConfidence":85,"sentimentConfidence":85},"🇪🇪🇺🇦 The Estonian Institute of Historical Memory and the Estonian Heritage Society invites everyone to commemorate the innocent victims of the 1944 March bombings of Tallinn and the war that has begun in Ukraine. The commemoration event takes place on 9 March at 19:15 in Harju Street and the surrounding green area in Tallinn. We kindly ask everyone to bring along candles and igniters, as the number of candles and igniters provided by the organizers is limited. A light and sound installation will be set up in Harju Street as a reminder of the horrors of the March bombings. Please share! Event, in English too: https:\u002F\u002Fwww.facebook.com\u002Fevents\u002F309434294513051",["Date","2022-03-06T12:24:12.000Z"],{"text":375,"timestamp":376,"topicId":5,"sentiment":6,"topicConfidence":7,"sentimentConfidence":137},"Just putin this out there...",["Date","2022-03-06T10:56:03.000Z"],{"text":378,"timestamp":379,"topicId":5,"sentiment":6,"topicConfidence":7,"sentimentConfidence":102},"Hello to everyone. Could you help me spread the message. Im trying to get ride sharing platforms to offer free rides from the border points to destinations. Also try to do it in a more safe way that it is done today. Thank you!!!Plead for ride sharing platforms in Europe! Open your platforms for Ukrainians fleeing from borders, give an option to use your platform without credit cards and for free. Same for drivers.  Offer this option only for refugees from Ukraine.  There are thousands of EU cars lined up to take people where they wish, and on the other side there are tens of thousands of Ukrainians who wish to get to different destinations. Problem nr one- this matching is done like it was done in 19th centry- standing with a poster next to the refugee center. The volunteers are writing down the transport needs one by one and doing the matching manually. It is very very slow. Promoting your services at the refugee… More",["Date","2022-03-06T08:21:18.000Z"],{"text":381,"timestamp":382,"topicId":5,"sentiment":20,"topicConfidence":7,"sentimentConfidence":205},"🇬🇧 Art is my weapon  I'm Ukrainian, and I figured out how to use it in the battle for Ukraine. I will make you a tattoo and donate all money to the Ukrainian Army. Since all the money goes to charity, you can pay any amount you wish, but the minimum reasonable price is €50.  You can buy a voucher to help Ukraine now, and we can schedule a session later.  Just donate for the Ukrainian army or humanitarian aid through the official web page, send me the conformation and we'll make an appointment  https:\u002F\u002Fbank.gov.ua\u002Fen\u002Fnews\u002Fall\u002Fnatsionalniy-bank-vidkriv-spetsrahunok-dlya-zboru-koshtiv-na-potrebi-armiyi  #standwithukraine Today we raised more than 1200€ together And we can do more! Write me in… More",["Date","2022-03-05T23:45:28.000Z"],{"text":384,"timestamp":385,"topicId":5,"sentiment":6,"topicConfidence":7,"sentimentConfidence":51},"Ukraine Will Ultimately Win The Irregular War With Russia. Wars are no longer conventionally fought and won with an army of tanks, planes and infantry fighting battles.",["Date","2022-03-05T21:44:57.000Z"],{"text":387,"timestamp":388,"topicId":5,"sentiment":6,"topicConfidence":321,"sentimentConfidence":26},"I think many of you know Katia Mykulyk. Now she organizes assistance to Ukrainians who come to Estonia and help the army. If you wish to help financially, you can transfer money to this account.",["Date","2022-03-05T17:22:40.000Z"],{"text":390,"timestamp":391,"topicId":5,"sentiment":6,"topicConfidence":172,"sentimentConfidence":161},"To get around the BBC ban in Russia: Download the Psiphon app from the AppStore or Google Play Store look for the dedicated BBC site on the Tor Browser which can be found using this URL. http:\u002F\u002F www . bbcnewsd73hkzno2ini43t4gblxvycyac5aw4gnv7t2rccijh7745uqd.onion\u002F  Note that this URL only works using the Tor Browser or the Onion Browser (on iPhones) if access to the apps is restricted then send a blank email to get@psiphon3.com or gettor@torproject.org. An email will be sent in response with a direct and safe download link The BBC has also launched two new shortwave frequencies broadcasting World Service English news for four hours a day to Ukraine and parts of Russia: 15735 kHz from 14:00 GMT to 16:00 GMT 5875 kHz from 20:00 GMT to 22:00 GMT",["Date","2022-03-05T14:05:36.000Z"],{"text":393,"timestamp":394,"topicId":5,"sentiment":50,"topicConfidence":7,"sentimentConfidence":284},"🇺🇦 Does anyone here know anyone in Kherson, Ukraine who can assist me on the ground? I have 40 African students in need of basic supplies (food, water) and we cannot reach them from outside. Any information on people on the ground who can assist them, or shelters they could try to get to within Kherson?? I cannot find info on humanitatian corridors out of Kherson yet. They are only talking about Mariupol and one other place. 🇺🇦",["Date","2022-03-05T11:18:58.000Z"],{"text":396,"timestamp":397,"topicId":5,"sentiment":20,"topicConfidence":364,"sentimentConfidence":16},"Feeling affected by the war? Want to listen and show empathy to others? We are opening up a safe space for everyone who wants to share their experience. This is NOT a debate: it's an opportunity to open up in a judgment-free zone, in a pretty cool bar in old town. No verbal confrontation will be allowed. The event is hosted JEF Estonia, the Estonian chapter of Young European Federalists (JEF), an international NGO for everyone who wants to reform Europe, and fight for human rights. Entrance is free. Thursday 10 March, 7.30PM at Ükskõik bar (old town). https:\u002F\u002Ffb.me\u002Fe\u002F2m2BUpUaB Admins I hope this won't be considered spam: we are not charging or making any money out of this. We are trying to provide a space for EVERYONE, regardless of nationality, to feel connected to each other.",["Date","2022-03-04T21:00:29.000Z"],{"text":399,"timestamp":400,"topicId":5,"sentiment":50,"topicConfidence":7,"sentimentConfidence":297},"Hey everyone. Here is what Russian media is posting while Putin's troops are attacking Zaporozhia nuclear power plant: PENGUINS. We are living in an unbelievably bizarre time, and I have a feeling it's going to get worse.",["Date","2022-03-04T11:46:47.000Z"],{"text":402,"timestamp":403,"topicId":5,"sentiment":20,"topicConfidence":75,"sentimentConfidence":161},"Solidarity paella  We live in difficult and sad times, that's why #Hispatime and El Centro Picasso want to contribute and help all the people who have had to leave their homes in the conflict that is ravaging Ukraine.  We are going to offer one of the most popular dishes of Spanish gastronomy, AN AUTHENTIC SEAFOOD PAELLA, of course accompanied by some of the best white and red wines in Spain. #Jorge Arena will performance Spanish Flamenco Guitar and #iberictapas  will support the event with Spanish cheese for a raffle All the money raised will be donated to the Estonian Red Cross, for the support of refugees from Ukraine. https:\u002F\u002Fredcross.ee\u002Fanneta\u002Fukraina\u002F?fbclid=IwAR2RmEnrHiE2uDzatLe7GvdlbPQjNSemow8RCzAF7W64rpABrJJBnp0kZSc Price of paella and a wine, coffee or tea: €15  It's time to help, we are waiting for you.",["Date","2022-03-04T08:32:38.000Z"],{"text":405,"timestamp":406,"topicId":5,"sentiment":50,"topicConfidence":128,"sentimentConfidence":234},"Something on a lighter note, Since the misery of this atrocious war has jolted many souls.",["Date","2022-03-04T07:57:19.000Z"],{"text":408,"timestamp":409,"topicId":5,"sentiment":20,"topicConfidence":7,"sentimentConfidence":109},"Dear all, today I had an epiphany about being more involved into helping the Ukrainian struggle and I felt I want to do more then just sporting an Ukrainian flag or chatting about it with my friends from my comfy sofa. So I tried to find some useful infos on how to help but here on this group or elsewhere the amount of associations or private initiatives are simply too much. So I will repost here what Helene Vetik posted yesterday, to guide you through the jungle of Facebook posts, Instagram stories and shouting men in Baltijaam. And choose the right thing to do. Stàa alegher!\u002Ftake care",["Date","2022-03-03T16:23:01.000Z"],{"text":411,"timestamp":412,"topicId":5,"sentiment":6,"topicConfidence":7,"sentimentConfidence":314},"As watching today the press conference the important thing that stood out is that we need to stand together and protect our people, our country.  The ministers talked that we shouldn't hurt residents in our country who have emigrated from other countries, especially russians, and of course other foreign nationals. We are an understanding, caring nation and country. Let's hold our people and care for them more and more everyday. We know that the war isn't against russians but the president of Russia. Also, our own people should think if it's reasonable to go to another country's territory and start fighting because we don't want the same thing happening in our own territory, especially when Estonia will be represented out in the open amongst ourselves. Estonian government won't be able to help you when you get hurt or even if you'll get taken as prisoners there. We can help the refugees here - making donations, providing accommodations etc. Slava Ukraini! 💙💛",["Date","2022-03-03T14:44:42.000Z"],{"text":414,"timestamp":415,"topicId":5,"sentiment":20,"topicConfidence":102,"sentimentConfidence":314},"Hello! Here was a post with flowers for Ukraine. I can’t find it and helps",["Date","2022-03-03T12:52:29.000Z"],{"text":417,"timestamp":418,"topicId":5,"sentiment":6,"topicConfidence":7,"sentimentConfidence":185},"For companies and private persons who like to contribute financially to ukraine and its people can have a look at EMTA website. Also, before starting to collecting different stuff and driving to Poland or Ukraine or donating. Check whats acually needed. From Poland come reports that so many like to volunteer that its an obsticle. From Ukraine it come info that they have an overload of some stuff.",["Date","2022-03-03T07:40:15.000Z"],{"text":420,"timestamp":421,"topicId":5,"sentiment":20,"topicConfidence":297,"sentimentConfidence":161},"Hispatime and Centro Picasso Tallinn are organizing a seafood paella and Spanish wines event 🇺🇦❤️🇪🇦 All the money raised during the event will be donated to the Estonian Red Cross to support Ukrainian war refugees 🕊️💙💛",["Date","2022-03-03T05:53:05.000Z"],{"text":423,"timestamp":424,"topicId":5,"sentiment":6,"topicConfidence":7,"sentimentConfidence":364},"Some of you maybe heard that in China many are supporting Russia, this is due to the fake news spreading by the Chinese media. As we are here seeing what is really happening in Ukraine which is terrifying and unacceptable! I will stand up and let the Ukrainians and the world know there are Many Chinese people with good heart and stand firmly with the justice!  Me and some of my Chinese friends will gather up this Saturday afternoon in front of the Ukraine embassy to send our prayers to the Ukrainian people who is frightening for their country! Please forward this information to any Chinese people who would like to join us, thank you!",["Date","2022-03-02T21:23:40.000Z"],{"text":426,"timestamp":427,"topicId":5,"sentiment":6,"topicConfidence":185,"sentimentConfidence":68},"Hello everyone. The BBC just published a video of a group of African students stuck in Kherson city. They are all very young; they are lost and despaired as they are running out of basic necessities like water. Please let me know if there is someone we can contact there. I know things are hard for everyone. But I am just knocking at all the doors possible. I don't know what else to do. Update: 03\u002F03- 00h56. I managed to get a hold of them. Someone from this group helped look for Africans in Kherson and we were able to identify an individual through Facebook who accidentally happens to be one of the men on the video. I was able to video chat with them! They are still in Kherson, doing well. There are about 20 of them. They said that they have food. But the supplies will start running low from Friday. I also have a direct access to them now through two WhatsApp numbers. I will keep you posted.",["Date","2022-03-02T18:33:26.000Z"],{"text":429,"timestamp":430,"topicId":5,"sentiment":6,"topicConfidence":313,"sentimentConfidence":124},"This organization is looking for transport in Ukraine and to\u002Ffrom UkraineПотрібні грузоперевізники. Будь ласка у приватні повідомлення.  We need cargo carriers.  Please in private messages.",["Date","2022-03-02T18:10:47.000Z"],{"text":432,"timestamp":433,"topicId":5,"sentiment":6,"topicConfidence":321,"sentimentConfidence":137},"Tallinn has opened a 24\u002F7 reception centre for Ukrainian refugees. It is a joint effort by the Police and Border Guard Board, the Estonian Refugee Council, the City of Tallinn and the Social Insurance Board.",["Date","2022-03-02T16:49:25.000Z"],{"text":435,"timestamp":436,"topicId":5,"sentiment":6,"topicConfidence":7,"sentimentConfidence":205},"Hey all. If anyone has anything that they'd like to donate to Ukrainian refugees, please let me know. I'll be joining with a couple others next week as we take supplies down and bring refugees back. Any questions, please do not hesitate to call\u002Fwrite via messenger. We (my wife) can communicate via English, Estonian or Russian",["Date","2022-03-02T13:16:49.000Z"],{"text":438,"timestamp":439,"topicId":5,"sentiment":6,"topicConfidence":7,"sentimentConfidence":185},"Hello! Does anyone know any organizations that pick up minors at the Ukrainian borders (specifically Ukraine-Moldova)?",["Date","2022-03-02T09:59:06.000Z"],{"text":441,"timestamp":442,"topicId":5,"sentiment":50,"topicConfidence":7,"sentimentConfidence":241},"My heart is broken by being an European and see the ONU and NATO doing nothing. If you support the establishment of a no-fly zone over Ukraine, please sign the petition here!! NATO NEEDS to do something!!! Let's help Ukraine, Together we are STRONGER ❤️❤️ https:\u002F\u002Fwww.openpetition.eu\u002Fpetition\u002Fonline\u002Fpeople-around-the-world-ask-nato-to-close-the-airspace-over-ukraine?fbclid=IwAR2YgdStl_FF3ciQUtqXWItwfMirwk_SHN9OwAApRbE9WvrmdVBYg0F7cX0",["Date","2022-03-02T07:58:58.000Z"],{"text":444,"timestamp":445,"topicId":5,"sentiment":6,"topicConfidence":40,"sentimentConfidence":22},"Hello, everybody who is familiar with Telegram messaging app. Here is a link to ukraineNOW telegram group, and a post leading to different languages. https:\u002F\u002Ft.me\u002Fukrainenowenglish\u002F287",["Date","2022-03-01T22:16:26.000Z"],{"text":447,"timestamp":448,"topicId":5,"sentiment":6,"topicConfidence":7,"sentimentConfidence":16},"There is any support from government in hiring Ukrainian? I mean maybe some easier steps to support. I have different friends escaped the war and now they don’t know what to do and we were discussing maybe some opportunities may arise here.",["Date","2022-03-01T17:35:19.000Z"],{"text":450,"timestamp":451,"topicId":5,"sentiment":6,"topicConfidence":7,"sentimentConfidence":215},"Any contact of organization ready to support Ukrainian?  I have some friends still there asking support for medicine and military first aid kit",["Date","2022-03-01T11:18:35.000Z"],{"text":453,"timestamp":454,"topicId":5,"sentiment":6,"topicConfidence":7,"sentimentConfidence":89},"Hello. 🇺🇦 May be someone know any organisation who helping refugees to leave Eastern Ukraine (Kharkov, Melitopol, Zaporozye)? Its really hard situation in Eastern Ukraine and i really hope may be someone can help 🙏🏻 UPT: Need Information about evacuation in Zaporozye🙏🏻🇺🇦",["Date","2022-03-01T09:43:59.000Z"],{"text":456,"timestamp":457,"topicId":5,"sentiment":6,"topicConfidence":7,"sentimentConfidence":341},"🇬🇧 Art is my weapon Today I figured out how to use it in the battle for Ukraine. I will make you a tattoo and donate all money to the Ukrainian Army. Since all the money goes to charity, you can pay any amount you wish, but the minimum reasonable price is €50. One important note is if I'm physically not capable of handling your request right away, you can still buy a voucher to help Ukraine now, and we can schedule a session later. If you're not in Estonia, we can meet in Europe when the war ends. If it's easier for you to transfer the money, send it directly to the Ukrainian bank and send me the confirmation. Then we'll make you a great tattoo for you to be proud of. The plan is the… More",["Date","2022-02-28T15:47:55.000Z"],{"text":459,"timestamp":460,"topicId":5,"sentiment":50,"topicConfidence":7,"sentimentConfidence":147},"Please is there anyone at the Medyka border post in Ukraine who can share food with a Zimvabwean guy who hasn't eaten in two days? He is waiting in the queue to cross the border and it's taking forever and someone stole his money. He's struggling. Anyone there on the ground or near there?",["Date","2022-02-28T15:00:43.000Z"],{"text":462,"timestamp":463,"topicId":5,"sentiment":20,"topicConfidence":85,"sentimentConfidence":102},"Hey! I saw a post somewhere about volunteers psychologists in Estonia who can help to refugees. Does anyone have this information? Can’t find it in Google Update: found, thanks for help https:\u002F\u002Finstagram.com\u002Fpsiheya.help?utm_medium=copy_link",["Date","2022-02-28T13:19:07.000Z"],{"text":465,"timestamp":466,"topicId":5,"sentiment":50,"topicConfidence":7,"sentimentConfidence":16},"things are getting quite scary for my cousin and i was wondering if anyone's seen any info on getting out of some outskirts of kyiv? are any of the roads safe?",["Date","2022-02-28T10:38:57.000Z"],{"text":468,"timestamp":469,"topicId":5,"sentiment":6,"topicConfidence":7,"sentimentConfidence":185},"Hello Dear All. Not sure if it's been widely announced yet but I just got a confirmation from the Border authorities about letting Ukrainians in without so called \"travel passports\".",["Date","2022-02-28T10:35:19.000Z"],{"text":471,"timestamp":472,"topicId":5,"sentiment":20,"topicConfidence":7,"sentimentConfidence":89},"Hello caring and compassionate peoples!! If you are looking for ways to help with refugee relief, Toidupank is accepting and seeing donations.  They're working directly with those who are coordinating busses and shelter of refugees who have been chased from their homes by war and violence.",["Date","2022-02-28T10:00:22.000Z"],{"text":474,"timestamp":475,"topicId":5,"sentiment":50,"topicConfidence":7,"sentimentConfidence":147},"🇺🇦🇺🇦 some thoughts on our collective response to the war in ukraine. it feels like the whole world has gone mad. it probably only feels like that because my world has become ukraine ever since the war started. my family and friends are currently there just trying to survive and i see a mob mentality forming around me. my biggest worry is that out of a pure place of \"helping ukraine\" many people could do a lot of unintended harm. i see fear rising everywhere and hatred following. i see people celebrating death and calling for more. i see fighting among friends and families about who to blame and how to punish them. but the only thought i'm left with is \"can't we punish putin tomorrow? could… More",["Date","2022-02-28T07:03:52.000Z"],{"text":477,"timestamp":478,"topicId":5,"sentiment":6,"topicConfidence":7,"sentimentConfidence":162},"Regarding the situation in Ukraine: I'm well aware that there are many people in the country right now who do not hold EU, Ukrainian or perhaps no passport at all. They have a right to leave a war zone just like everybody else. There are now two major groups for helping out refugees and I have spotted some useful information here. I'll post screenshots of groups here, pls feel free to join in and spread the word! Slava Ukraini!",["Date","2022-02-27T21:48:36.000Z"],{"text":480,"timestamp":481,"topicId":5,"sentiment":6,"topicConfidence":7,"sentimentConfidence":132},"Please. Do we have anyone on the ground in Ukraine who can help stranded students who have run out of money and food? I need someone on the ground to liase with. If you know anyone please contact me.",["Date","2022-02-27T21:40:33.000Z"],{"text":483,"timestamp":484,"topicId":5,"sentiment":6,"topicConfidence":7,"sentimentConfidence":314},"🇺🇦Some more info for travel, please share and pass along: trains from Poland (Euro city trains departing from Warsaw, Gdańsk, Przemysl, Krakow) to Germany (destination is Berlin via Vienna) are free of charge for Anyone with Ukrainian passport (I’ll try to find out and confirm if this is also valid for other passport holders escaping Ukraine). DB are also planning to provide additional trains specifically for refugees.",["Date","2022-02-27T20:26:10.000Z"],{"text":486,"timestamp":487,"topicId":5,"sentiment":20,"topicConfidence":7,"sentimentConfidence":12},"Hope this can be useful for some:  For those who need accommodations for family and friends anywhere in Europe, on this page of a (holiday) house swap community are a few accommodations across different countries in Europe available for Ukraine refugees. Filter: more filters (at the bottom at the page below visible filters) \u002F travel type \u002F Ukraine support available",["Date","2022-02-27T18:13:34.000Z"],{"text":489,"timestamp":490,"topicId":5,"sentiment":20,"topicConfidence":7,"sentimentConfidence":12},"Please share this useful information for accommodation, transport and food assistance with anyone trying to leave or who has managed to get out of Ukraine:  ◾Please see this group in Poland for help with accommodation and food for those who have managed to cross into Poland https:\u002F\u002Fwww.facebook.com\u002Fgroups\u002F683793819641997\u002F?ref=share ◾This might be useful to contact them as well for help leaving Ukraine https:\u002F\u002Fborderlands.com.ua\u002F ◾If you manage to get into Romania, please use this group to find help: https:\u002F\u002Fwww.facebook.com\u002Fgroups\u002F1140184136738726\u002F?ref=share ◾Ladies, please use Host A Sister to find help once you get out of Ukraine. You might be able to find a place to stay and food from… More",["Date","2022-02-27T18:02:32.000Z"],{"text":492,"timestamp":493,"topicId":5,"sentiment":20,"topicConfidence":7,"sentimentConfidence":80},"Hello! As everybody knows, the situation in Ukraine is critical. To help Ukraine broadcast its history, I am looking for a place where it is possible to show a documentary. Thank you for your help!",["Date","2022-02-27T17:55:54.000Z"],{"text":495,"timestamp":496,"topicId":5,"sentiment":6,"topicConfidence":7,"sentimentConfidence":35},"We secured a house (4 beds) near the Ukrainian border in Poland for our Ukrainian colleague and her family for a month. We organized transport for them on both sides of the border.  Last minute my colleague and her family decided to stay in Ukraine. That means we now have an unused free housing (non refundable) ready to host a family for a month. If we cancel it I believe the house will not be given to a Ukrainian family or it might be resold at a price out of reach for many (we paid 4K eur). It is 50km from the border in Zwierzyniec, Poland. Please DM me if you know any Ukrainians who can use this free housing or know of an organization that can connect us to Ukrainians who need housing.",["Date","2022-02-27T17:12:31.000Z"],{"text":498,"timestamp":499,"topicId":5,"sentiment":20,"topicConfidence":7,"sentimentConfidence":124},"Admin can delete this if it's not allowed. Hello everyone, I would like to share something with you guys. My husband and I are have been following the news on what's happening in Ukraine,  and we are so desparate wanting to help. This morning my husband purposed to build a website and we brainstormed all the ideas we have, and we came out with this website https:\u002F\u002Fwith-humanity.vercel.app\u002F So, this website is for anyone who need evacuations and to those who provide shelter. You can check out the link I've attached and simply click \"send request\" in the top right corner on the website, from there you will just follow the flow and fill what's your need. We truly hope our website can be helpful. Thank you everyone!",["Date","2022-02-27T16:37:27.000Z"],{"text":501,"timestamp":502,"topicId":5,"sentiment":6,"topicConfidence":7,"sentimentConfidence":337},"The return of Cuba missile crisis",["Date","2022-02-27T14:43:15.000Z"],{"text":504,"timestamp":505,"topicId":5,"sentiment":20,"topicConfidence":195,"sentimentConfidence":147},"Please support my Motherland, support Ukrainian army🇺🇦 Ukrainians are grateful for you help 🌍 #standwithUkraine",["Date","2022-02-27T14:24:31.000Z"],{"text":507,"timestamp":508,"topicId":5,"sentiment":6,"topicConfidence":7,"sentimentConfidence":30},"If you are an African student trying to leave Ukraine to Poland please look for assistance from the contact below. You must be allowed safe passage across the border to Poland.",["Date","2022-02-27T10:26:13.000Z"],{"text":510,"timestamp":511,"topicId":5,"sentiment":6,"topicConfidence":7,"sentimentConfidence":22},"❗️❗️❗️Просимо максимального поширення!  🙏 Вся правда про ситуацію в Україні! 🇺🇦 🙏 The whole truth about the situation in Ukraine! 🇺🇦 #StopRussianAggression #StopRussia #ЗупинимоОкупантів❗ ❗ ❗ Please maximum sharing! 🙏 The whole truth about the situation in Ukraine! 🇺🇦 🙏 The whole truth about the situation in Ukraine! 🇺🇦 #StopRussianAggression #StopRussia #ЗупинимоОкупантів",["Date","2022-02-27T10:07:35.000Z"],{"text":513,"timestamp":514,"topicId":5,"sentiment":6,"topicConfidence":515,"sentimentConfidence":31},"Living on the border, in Narva, worries about what's next crosses many of our minds too. In these difficult times it's important to stay united and show support for those who need it most right now. We must not allow international terrorism divide us. Warm must not succeed.",["Date","2022-02-27T09:25:09.000Z"],0.93,{"text":517,"timestamp":518,"topicId":5,"sentiment":20,"topicConfidence":55,"sentimentConfidence":147},"Friends, we work together with Estonian Refugees Council. This is a governmental body. You can donate there. Thank you!🇺🇦🙏🕊",["Date","2022-02-27T08:32:48.000Z"],{"text":520,"timestamp":521,"topicId":5,"sentiment":6,"topicConfidence":7,"sentimentConfidence":157},"Ways to donate to the Ukrainian Armed Forces (multiple currencies and banks accepted):",["Date","2022-02-27T06:47:25.000Z"],{"text":523,"timestamp":524,"topicId":5,"sentiment":20,"topicConfidence":12,"sentimentConfidence":284},"Dear all! I need a Ukrainian flag, rather urgently please. Can anyone help? I'll be happy to purchase it.",["Date","2022-02-26T19:06:53.000Z"],{"text":526,"timestamp":527,"topicId":5,"sentiment":20,"topicConfidence":7,"sentimentConfidence":215},"Слава Україні!Glory to Ukraine!",["Date","2022-02-26T14:25:50.000Z"],{"text":529,"timestamp":530,"topicId":5,"sentiment":50,"topicConfidence":7,"sentimentConfidence":26},"Ukraine asked more than a week to disconnect RF from SWIFT. This would stop RF to export gas and put economic pressure. As of now European countries divided to this small favour. Let's face the truth as in 1938 as Europe abandoned Cheslovakia now they abandoned Ukraine.",["Date","2022-02-26T14:10:08.000Z"],{"text":532,"timestamp":533,"topicId":5,"sentiment":20,"topicConfidence":21,"sentimentConfidence":16},"Some support coming in from UK. #PeaceToUkraine",["Date","2022-02-26T13:41:36.000Z"],{"text":535,"timestamp":536,"topicId":5,"sentiment":20,"topicConfidence":7,"sentimentConfidence":55},"On behalf of all the people of Ukraine - we are grateful for your help, Estonian brothers!  Thank you for being with us!  Peace to all!",["Date","2022-02-26T13:19:47.000Z"],{"text":538,"timestamp":539,"topicId":5,"sentiment":50,"topicConfidence":7,"sentimentConfidence":137},"This lady is one of many Russians speaking against Putin’s aggression.  Russian are protesting in Russia risking their lives and freedom. Because they consider Ukrainians their brothers.  I have seen many ppl here spreading hate against Russians. You may have some personal problems with Russian.  But this war is Putin vs Ukraine 🇺🇦   Not Russians vs Ukrainians. #SayNoToHate",["Date","2022-02-26T12:56:51.000Z"],{"text":541,"timestamp":542,"topicId":5,"sentiment":6,"topicConfidence":7,"sentimentConfidence":16},"Pass on - a house for Ukrainian refugees in BulgariaIn these grim times of human tragedy and hardship for Ukrainian people, I would like to offer this house as a shelter for two Ukrainian families fleeing from war. The house is located at some 50 kilometers from Sofia, has food supplies and is fully equipped for normal living.  #Ukraine, you are not alone! В тези мрачни времена на човешка трагедия и трудности за украинския народ, бих искал предоставя тази къща за подслон на две украински семейства, бягащи от войната. Къщата се намира на около 50 км от София, напълно оборудвана е за нормален живот и има хранителни провизии. #Украйна, ние сме с теб!",["Date","2022-02-26T12:20:06.000Z"],{"text":544,"timestamp":545,"topicId":5,"sentiment":6,"topicConfidence":7,"sentimentConfidence":40},"Ukrainan presidentin viesti venäläisille. Katsokaa, ja laittakaa jakoon.Message from the president of Ukraine to Russians. Please check it out and share it.",["Date","2022-02-26T11:53:25.000Z"],{"text":547,"timestamp":548,"topicId":5,"sentiment":6,"topicConfidence":215,"sentimentConfidence":215},"3 official Estonian NGOs helping Ukranian refugees",["Date","2022-02-26T11:52:18.000Z"],{"text":550,"timestamp":551,"topicId":5,"sentiment":20,"topicConfidence":241,"sentimentConfidence":337},"Morning! In Lviv, Ukraine, 50 sleeping bags are needed for orphan kids as soon as possible. I have contacts of the volunteers there. Maybe you know some organisations who can take care of it or the ways how we can send them there 🙏🏻   Thank you!",["Date","2022-02-26T10:11:28.000Z"],{"text":553,"timestamp":554,"topicId":5,"sentiment":50,"topicConfidence":7,"sentimentConfidence":357},"Hello!! i read something about help refugees from Ukrain but i cannot find the post! Was here? Thanks",["Date","2022-02-26T09:52:04.000Z"],{"text":556,"timestamp":557,"topicId":5,"sentiment":20,"topicConfidence":7,"sentimentConfidence":124},"Where and when is the protest today? Thank you!",["Date","2022-02-26T09:21:56.000Z"],{"text":559,"timestamp":560,"topicId":5,"sentiment":20,"topicConfidence":7,"sentimentConfidence":313},"It's heartwarming to see the support for Ukraine. \"Estonian Red Cross flooded with donations for Ukraine\"",["Date","2022-02-26T07:52:22.000Z"],{"text":562,"timestamp":563,"topicId":5,"sentiment":20,"topicConfidence":147,"sentimentConfidence":297},"Friends, already received many DMs with offers to host people from Ukraine. We are looking for folks to help with accommodation, please help and sign here. THANK YOU! 🇺🇦♥️",["Date","2022-02-25T20:27:53.000Z"],{"text":565,"timestamp":566,"topicId":5,"sentiment":6,"topicConfidence":7,"sentimentConfidence":195},"Hi everyone,  I've heard that the Redcross needs help for Ukraine and I am wondering if anyone in here knows where to find the list of the goods\u002Fitems that we can buy and donate? 🇺🇦",["Date","2022-02-25T18:06:24.000Z"],{"text":568,"timestamp":569,"topicId":5,"sentiment":20,"topicConfidence":7,"sentimentConfidence":35},"[UKRAINE WAR - INFORMATION ABOUT CROSSING TO POLAND] I have seen some posts asking about what are the \"rules\" for crossing to Poland. Maybe this will help someone. Additionally, there's free psychological help offered for people fleeing Ukraine, also in Ukrainian and Russian (more info below). From what I read, there is a lot of willingness to accommodate and help the refugees - both from individual people, businesses and the state. Here you will find free psychological help: 669 981 038 - free emergency telephone of the Polish Migration Forum in Ukrainian and Russian (the telephone works on Mondays from 4 to 8 PM, on Wednesdays from 10 AM to 2 PM and on Fridays from 2 PM to 6 PM) 22 566 22 27 - free telephone support of the Damian Medical Center in Polish and Russian (open on Tuesdays from 8am to 1pm, Wednesdays from 5pm to 8pm and on Fridays from 8am to 1pm) 12 421 92 82 - free 24\u002F7 number of the Crisis Intervention Center in Krakow. It is also possible to help on the spot, at ul. Radziwiłłowska 8b. Online help is also available after prior telephone contact",["Date","2022-02-25T17:49:48.000Z"],{"text":571,"timestamp":572,"topicId":5,"sentiment":20,"topicConfidence":7,"sentimentConfidence":172},"Ett otroligt tal av den ukrainska presidenten, riktat till det ryska folket. Det är ett sånt tal man ser i filmer, fast nu är det på riktigt. Alla bör se och lyssna på detta tal. 🇺🇦An incredible speech by the Ukrainian president, addressed to the Russian people. It's the kind of speech you see in movies, but now it's real. Everyone should watch and listen to this speech. 🇺🇦",["Date","2022-02-25T14:37:23.000Z"],{"text":574,"timestamp":575,"topicId":5,"sentiment":6,"topicConfidence":7,"sentimentConfidence":76},"Hi guys. Are there any demonstrations coming up against what Russia is doing in Ukraine?",["Date","2022-02-25T14:34:10.000Z"],{"text":577,"timestamp":578,"topicId":5,"sentiment":50,"topicConfidence":7,"sentimentConfidence":76},"Hello.... I am a bit worried about this kind of news.... Since Putin said that if a different state enters the current conflict, there will be consequences like never in history.... Does anyone know if the sending of arms can also be decided by the people? Or if Estonia is currently sending arms? .... I hope I don't sound envious or anything, I just want to understand better what Estonia's position is at the moment.... Fck the war pray for the people, not for the governments. https:\u002F\u002Fnews.err.ee\u002F1608512402\u002Festonia-sending-additional-weapons-aid-to-ukraine#:~:text=Estonia%20will%20send%20more%20Javelin,additional%20arms%20assistance%20to%20Ukraine.",["Date","2022-02-25T14:19:45.000Z"],{"text":580,"timestamp":581,"topicId":5,"sentiment":20,"topicConfidence":7,"sentimentConfidence":116},"Beautiful people! Someone we know is driving to the Polish border with a car to bring Ukrainian refugees but we would love to get a bus to bring more people. Does anyone here owns a bus?",["Date","2022-02-25T11:51:08.000Z"],{"text":583,"timestamp":584,"topicId":5,"sentiment":20,"topicConfidence":7,"sentimentConfidence":75},"Friends, please support us on our MASSIVE PROTEST this Saturday. We are all power, we need to be all together!  🇺🇦♥️🕊https:\u002F\u002Ffacebook.com\u002Fevents\u002Fs\u002Fmeeleavaldus-ukraina-toetuseks\u002F2934817363445521\u002F",["Date","2022-02-25T11:34:10.000Z"],{"text":586,"timestamp":587,"topicId":5,"sentiment":6,"topicConfidence":7,"sentimentConfidence":515},"Some government information on providing assistance to Ukrainian refugees here",["Date","2022-02-25T07:34:53.000Z"],{"text":589,"timestamp":590,"topicId":5,"sentiment":6,"topicConfidence":7,"sentimentConfidence":51},"Hey everyone.  I am looking for Ukrainians who live in Tallinn to prepare a demonstration in our support for Ukraine and showing the western world they must stop Putin, even if the country is not protected by NATO. The future of freedom is at stake.",["Date","2022-02-25T00:03:31.000Z"],{"text":592,"timestamp":593,"topicId":5,"sentiment":20,"topicConfidence":7,"sentimentConfidence":241},"To everyone who wants to show their support to Ukraine, and believe the world could have done more to stop this: come join us tomorrow at the Ministry of Foreign Affairs of Estonia.",["Date","2022-02-24T22:30:19.000Z"],{"text":595,"timestamp":596,"topicId":5,"sentiment":20,"topicConfidence":7,"sentimentConfidence":321},"Friends, as we said today! We will stand every day for Ukraine and peace in our world! Please join us tomorrow 25.02 at 6pm at Ravala puiestee 4, Tallinn! We need your support. The protest is registered in police. Please read the content of the event. No provocations! 🇺🇦🕊🇺🇦✊🏻",["Date","2022-02-24T22:30:01.000Z"],{"text":598,"timestamp":599,"topicId":5,"sentiment":50,"topicConfidence":7,"sentimentConfidence":157},"🇬🇧 I AM AGAINST WAR. It is shameful, painful and scary for the actions of the Russian government for many years now. Today's events are like a nightmare. And there is not a single person in my environment who would support this crime ... 🇲🇫 JE SUIS CONTRE LA GUERRE. C'est honteux, douloureux et effrayant pour les actions du gouvernement russe depuis de nombreuses années maintenant. Les événements d'aujourd'hui ressemblent à un cauchemar. Et il n'y a pas une seule personne dans mon entourage qui soutiendrait ce crime... 🇷🇺 Я ПРОТИВ ВОЙНЫ.  Стыдно, больно и страшно за действия правительства России на протяжении уже многих лет.  А сегодняшние события как страшный сон.  И нет в моем окружении ни одной человека, который бы поддерживал это преступление...",["Date","2022-02-24T11:05:00.000Z"],{"text":601,"timestamp":602,"topicId":5,"sentiment":50,"topicConfidence":7,"sentimentConfidence":93},"Can someone help me understand my Russia feels so insecure that it feels it needs to attack another country? I read about NATO, the West surrounding them, etc. But beyond that - why do they feel threatened that former Eastern Bloc countries are NATO members? It's not like anyone wants to attack Russia! In my mind it makes no sense. Can someone help me understand what the reasoning, the fear mindset, behind Putin actions are? Thanks!!!",["Date","2022-02-24T09:24:51.000Z"],{"text":604,"timestamp":605,"topicId":5,"sentiment":6,"topicConfidence":337,"sentimentConfidence":205},"Hello guys, Maybe someone knows, Where can I find an Ukrainian flag to buy?🙏🏻 Peace.",["Date","2022-02-24T08:54:20.000Z"],{"text":607,"timestamp":608,"topicId":5,"sentiment":20,"topicConfidence":7,"sentimentConfidence":241},"Here is an interesting perspective on population..... If you include the UK and Ukraine with the current population of the EU, there are ~ 550 million residents. In Russia, there are ~ 150 million residents.",["Date","2022-02-24T07:56:27.000Z"],{"text":610,"timestamp":611,"topicId":5,"sentiment":20,"topicConfidence":7,"sentimentConfidence":31},"Please join the demonstration to support Ukraine and end the war. 26 February, 15:00 at Tallinn's Freedom Square. Event has English description too. And share! https:\u002F\u002Fwww.facebook.com\u002Fevents\u002F2934817363445521",["Date","2022-02-24T07:46:15.000Z"],{"text":613,"timestamp":614,"topicId":5,"sentiment":6,"topicConfidence":7,"sentimentConfidence":341},"Sending solidarity to all Ukrainians here today. 🇺🇦 My heart breaks for all of you and what your people now have to endure. Please post your recommendations for reputable charities working for the Ukranian people, so we can help as much as we can!!! I will start: *Doctors without Borders* is in Ukraine helping civilians who are sick or injured.",["Date","2022-02-24T07:28:10.000Z"],{"text":616,"timestamp":617,"topicId":5,"sentiment":50,"topicConfidence":7,"sentimentConfidence":157},"One need to understand. The aggression will not stop in Ukraine it is against all Europe.",["Date","2022-02-24T07:19:18.000Z"],{"text":619,"timestamp":620,"topicId":5,"sentiment":20,"topicConfidence":55,"sentimentConfidence":16},"People we need your support! For peace in Europe and all world. WE WANT RUSSIANS TO STAND WITH US FOR PEACE TODAY!!!!!!!🇺🇦🇺🇦🇺🇦",["Date","2022-02-24T06:50:32.000Z"],{"text":622,"timestamp":623,"topicId":5,"sentiment":6,"topicConfidence":7,"sentimentConfidence":284},"For those interested, protest against war in Ukraine today.  16:00-17:00 in front of the Russian Embassy. Pikk street 19.Täna 16:00-17:00 Vene saatkonna ees. Aadress Pikk tn 19.  Seisa Ukrainaga mitte ainult mõtteis, vaid tegudes!",["Date","2022-02-24T06:49:33.000Z"],{"text":625,"timestamp":626,"topicId":5,"sentiment":6,"topicConfidence":7,"sentimentConfidence":8},"Dear friends, The war has started in Ukraine. Please donate money here to support Ukrainian Army (legit charity organization in Ukraine) And please demand your governments to take further actions",["Date","2022-02-24T05:15:59.000Z"],{"text":628,"timestamp":629,"topicId":5,"sentiment":20,"topicConfidence":7,"sentimentConfidence":195},"Please support peace 🇺🇦🙏🕊",["Date","2022-02-22T20:20:30.000Z"],{"text":631,"timestamp":632,"topicId":5,"sentiment":6,"topicConfidence":7,"sentimentConfidence":97},"Dear friends! Unfortunately, the events of the latest weeks and days do not show any de-escalation of the conflict from Russian Federation. From yesterday's speech of Russian president we understood that Russia is not willing to find the ways to resolve the conflict in diplomatic way and proved that all 8 years made a war with us. Russia denies Ukraine as an independent country, Russia denies Ukrainians as a nation. I believe many of you have friends, colleagues, neighbors or classmates who are Ukrainians. I hope Ukrainians showed you what beatiful, positive, smart and hospitable people we are with authentic culture, own history and big hearts. We, Ukrainians, and I believe all world are shocked that in 21 century we can again repeat sad lessons of history. We, simple people,  praying for peace and want stop the war and Russian invasion to Ukraine. Tomorrow ( 23.02) at 5pm near Russian embessy we want to ask for your support and show that we are all against the war. This event is officially organized by Ukrainian community in Estonia 🇺🇦🇺🇦♥️🕊",["Date","2022-02-22T17:27:26.000Z"],{"text":634,"timestamp":635,"topicId":5,"sentiment":6,"topicConfidence":7,"sentimentConfidence":16},"If I understand the situation correctly then Russian intentions extend beyond current borders of the so called DPR and LPR.  Anyone here from Ukraine: what can we do to help?",["Date","2022-02-22T08:29:12.000Z"],{"text":637,"timestamp":638,"topicId":5,"sentiment":50,"topicConfidence":7,"sentimentConfidence":22},"Ok ill start by saying I don't watch the news... But I keep getting text from my family back home telling me to get a plane ticket and get out of Estonia as it's not safe anymore. Due to the Ukraine\u002FRussia Conflict  Anyone not feeling safe ? Is there anything to be worried about ?  Thanks ☺️",["Date","2022-02-07T21:50:31.000Z"],{"text":640,"timestamp":641,"topicId":5,"sentiment":6,"topicConfidence":67,"sentimentConfidence":241},"Finally! FBI, FSB, KAPO, and other government agencies around the world cooperated with a bunch of (mad) scientists and they have figured out, why the electricity bills have gone so high. Forget the Nord Pool, here is the real reason ...",["Date","2022-01-17T14:31:29.000Z"],{"text":643,"timestamp":644,"topicId":5,"sentiment":20,"topicConfidence":39,"sentimentConfidence":75},"After years of hardship we wish him all the best and speedy recovery soon. Thanks to all donation and once again the goodness of humanity prevails! Mission Accomplished!!! Signing-off now",["Date","2022-01-07T19:00:27.000Z"],{"text":646,"timestamp":647,"topicId":5,"sentiment":20,"topicConfidence":648,"sentimentConfidence":55},"Hello to everyone,  I think we are nearing the goal. Many thanks to all kindhearted expats! We wish everyone good health!",["Date","2022-01-07T14:10:02.000Z"],0.35,{"id":5,"label":650,"color":651},"ukraine, ukrainian, war","#e15759",[653,656,659,662,664,667,669,671,673,675],[654,655],"ukraine",100,[657,658],"ukrainian",80,[660,661],"war",60,[663,661],"refugee",[665,666],"support",40,[668,666],"russian",[670,666],"russia",[672,666],"putin",[674,666],"border",[676,677],"poland",20],"uses":{"params":["topic_id"]}}]}
